{
  "id": "1755815351",
  "name": "TON Dev News",
  "type": "public_channel",
  "messages": [
    {
      "id": 29,
      "type": "message",
      "date": "2023-10-25T17:15:21.000Z",
      "date_unixtime": "1698254121",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Hey TON developers!\n\nWe've created the TON Dev News channel to keep you updated on the latest updates from the TON Foundation and the Dev Community.\n\nTo begin, we are pleased to share a curated list of essential resources and chats specifically designed for you in the TON ecosystem:\n\nResources for Developers\n\n🛠 Developer Portal: Your primary toolkit with the best SDKs and developer resources.\n\n📖 TON Documentation: Dive deep into TON concepts and get the know-how.\n\n🌍 Awesome TON: A treasure trove of developer resources, curated by the community.\n\n🎮 Mini Apps Platform: Telegram Mini Apps is an open web-based platform to build and deploy crypto-friendly apps and games within Telegram Messenger.\n\n🕹 TON GameFi: Discover the countless possibilities that await game developers who are ready to embrace the power of TON blockchain.\n\n💰TON Grants & Bounties: TON Foundation actively supports projects building core infrastructure, making the ecosystem more developer-friendly, building innovative use cases, or effectively utilizing Telegram Web3 Infrastructure.\n\n\nCommunity Chats & Channels\n\nTON Society Chat: Engage with TON contributors, ambassadors, and forward-thinkers.\n\nTON Community: Stay up-to-date with the latest news and updates from the TON ecosystem.\n\nTON Dev Chats: Join our global developer communities - EN, РУ, and  中文.\n\nTON Dev News: Stay updated with the latest for TON developers.\n\nHack-a-TON Chat: Participate in hackathons driven by TON Foundation.\n\nTON Contests: Official contests announcements channel.\n\nTON Tact Language Chat: Discuss and explore the Tact programming language.\n\nTelegram Developers Community: Developers Community on the Telegram platform.\n\nThe Open Network: Engage with key network updates, votings, and official announcements.\n\nTON Jobs: Explore vacancies and seize opportunities in TON projects.\n\nThis is a crucial list of community channels to stay up to date on TON development. Want to add all these chats at once?\n\n 👉 Click here to Add Folder"
    },
    {
      "id": 30,
      "type": "message",
      "date": "2023-11-07T15:42:50.000Z",
      "date_unixtime": "1699371770",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔨Dev tools updates\n\nBig thanks to our community for making a lot of these changes possible!\n\nblueprint v0.13.0\n- Added plugin support - and the first plugin, scaffold (a tool to quickly generate a simple dapp from the wrappers' code), is already available!\n- Added custom API v2 endpoints (for cases where you need to test something on a private TON network)\n- Improved docs\n- Changed deployed contract explorer link to use tonviewer\n- Moved the deployer variable to the global describe context in default tests\n\ntest-utils v0.4.0\n- Added transaction iterator helpers\n- Added find and filter transaction helpers\n- Added support for non-generic transaction matching",
      "forwarded_from": "TonTech",
      "forwarded_from_id": "channel1764902466",
      "forwarded_date": "2023-11-06T18:43:20.000Z"
    },
    {
      "id": 32,
      "type": "message",
      "date": "2023-11-13T05:35:19.000Z",
      "date_unixtime": "1699853719",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔥 W5 Challenge Winners\n\nWe are pleased to announce results of the W5 optimization challenge. People were so much enthusiastic about W5 on TON Gateway'23, that’s incredible! On behalf of the entire TON community I express my gratitude to all the participants in our contest. Your part is a big step towards the future. \n\nTo underline this sentiment we decided to amend the original rules and increase the reward for the second and third place to make it even 1 TON per 1 gas unit saved on average for all winning participants (equivalent to 0.333 TON per each gas unit over three target execution paths, as per original rules).\n\nNow, let's announce the winners.\n\n🥇 The first place goes to Skydev\n\nSkydev made two excellent contributions: a regular one and a more radical one, that involved patching the FunC compiler. \n\nSkydev's radical option achieved whopping savings of 2927 gas units over three usage scenarios (28% on average) and we assign a reward of 975 TON, or 1 TON for 1 gas unit saved on average.\n\nCongratulations!\n\n🥈The second place goes to Davide Bartoli\n\nDavide’s contribution saved 796 gas units total (7.8% on average) and we assign a reward of 265 TON.\n\n🥉 And the third place goes to Behrang Norouzinia\n\nBehrang's contribution was the most clean and straightforward and yet saved 506 gas units total (4.9% on average). And we assign a reward of 169 TON.\n \nConclusion\n\nGas price, rent price, and forwarding fees are necessary to protect the network against spam and reward validators for keeping consensus running. This is of the utmost importance because TON is a public resource shared by everyone. It is our duty as developers to make efficient use of this resource and produce the most optimal software possible. It’s doubly so for commonly used contracts such as a wallet.\n\n30% savings on a wallet contract would mean that a billion users transacting daily would save around $2-5 million each day in transaction costs, or about $1 billion annually.\n\nCongratulations to all the winners!\n\nWith love,\nTonkeeper Team 💙",
      "forwarded_from": "Oleg",
      "forwarded_from_id": "user745450",
      "forwarded_date": "2023-11-12T08:31:26.000Z",
      "media_type": "photo",
      "file": "photos/photo_32.jpg",
      "width": 1280,
      "height": 564
    },
    {
      "id": 33,
      "type": "message",
      "date": "2023-11-15T13:15:01.000Z",
      "date_unixtime": "1700054101",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Connect with the TON Dev Community\n\nThe TON Dev News platform now provides an opportunity for open-source project maintainers and founders to share releases, updates, tutorials, or activities with all TON developers.\n\n👉 If you'd like to share your developments, please fill out the form.\n\nUnleash your potential, express your creativity, and receive the recognition you deserve!"
    },
    {
      "id": 35,
      "type": "message",
      "date": "2023-11-16T13:11:41.000Z",
      "date_unixtime": "1700140301",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Introducing TonSdk.Adnl: A native ADNL Implementation in C# (over TCP) for TON\n\n🔍 We're excited to announce the launch of TonSdk.Adnl, our implementation of the ADNL protocol in C# using TCP. This development greatly simplifies the integration of ADNL into various applications within the TON Ecosystem, enhancing the security and reliability of communications.\n\n💡 TonSdk.Adnl includes features for generating ADNL addresses, as well as sending and receiving messages with encryption and digital signing. This enhances the security and efficiency of data exchanges between nodes.\n\n👥 With TonSdk.Adnl, developers can easily implement secure and reliable communication solutions in their projects, expanding the capabilities of the TON Blockchain. We believe this innovation will positively impact the development and expansion of the TON ecosystem.\n\n🔗 Links: GitHub, NuGet",
      "media_type": "photo",
      "file": "photos/photo_35.jpg",
      "width": 1280,
      "height": 640
    },
    {
      "id": 36,
      "type": "message",
      "date": "2023-11-22T01:10:27.000Z",
      "date_unixtime": "1700615427",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "The new Vim plugin for Tact is now available.\n\nWe're thrilled to announce the launch of a new official Vim plugin for the Tact language! Check it out to enhance your coding experience: Official Tact Vim Plugin.\n\n👨‍💻 Developed by the talented Novusnota, this project started as a bounty challenge and became a remarkable contribution. A well-earned reward of $1,500 in TON goes to Novusnota. Click here to see the GitHub issue. \n\n🌟 Plugin Features:\n- Syntax highlighting to make your code more readable\n- Advanced code formatting for cleaner, more efficient coding\n- Smart indentation for maintaining a consistent code style\n- Tact-specific code autocompletion to speed up your coding process\n- Handy snippets to save time and reduce repetitive coding\n\nFor more info on Tact.vim, visit Readme.\nHappy coding!"
    },
    {
      "id": 37,
      "type": "message",
      "date": "2023-11-24T10:57:26.000Z",
      "date_unixtime": "1700823446",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Anton Trunov joins the TON Foundation as the new Tact Lead.\n\nWe're excited to announce that Anton Trunov, a prominent blockchain developer, is joining TON Foundation to develop TON's smart contract language. \n\nIn the past, Anton worked on Zilliqa and Fuel ecosystems, where he played a key role in shaping the Scilla and Sway smart contract languages. He also has a strong academic background and has co-authored several papers on language design and verification.\n\nWith Anton's joining, the team also presented a new Tact roadmap packed with improvements and new features. \n\nYou can view the full roadmap on GitHub."
    },
    {
      "id": 38,
      "type": "message",
      "date": "2023-11-28T16:37:03.000Z",
      "date_unixtime": "1701189423",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "MyLocalTon latest upgrade with ton-http-api integration is here.\n\nWe're thrilled to share that MyLocalTon has just rolled out a new upgrade! This latest version introduces an integrated ton-http-api service. Check out the new release on GitHub.\n\nNeed help with the setup? \nIf you encounter any issues while setting up the ton-http-api out of the box, don't worry. Here you can find Manual ton-http-api Installation.\n\nIf you have any feedback or suggestions, feel free to reach out to @neodix and share your thoughts.",
      "media_type": "photo",
      "file": "photos/photo_38.jpg",
      "width": 1280,
      "height": 1198
    },
    {
      "id": 39,
      "type": "message",
      "date": "2023-11-29T16:24:47.000Z",
      "date_unixtime": "1701275087",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "A new FunC open-source extended library openlib.func is now available\n\nExplore Continuation Team's new FunC open-source library for smart contracts. This library reduces transaction fees in common scenarios and simplifies the development of smart contracts. \n\n📚The library contains three modules: \nopenlib.func Core: The main segment of the library offers builders for standard situations and adds new functions to simplify smart contract development. \n\ngaslib.func: Focused on managing gas parameters and converting gas-to-gram within smart contracts, this module is integral to maintaining security by monitoring gas usage.\n\nmathlib.func: This module comes with a highly optimized square root function and is set for future expansion with additional functionality.\n\nWe encourage you to add more modules to the library, which can be found here.",
      "media_type": "photo",
      "file": "photos/photo_39.jpg",
      "width": 1280,
      "height": 640
    },
    {
      "id": 41,
      "type": "message",
      "date": "2023-12-04T14:28:23.000Z",
      "date_unixtime": "1701700103",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "“We can confirm that TON reached 104,715 TPS during the 10th minute of the test,” writes Certik in their audit.\n\nStart building on TON and embrace true Web3 mass adoption with 800M Telegram users and the world’s fastest and infinitely scalable blockchain.  \n\nJoin over 160 tApps listed in the tApps Center catalog and gain exposure to hundreds of thousands of potential users. Scale your dApp with the help of Telegram Mini Apps and provide one-click access to every Telegram platform user. \n\nBy building on TON, you get exceptional speed, minimal fees and rich ecosystem focused on building Web3 future you deserve.",
      "media_type": "photo",
      "file": "photos/photo_41.jpg",
      "width": 1280,
      "height": 1279
    },
    {
      "id": 42,
      "type": "message",
      "date": "2023-12-05T13:18:39.000Z",
      "date_unixtime": "1701782319",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "New Update for TVM Instructions Search on docs.ton.org\n\nWe're excited to announce a significant improvement in the global search functionality on docs.ton.org. Previously, due to technical limitations, searching for TVM Instructions op codes was not supported.\n\nFrom now on, every TVM Instruction can be searched using Fift syntax keywords. This is a result of the dedicated efforts through the TON Bounty and further upgrades to the Algolia search system.\n\nWe believe this search update will further increase the functionality of TON developer tools.",
      "media_type": "photo",
      "file": "photos/photo_42.jpg",
      "width": 1280,
      "height": 963
    },
    {
      "id": 43,
      "type": "message",
      "date": "2023-12-07T13:12:27.000Z",
      "date_unixtime": "1701954747",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "TON20 Inscription Use-case on TON\nStarting on December 5th, The Open Network (TON) experienced an incredible spike in network activity, thanks to the BRC20 Bitcoin Ordinals type of inscription use-case, called TON20, launched by the Tonano team. \n\nProducing over 2 million transactions increased our network usage by 61 times within just half an hour. TON Community is proud to witness a creative use case take-off in TON driven by independent participants in the ecosystem.\n\nMoreover, this sudden growth has revealed many interesting insights for our blockchain. Dynamic sharding technology worked as expected. At its peak, TON split into eleven shardchains, stabilizing at five shardchains to handle the heavy load.\n\nAt the same time, this phenomenon also revealed where the community should work to swiftly onboard the exponential increase in network activity expected in the near future. Network validators must ensure that TON is supported by hardware capable of scaling to the performance demanded by high usage.\n\nNetwork Performance Delays\nThis peak interest also came with a severe congestion of TON network, where validation was severely delayed even though the network validators are still producing blocks. \n\nPopular wallets like @Wallet and Tonkeeper have paused the service temporarily.\n\nTON core developers are aware of the issues affecting users and are working on TON blockchain. An initial technical report is available here. TON core team will be providing us with a further update within the next 24 hours. \n\nWe thank you and the community for your patience and unwavering support as we go through the growing pains together, preparing for the unprecedented growth season expected in the near future.",
      "forwarded_from": "TON Community",
      "forwarded_from_id": "channel1233043722",
      "forwarded_date": "2023-12-07T12:09:13.000Z"
    },
    {
      "id": 44,
      "type": "message",
      "date": "2023-12-15T12:40:31.000Z",
      "date_unixtime": "1702644031",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Monitoring for all TON APIs is launched. It's open source, so your contributions are welcome.",
      "media_type": "photo",
      "file": "photos/photo_44.jpg",
      "width": 1280,
      "height": 657
    },
    {
      "id": 45,
      "type": "message",
      "date": "2023-12-15T15:16:35.000Z",
      "date_unixtime": "1702653395",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔨Dev tools updates\n\nblueprint v0.15.0\nThis release improves custom API capabilities. Please consult blueprint help run to see detailed flag descriptions.\n- Added flags --custom-version, --custom-key, --custom-type to run and verify commands to allow better control over custom API behavior\n- --custom now always adds jsonRPC to API URL for v2 APIs\n- Fixed argument handling",
      "forwarded_from": "TonTech",
      "forwarded_from_id": "channel1764902466",
      "forwarded_date": "2023-12-15T15:15:54.000Z"
    },
    {
      "id": 46,
      "type": "message",
      "date": "2023-12-16T15:28:31.000Z",
      "date_unixtime": "1702740511",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "An updated tutorial for the liteserver installation is available now. Thank you everyone in the TON Developer Community for the feedback."
    },
    {
      "id": 47,
      "type": "message",
      "date": "2023-12-19T11:44:26.000Z",
      "date_unixtime": "1702986266",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "New hardware requirements\n\nValidators:\n* 16 x Cores CPU\n* 64GB Memory\n* 1TB NVME SSD OR Provisioned 64+k IOPS storage\n* 1 Gbit/s network connectivity\n\nFull Nodes:\n* 16 x Cores CPU\n* 64GB Memory\n* 1TB SSD OR Provisioned 32+k IOPS storage\n* 1 Gbit/s network connectivity\n\nArchival Nodes:\n* 16 x Cores CPU\n* 128GB ECC Memory\n* 3.8TB SSD OR Provisioned 32+k IOPS storage (3.8TB assumes usage of ZFS volume with compression enabled).\n* 1 Gbit/s network connectivity\n\nNote that disk performance is important.",
      "forwarded_from": "TON Status",
      "forwarded_from_id": "channel1744725639",
      "forwarded_date": "2023-12-19T11:43:32.000Z"
    },
    {
      "id": 48,
      "type": "message",
      "date": "2023-12-19T11:46:27.000Z",
      "date_unixtime": "1702986387",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Guidlines for API clients\n\nPublic liteservers (from the global config) and free plans in TON API and Toncenter exist to get you started with TON quickly. It can be used for learning to program in TON, or for applications and scripts that do not require 100% uptime.\n\nIf you're a developer of a popular product you can use:\n\n— More advanced plans in Toncenter or TON API, which provide more requests per second and better stability. \n\n— Other APIs like dton, re:doubt, TON Access may also provide extended plans.\n\n— Run your own node. In this case please pay attention to the hardware requirements.",
      "forwarded_from": "TON Status",
      "forwarded_from_id": "channel1744725639",
      "forwarded_date": "2023-12-19T11:43:55.000Z"
    },
    {
      "id": 49,
      "type": "message",
      "date": "2023-12-19T16:38:33.000Z",
      "date_unixtime": "1703003913",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "TON Smart Challenge #5 is here! 🏆\n\nBy TON Foundation & Codeforces\n\nA ten-day contest organized by TON Foundation and Codeforces, open to both beginners and experienced FunC developers, featuring a total prize fund of $20,000 in Toncoin. Participants will have the opportunity to master their skills in real-life programming cases, unleash interesting details of TVM work, and perform complex tuple manipulations.\n\nRegistration, Submission, and Duration\n🗓 Registration starts NOW.\n🚀 The tasks will go live on December 21st.\n⏰ Submission deadline: December 30th, 23:59:59 UTC+4.\n\nTo enter the challenge, simply register via the @smartchallengebot on Telegram. The bot will guide you through the registration process and inform you when the challenge starts and the tasks are published. It will also help you submit your solutions as a legitimate participant.\n\nOne may find more details about the contest and prize distribution on this page.",
      "forwarded_from": "TON Contests",
      "forwarded_from_id": "channel1662609289",
      "forwarded_date": "2023-12-19T15:31:05.000Z"
    },
    {
      "id": 50,
      "type": "message",
      "date": "2023-12-20T14:26:44.000Z",
      "date_unixtime": "1703082404",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Tonkeeper 3.5  is now live\n\nUpdates:\n- migration to ton-core\n- now supports more than 255 cells in BoC and exotic cells"
    },
    {
      "id": 51,
      "type": "message",
      "date": "2023-12-20T15:17:07.000Z",
      "date_unixtime": "1703085427",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Updated metadata and DNS standards\n\n2 TEPs were updated:\n- 0064-token-data-standard.md (merging semi-chain metadata)\n- 0081-dns-standard.md (remove unused smc_capabilities)\n\nPlease update your libraries to reflect the new standards."
    },
    {
      "id": 52,
      "type": "message",
      "date": "2023-12-20T21:52:26.000Z",
      "date_unixtime": "1703109146",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Validators voted to activate TVM update\n\nNow TON developers even more equipped to develop cutting edge protocols.",
      "forwarded_from": "The Open Network",
      "forwarded_from_id": "channel1379327992",
      "forwarded_date": "2023-12-20T19:12:16.000Z"
    },
    {
      "id": 53,
      "type": "message",
      "date": "2023-12-21T10:15:07.000Z",
      "date_unixtime": "1703153707",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "The TON Development plugin is back on JetBrains Marketplace\n\nAfter temporary suspension and 1-month negotiations, the TON Development plugin returns to the marketplace. The JetBrains team changed the pluginID, so it's necessary to reinstall it from the marketplace.\n\nUpdate instructions:\n1. Remove the old version\n2. Restart WebStorm (or IDE you use)\n3. Install the new version\n\nClick here to access the plugin.",
      "media_type": "photo",
      "file": "photos/photo_53.jpg",
      "width": 1280,
      "height": 970
    },
    {
      "id": 54,
      "type": "message",
      "date": "2023-12-22T13:31:28.000Z",
      "date_unixtime": "1703251888",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "💎 Wallet Pay update: autoconversion feature\n\nWallet Pay has received an important update – the introduction of the autoconversion feature for all merchants on Telegram.\n\nAutoconversion allows sellers to specify their preferred cryptocurrency for receiving payments, regardless of the cryptocurrency customers use for goods or services in Telegram.\n\nHere's how it works\n\nWhen creating a payment order, merchants can enable autoconversion, choosing from three supported cryptocurrencies: TON, USDT, or BTC. When customers pay for a product or service on Telegram, merchants will receive the cryptocurrency specified in the autoconversion parameters.\n\nDo you have an example?\n\nCertainly, imagine you sell virtual reality headsets and have enabled autoconversion to USDT. If a customer purchases the cutting-edge gadget with BTC, you'll receive payment in USDT instantly (Wallet Pay will automatically convert the crypto at the market rate).\n\nFor more details on autoconversion terms and to apply to connect Wallet Pay to your service, visit this link: https://pay.wallet.tg 👈",
      "forwarded_from": "Wallet News",
      "forwarded_from_id": "channel1624773544",
      "forwarded_date": "2023-12-22T13:28:04.000Z"
    },
    {
      "id": 55,
      "type": "message",
      "date": "2023-12-25T18:22:31.000Z",
      "date_unixtime": "1703528551",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "https://tonapi.io/v1/ will be disabled on 2023.12.27.\nPlease migrate to /v2/.",
      "forwarded_from": "Ton Console",
      "forwarded_from_id": "channel1610779830",
      "forwarded_date": "2023-12-20T17:23:12.000Z"
    },
    {
      "id": 56,
      "type": "message",
      "date": "2023-12-26T11:13:19.000Z",
      "date_unixtime": "1703589199",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔨 Dev Tools Updates\n\nThroughout Q4 2023, working alongside Telegram, Wallet, Tonkeeper, Getgems, and TON Diamonds teams, we proudly announce the stable release of TON Connect UI 2.0.0.\n\nThis release greatly improves user interaction with Telegram Mini Apps and resolves numerous issues, offering the best TON Connect UI experience to date!\n\n👥 @tonconnect/{ui-react,ui} v2.0.0\n• Quick browser-to-Telegram transitions without extra tabs.\n• Enhanced UX with TON Space on Telegram devices.\n• Multiple Safari and Privacy Mode fixes.\n• New no-bounceable address format.\n• Optimized application loading speed.\n• Back button handling for Android, discreetly hiding modal windows.\n• Plus over 50 additional enhancements and fixes.\n\n🙂 Experience it yourself using these links:\n• https://ton-connect.github.io/demo-dapp-with-wallet for browsers.\n• https://t.me/tc_twa_demo_bot/start for Telegram Mini Apps.\n\n💬 Encounter issues? Please report them on GitHub at https://github.com/ton-connect/sdk/issues.\n\n🎁 Special thanks to the collaborative teams for their invaluable assistance in making these enhancements possible.",
      "forwarded_from": "TonTech",
      "forwarded_from_id": "channel1764902466",
      "forwarded_date": "2023-12-26T11:07:10.000Z"
    },
    {
      "id": 58,
      "type": "message",
      "date": "2023-12-29T11:13:37.000Z",
      "date_unixtime": "1703848417",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Bot API 7.0\n\nAnnouncing our biggest Bot API update yet!\n\nReactions\n• Introducing full reaction support for bots.\n• Bots can now react to messages with setMessageReaction.\n• Message reactions now generate updates for bots.\n• Added the available_reactions field to the class Chat.\n\nReplies 2.0\n• Bots can now reply to messages in other chats or topics.\n• Added the ExternalReplyInfo class, to track replies across chats.\n• The new class ReplyParameters replaces individual reply options in all relevant methods and lets bots quote parts of any message.\n• The new field quote of the class Message lets bots detect incoming quoted text.\n\nLink Preview Customization\n• Bots can now set a custom URL to generate link previews in outgoing messages.\n• Added support for custom size and position of link previews.\n• Added the class LinkPreviewOptions to support these new options.\n\nBatch Actions\n• Bots can now delete multiple messages in a single request via deleteMessages.\n• Bots can now forward or copy multiple messages in a single request via the respective forwardMessages and copyMessages methods.\n\nBoosts & Giveaways\n• Added support for Giveaway messages, allowing bots to detect their creation and completion.\n• Added updates about chat boost changes via the new classes ChatBoostUpdated and ChatBoostRemoved.\n• Bots can now see if a boost came from a premium sub, a gift code, or a giveaway, as well as check all active user boosts via getUserChatBoosts.\n\nGeneral\n• Blockquotes are now supported in MarkdownV2 and HTML parse modes.\n• Web Apps won't close when calling openTelegramLink.\n• Web Apps can now toggle the visibility and on-click behavior of the Settings Button.\n• Bots can now request multiple users, see KeyboardButtonRequestUsers.\n• The class Chat has new fields holding profile and background colors, custom emoji, and more.\n\n\n• And a great deal more. See the full changelog for details:\n\nhttps://core.telegram.org/bots/api-changelog#december-29-2023\n\nHappy Holidays from the Telegram Team 🎆",
      "forwarded_from": "BotNews",
      "forwarded_from_id": "channel1004276399",
      "forwarded_date": "2023-12-29T10:26:31.000Z"
    },
    {
      "id": 59,
      "type": "message",
      "date": "2024-01-11T10:45:42.000Z",
      "date_unixtime": "1704969942",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Attention TON Developers 👍\n\nThe TON Dev Community calls on your expertise to contribute to advancing the TON ecosystem. Your insights and experiences in development are invaluable in making TON more robust and user-friendly.\n\nWe aim to set up a project rapidly, even in a single evening. The TON Foundation is dedicated to crafting an exceptional experience for all, whether you are just beginning your coding journey or an experienced developer.\n\nWe encourage every community member to share their experiences with TON development by participating in our survey.\n\nThe survey encompasses four key topics and will take approximately 5-8 minutes of your time.\n\nWe invite you to contribute to this important initiative and share your valuable experiences here:\n👉 https://agkcv6ne.paperform.co/",
      "media_type": "photo",
      "file": "photos/photo_59.jpg",
      "width": 1280,
      "height": 952
    },
    {
      "id": 62,
      "type": "message",
      "date": "2024-01-19T20:20:41.000Z",
      "date_unixtime": "1705695641",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🚀 AigentX & TON Blockchain Launch AI Support Agent for TON Developers!\n\nWe're excited to reveal AI Support Agent, your personal AI support. This AI bot integrated into Telegram provides instant answers and guidance directly from TON's documentation to assist you through technical complexities, simplifying the development process. \n\n📘 KnowledgeBaseAI: Instant documentation access.\n🤖 Advanced LLM: Concise, correct responses.\n🧠 Enhanced Neural Networks: Superior testing, formatting, deep thinking, and fact-checking.\n🗣Over 100 Languages: The bot can understand over 100 languages, including voice messages. \n\nAigentX contains knowledge from over 5,000 blockchain documents, always providing a reliable and source-backed solution. It constantly evolves based on your interactions and feedback and revolutionizes development on TON with over 98% accuracy. \n\nGive it a try @tonsupport_aibot!"
    },
    {
      "id": 63,
      "type": "message",
      "date": "2024-02-07T13:04:59.000Z",
      "date_unixtime": "1707311099",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "New Tact Language Tool! 🛠\n\nIntroducing the official Tree-sitter parser for Tact, developed by novusnota.\n\nThe Tree-sitter parser provides syntax highlighting, code folding, symbol extraction for the Tact language in many text editors, including Neovim and Helix. Additionally, it can be used in the future for syntax highlighting for Tact projects on GitHub. \n\nNovusnota received $3,000 reward for completing the bounty request. \n\n👉Try it out here",
      "media_type": "photo",
      "file": "photos/photo_63.jpg",
      "width": 1280,
      "height": 426
    },
    {
      "id": 64,
      "type": "message",
      "date": "2024-02-12T14:21:50.000Z",
      "date_unixtime": "1707747710",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "toncenter.com has created a new channel @toncenter_news with service news — link"
    },
    {
      "id": 65,
      "type": "message",
      "date": "2024-02-15T12:55:08.000Z",
      "date_unixtime": "1708001708",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "TON is now in popular package managers\n\nDevelopers can now install a TON binaries and libraries (func, fift, lite-client, proxy and other) via apt install (Ubuntu, Debian, Linux Mint), homebrew (Mac), yum install (RedHat, Fedora, CentOS), pamac (Manjaro, RebornOS, Arch Linux) and chocolatey (Windows).\n\nAvailable on x86-64 and aarch64 (arm64) platforms.\n\nInstallation commands and description »\n\nWe remind you that you can also download TON binaries for Linux, Mac and Windows from GitHub Autobuilds, or compile it yourself from sources (docs).\n\nThanks to Neodix for the continuous improvement of the TON build systems."
    },
    {
      "id": 66,
      "type": "message",
      "date": "2024-02-15T13:49:35.000Z",
      "date_unixtime": "1708004975",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔨Dev tools updates\n\nblueprint v0.16.0\n- Custom network may now be specified in the config (see the readme!)\n- Improved verify command\n- New convert command to convert legacy build scripts into blueprint compile files\n- Added the ability to pass user data into compile hooks",
      "forwarded_from": "TonTech",
      "forwarded_from_id": "channel1764902466",
      "forwarded_date": "2024-02-15T13:46:57.000Z"
    },
    {
      "id": 67,
      "type": "message",
      "date": "2024-02-19T13:36:28.000Z",
      "date_unixtime": "1708349788",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Meet the Toncenter API V3\n\nIt's an Indexer TON API, and we also call it \"Turbo Indexer\" because it's really fast: the indexer written in C++ works directly with the node database.\n\nWe started developing it while preparing for the world TPS record, when it became clear that the TON blockchain was holding a lot of load, but the supporting infrastructure wasn't always keeping up.\n\nKey Features:\n\n— Unprecedented indexing performance;\n\n— Accounts, transactions, messages and blocks API. More methods and data than API V2;\n\n— Jettons and NFTs API;\n\n— Address Reform API;\n\n— The naming of fields and structures is the same or close to the naming in the node;\n\n— Fully open source, GPL-3.0 license;\n\n— You can run your instance (archive node required);\n\nIn the next step, we plan to expand the V3 functionality even further.\n\nWe will also continue to support API V2, which makes queries directly to node and is indispensable for some tasks.\n\nMainnet API V3 - https://toncenter.com/api/v3/\n\nTestnet API V3 - https://testnet.toncenter.com/api/v3/\n\nAPI Keys - @tonapibot\n\nSources - https://github.com/toncenter/ton-indexer",
      "forwarded_from": "Toncenter API",
      "forwarded_from_id": "channel2143019393",
      "forwarded_date": "2024-02-19T13:33:28.000Z"
    },
    {
      "id": 69,
      "type": "message",
      "date": "2024-02-20T11:27:46.000Z",
      "date_unixtime": "1708428466",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔥 W5 revision 2\n\nDear community, I'm proud to present the second revision of Wallet V5 project. I invite you to take a look at the specification and FunC source code, ask questions and give us all sorts of feedback.\n\n👉 Specification\n👉 FunC source for W5r2\n\n💬 Discussion group for W5: https://t.me/+yNtJhu0BS6lmYWI0\n\nWhat's new in revision 2?\n\nBased on the valuable feedback from TON core team, we have addressed safety concerns in W5r1:\n1. We removed support for setdata and setcode actions,\n2. Wallet enforces sendmode flag 2 for all \"send message\" actions.\n3. The wallet ABI is still compatible with original \"wrapped C5 register\" design, meaning that it is possible to swap out safe version of the wallet for unsafe one and still be able to use existing SDKs and tools without modification. (Might be useful in specific high-load usage on masterchain to save fees.)\n\nAlso, compared to revision 1:\n4. New optimizations are added throughout by the contest winner @Skydev.\n5. New operation type is available: turning signature verification on and off. This is an important feature for account recovery and migration use-cases, and it completes the authentication scope: wallet can be authenticated by signature and/or extension, in any combination of the two. For safety, sig auth cannot be disabled when there is no extension installed to avoid complete lockout.\n\nProject timeline\n\nAug 2023 — initial sketch\nSept 2023 — first working revision\nOct 2023 — optimization challenge\nNov 2023 — feedback & design review with TON community\nJan 2024 — revision 2 early preview\nFeb/Mar 2024 — audit & peer review\nMar 2024 — experimental support in Tonkeeper Pro\n\nWe are eager to get your feedback, please let us know what you think!\n\n💬 Discussion group for W5: https://t.me/+yNtJhu0BS6lmYWI0",
      "forwarded_from": "Oleg Andreev",
      "forwarded_date": "2024-02-20T10:40:05.000Z"
    },
    {
      "id": 70,
      "type": "message",
      "date": "2024-02-21T08:31:32.000Z",
      "date_unixtime": "1708504292",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Developers from all over the world, you're invited👩‍💻👨‍💻\nTON Hackerhouse 2024 - TON DEV Journey is now Live🚀\n\nExperience the journey with\n6 Workshops 🎓\n2 Demo Days 💡\n1 Hacker House 🏠\n\nFirst stop: Taipei on 2/23 \nDon't miss the kick-off at the first workshop!\nHere\n\nCan't make it in person? \nCatch the second Journey online on 2/24\nHere\n\nExclusive Rewards \n📌 Join the Journey: Here\n🌐 Fill your TON address: Provide it during events.\n🎉 Multiply surprises: More events, more surprises!\n\nOfficial Website: https://tonhackerhouse.com\nOfficial Twitter: https://twitter.com/TONHackerHouse\nJourney Calender: https://lu.ma/tonhackerhouse",
      "forwarded_from": "TONX 💎",
      "forwarded_from_id": "channel1884357376",
      "forwarded_date": "2024-02-20T14:42:14.000Z"
    },
    {
      "id": 71,
      "type": "message",
      "date": "2024-02-21T13:41:17.000Z",
      "date_unixtime": "1708522877",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Introducing @liteserver_bot: Your Gateway to Enhanced LiteServer Performance!\n\n🚀 Supercharge your applications with our private lite channels!\n\nExperience seamless performance with our cutting-edge auto ADNL balancer and read-only LiteServers, ensuring your applications stay up-to-date and stable even under heavy TON user traffic.\n\nBut that's not all! Stay tuned for upcoming features like auto message delivery and seamless integration with dton.io <> LS for proofs for get_nft / get_jettons requests.\n\nStay in the loop! Subscribe to @dtonforum for exciting updates.\n\nReady to elevate your application's performance? Enjoy a special 5% discount on our 12-month RPS rate. Act now, only at @liteserver_bot! 😜",
      "forwarded_from": "dTON Forum",
      "forwarded_from_id": "channel1609034703",
      "forwarded_date": "2024-02-21T12:20:00.000Z",
      "media_type": "photo",
      "file": "photos/photo_71.jpg",
      "width": 684,
      "height": 298
    },
    {
      "id": 72,
      "type": "message",
      "date": "2024-02-23T21:10:15.000Z",
      "date_unixtime": "1708722615",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔨 Assets SDK Launch\n\nWe are excited to announce the release of the Assets SDK for interactions with Jettons and NFTs.\n\n👥 @ton-community/assets-sdk v0.0.4\n  • Works on servers, browsers, and CLI.\n  • Deploy, mint, and transfer with ease.\n  • Fetch and upload data effortlessly.\n  • Compatible with custom contracts.\n  • Integrates with TON Connect and Blueprint.\n  • Serialization/deserialization of messages.\n  • Parses transactions for contract actions.\n\n⬇️ To install, run npm install @ton-community/assets-sdk.\n\n💡To learn more, visit the GitHub page at https://github.com/ton-community/assets-sdk.\n\n💬 Encountered issues? Please report them on GitHub at https://github.com/ton-community/assets-sdk/issues.\n\n🎁 Your feedback and usage examples are crucial. Share your experiences to help us evolve the SDK!",
      "forwarded_from": "TonTech",
      "forwarded_from_id": "channel1764902466",
      "forwarded_date": "2024-02-23T20:45:29.000Z"
    },
    {
      "id": 73,
      "type": "message",
      "date": "2024-02-26T10:05:03.000Z",
      "date_unixtime": "1708941903",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Mainnet Validators and Liteserver owners\n\nPlease update your node software (see \"Target versions\")\n\nInstructions for update. Note new section 5 for validators and section 6 for Liteserver owners.\n\nTarget versions:\nmytonctrl b9d5937\nvalidator 692211f\n\nThis update is mandatory for validators and lite servers.\n\nUpdate includes:\n- LS improvements: remote runmethods with full c7 and libs, caching, logging\n- Precise control of open files\n- Improvement of validator synchronization",
      "forwarded_from": "TON Status",
      "forwarded_from_id": "channel1744725639",
      "forwarded_date": "2024-02-26T10:02:15.000Z"
    },
    {
      "id": 74,
      "type": "message",
      "date": "2024-02-26T10:18:49.000Z",
      "date_unixtime": "1708942729",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🎮 Phaser SDK for TON blockchain is available!\n\nAfter several months of development, Phaser SDK beta is available for game developers. The SDK simplifies TON integration for games using Phaser Game Engine.\n\nPhaser SDK provides the following features:\n- TON Connect integration, including connect button and full authorization flow\n- Extends Assets SDK to make all essential functions available in the Phaser environment\n- SDK allows creation, transfer, data fetching for NFTs, and payments management for TON and jettons.\n\n\n⬇️ To install, run npm install @ton/phaser-sdk\n\nTo learn complex use cases read TON GameFi article and check out the source code of demo Flappy Bird game.\n\n\n💡To learn more, visit the GitHub page at https://github.com/ton-org/game-engines-sdk.\n\n💬 Encountered issues? Please report them on GitHub at https://github.com/ton-org/game-engines-sdk/issues.\n\n🎁 Your feedback and usage examples are crucial. Share your experiences to help us improve the SDK!"
    },
    {
      "id": 75,
      "type": "message",
      "date": "2024-02-27T11:15:32.000Z",
      "date_unixtime": "1709032532",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Toncenter extended plans\n\nWe have done extensive work on upgrading the Toncenter infrastructure and are happy to note that now more than 100 servers are running on our system. In addition, we have implemented the ability to dynamically add new ton-http-api instances in runtime.\n\nIn order to be able to provide you with the expected level of performance we are introducing extended plans:\n\n— Free: 1 API Key, 10 RPS;\n\n— Plus: 3 API Keys, 25 RPS, Privately hosted Liteservers, 5.9 TON / month;\n\n— Advanced: 10 API Keys, 100 RPS, Privately hosted Liteservers, 59 TON / month;\n\nFree open source code is still available, so you can run a fully functional api yourself.\n\nWe guarantee that a free plan will always exist at toncenter.com, for a quick start for developers. However, if you are developing a popular service or a service that needs high uptime, we recommend that you consider an extended plan.\n\nYou can check out the plans in our bot @tonapibot.",
      "forwarded_from": "Toncenter API",
      "forwarded_from_id": "channel2143019393",
      "forwarded_date": "2024-02-27T11:11:05.000Z"
    },
    {
      "id": 76,
      "type": "message",
      "date": "2024-03-02T15:51:15.000Z",
      "date_unixtime": "1709394675",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔣 TicTon Oracle Competition2: Arbitrage🔣\n\n💗 Join TicTon Oracle Tournament & Earn an NFT!\n\n🎮 Test on the Ton test chain\n\n💋 How to join?\n\nSign up using TicTon bot, and get the program running with this Github repo!\n\n🎁 Reward Mechanism:\n\nTicTon Program Runners:\n\n➖ Participants contributing to price stability earn points. \n➖ Top 50% of participants will receive a 💎 NFT, distinct from the NFTs awarded through the Telegram bot.\n\n🍸 Higher-tier NFTs will get priority for early TIC TOKEN releases.\n\n⚡️ Priority: 💎 > 🥇 > 🥈 > 🥉\n\n🔋 Testing Period: Mar 2 - Mar 10\n\n🔣TICTON Official🔣",
      "forwarded_from": "TICTON Official🎐",
      "forwarded_from_id": "channel2027680808",
      "forwarded_date": "2024-03-02T14:57:36.000Z",
      "media_type": "photo",
      "file": "photos/photo_76.jpg",
      "width": 1280,
      "height": 640
    },
    {
      "id": 77,
      "type": "message",
      "date": "2024-03-04T08:53:12.000Z",
      "date_unixtime": "1709542392",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Since launch of A Careers is coming, we are opening A Careers smart-contracts for a public review and judgement. Still some minor fixes possible, but in general it is 100 percent ready and working. Happy for any commitments or contributions.\n\nhttps://github.com/the-real-some-dao/a-careers-smc\n\nRemind you that you can become a beneficiary of the protocol, playing our clicker game @A_CLICKER_BOT\n\nA contract for managing this and similar dApps is coming next. Stay tuned 🚀.",
      "forwarded_from": "Gradoally",
      "forwarded_from_id": "channel1148407654",
      "forwarded_date": "2024-03-03T06:35:19.000Z"
    },
    {
      "id": 78,
      "type": "message",
      "date": "2024-03-05T12:37:54.000Z",
      "date_unixtime": "1709642274",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🚀 Tact v1.2.0 Release Highlights \n\nNew Tact v1.2.0 is now live with features requested by the community. \n\n—  Fresh assignment operators  +=, -=, *=, /= and %=\n—  Readability boost with underscores in large numbers: 1000000000 »»  1_000_000_000\n—  Added binary and octal literals: 0b1010_0101, 0o4242_0376 \n—  Added support for ternary conditional operators let foo: Int = your_condition ? 42 : 0 .\n—  The equality and non-equality operators (== and !=) now support slices and strings by comparing the hashes of the left-hand and right-hand sides.\n\nBoth the official VS Code plugin for Tact and tact.vim have been updated with the new features. \n\nHappy Coding!"
    },
    {
      "id": 79,
      "type": "message",
      "date": "2024-03-06T10:27:29.000Z",
      "date_unixtime": "1709720849",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Introducing TON Research\n\nTON Research is now available as the go-to research forum for the TON Ecosystem, dedicated to exploring and advancing TON Blockchain.\n\nThis platform focuses on comprehensive research into TON Blockchain's future developments, including TEP, protocols, standards, and more. It offers a wide array of development tools such as SDKs, Mini Apps, Tact, FunC, and APIs, supporting multiple programming languages to help developers craft innovative applications.\n\nAdditionally, TON Research serves as a hub for engaging discussions on smart contract security and code auditing, while also encouraging conversations that go beyond the technical realm. The platform addresses projects, economics, design concepts, and even philosophical issues.\n\nBonus Program\nTo boost community engagement, TON Research has introduced a reward program, details of which can be found here.\n\nJoin TON Research and discover the endless opportunities of TON Blockchain.",
      "forwarded_from": "TON Community",
      "forwarded_from_id": "channel1233043722",
      "forwarded_date": "2024-03-06T10:00:05.000Z"
    },
    {
      "id": 80,
      "type": "message",
      "date": "2024-03-07T11:00:50.000Z",
      "date_unixtime": "1709809250",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🌷 Tonkeeper Desktop on Windows\n\nThe long winter is over and Tonkeeper runs on Windows machines! Getting a secure signing certificate for Windows turned out a remarkably complicated logistical puzzle, but we have solved it and now finally Tonkeeper is available on all major platforms.\n\nWe have also added a sidebar to make navigation easier among many of your wallets. This is one more step towards Tonkeeper Pro, stay tuned for more updates!\n\nDownload Tonkeeper Desktop for Windows, Mac and Linux:\n\n👉 tonkeeper.com/desktop",
      "forwarded_from": "Tonkeeper News",
      "forwarded_from_id": "channel1537427825",
      "forwarded_date": "2024-03-06T11:59:52.000Z",
      "media_type": "photo",
      "file": "photos/photo_80.jpg",
      "width": 1280,
      "height": 853
    },
    {
      "id": 81,
      "type": "message",
      "date": "2024-03-07T14:17:49.000Z",
      "date_unixtime": "1709821069",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔧 Introducing TON Replay\n\nAs our blockchain ecosystem thrives with countless developers and projects, evolving becomes a cautious task. Changes could unpredictably impact the ecosystem, making upgrades a slow and meticulous process. Often, theoretical issues might not even affect real-world applications.\n\n🌟 But, there's a breakthrough! TON Core has launched the TON Replay project to tackle this challenge. The first fruit of this initiative is TonTVMReplay, developed by DTON. This tool emulates historical transactions on updated versions of the TON Virtual Machine (TVM). This means we can now test how real projects react to upgrades or network configuration changes before implementing them, ensuring smoother and safer evolution.\n\n🔍 Looking Ahead: TON Replay isn't stopping there. We're developing advanced features for smarter checks. The goal is to ensure the practical outcomes of transactions—like transfers, swaps, and more—remain consistent, even if the transactions themselves change. This will enable us to run mirror networks and make significant, yet safe, modifications to the transaction executor.\n\n🛠 More from DTON: Besides TonTVMReplay, DTON is also behind other developer-friendly projects, such as their blockchain index dton.io and the recently launched LSaaS (liteserver-as-a-service) via @liteserver_bot."
    },
    {
      "id": 82,
      "type": "message",
      "date": "2024-03-15T16:56:33.000Z",
      "date_unixtime": "1710521793",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🏆 MyTonWallet Contest for iOS Developers\n\nPrize fund: up to $25,000\nDeadline: 23:59 on March 28th (Dubai time)\nResults: April 12th, 2024\n\nThe Task is to implement the new design for MyTonWallet as a new Swift app based on the provided mockups and archive with animations. Your submission must precisely represent the provided design – this includes all elements, their proportions and position on the screen, as well as their animations and transitions.\n\nRequired Functionality (Screens)\n1. Auth Flow, including both creating and importing wallets.\n2. Main Screen listing all user's tokens and recent transactions.\n3. Transaction Info Modal featuring several transaction types.\n\nDetails\nWhile the task involves developing a new Swift app, some existing code from our current JavaScript app must be reused. Specifically, the API and blockchain integrations (which is already standalone and currently exposed as a web worker). To achieve this, a bridge must be implemented to allow running JavaScript process from the Swift environment (e.g., in an invisible WebView). This approach enables leveraging our existing API abstractions and focusing on the UI part without delving deeply into blockchain-related programming.\n\nEvaluation Criteria\nDuring the evaluation stage our judges will test the submissions on a broad range of iOS devices. The key factors that will be used to determine the best apps are:\n\n· The general aesthetics of the app.\n· Adherence to the provided mockups and design elements. \n· Attention to the tiniest details in the user experience.\n\nThe smoothness of animations and the overall stability of the app will play a major role. Last but not least is the absence of significant flaws (including crashes, performance issues, battery drains, visual glitches, noticeable element blinking, layout imperfections and more). \n\nSubmissions\nContestants will be able to submit their entries to @MyTonWalletBot. We will further clarify the submission instructions closer to the deadline.",
      "forwarded_from": "MyTonWallet · News",
      "forwarded_from_id": "channel1729567684",
      "forwarded_date": "2024-03-14T11:05:11.000Z"
    },
    {
      "id": 83,
      "type": "message",
      "date": "2024-03-19T15:35:14.000Z",
      "date_unixtime": "1710862514",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "@ton/core update 0.56.2\n\nFixed cell serialization and hashes calculation for PrunnedBranch exotic cells.\n \nDevelopers, please pay attention to cell hashes in your projects. \n\nBig thanks for @yungwine and @Gusarich for reporting this",
      "forwarded_from": "dvlkv",
      "forwarded_from_id": "channel1580872533",
      "forwarded_date": "2024-03-19T15:34:40.000Z"
    },
    {
      "id": 84,
      "type": "message",
      "date": "2024-03-25T16:07:56.000Z",
      "date_unixtime": "1711382876",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Smart Contract Cracking Competition - Jetton With Governance\n\nPrize fund: Up to 20 000 TON (more than $100,000 at the moment) \nDeadline: 18:00 on April 1st (UTC)\nWho can participate: Everyone\n\nThe Task is to identify potential vulnerabilities and issues in the new Jetton with Governance smart contract.\n\nEvaluation Criteria and Prize Fund Distribution:\n\nYou will be rewarded the most if you can find critical vulnerabilities, such as unplanned loss or theft of jettons or gaining admin rights.\n\nMinor flaws that do not affect security may be rewarded with a small bonus or no reward at all.\n\nNon-code issues (e.g. social engineering) are not considered.\n\nDetails: \n\nBranch \"main\", commit 22fec6b69e4800ace71cc5fbf0b06f4d36af120a.\n\nSubmissions:\n\nSubmit an issue on GitHub.",
      "forwarded_from": "TON Contests",
      "forwarded_from_id": "channel1662609289",
      "forwarded_date": "2024-03-25T16:04:09.000Z"
    },
    {
      "id": 85,
      "type": "message",
      "date": "2024-03-27T20:38:48.000Z",
      "date_unixtime": "1711571928",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "tonutils-go v1.9.1 released, please update\n\nUpdate is needed because:\nA new version of LiteServer has been deployed to the testnet that changes the way it proves block shard information for GetBlockShardsInfo method. This update removes the state proof in the second root and uses only a single root with block proof. As a result, this new LiteServer version is incompatible with previous versions of LiteServer and proof verification of GetBlockShardsInfo fails.\n\nv1.9.1 supports both LS versions, it is safe to update for both networks",
      "forwarded_from": "Oleg Baranov",
      "forwarded_date": "2024-03-21T17:54:36.000Z"
    },
    {
      "id": 86,
      "type": "message",
      "date": "2024-03-27T20:39:23.000Z",
      "date_unixtime": "1711571963",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "The Open League Hackathon\n\nTL:DR:\n▪TON Foundation has launched The Open League Hackathon, a fast track into The Open League, with over $150 million in project and user incentives. \n▪The hackathon itself runs from April to June and has a $2 million prize pool.\n▪Contestants will build new Web3 Onboarding & GameFi, Web3 Social, DeFi, and eCommerce use cases on TON and Telegram.\n\nWhy apply?\n▪️ $2 million prize pool.\n▪️ Fast track to The Open League program with a 50,000 Toncoin boost for your token's liquidity pool.\n▪️Top projects may secure funding from a $500,000 pool provided by TON Ventures.\n▪️A chance to meet with TON Foundation members and VC/investors on TON in Dubai during Gateway.\n\nProjects part of The Open League pilot season have seen triple digit growth in active users, token holders, market capitalization and trading volume across TON DEXes. And that was with only 1 million Toncoin in Rewards. For Season 1 - rewards will 30x to 30M Toncoin for 3 months (3 seasons). \n\nThink you can beat the competition? It’s time to build on TON.\n\nRegister now.",
      "forwarded_from": "TON Community",
      "forwarded_from_id": "channel1233043722",
      "forwarded_date": "2024-03-26T18:08:44.000Z",
      "media_type": "photo",
      "file": "photos/photo_86.jpg",
      "width": 1280,
      "height": 1280
    },
    {
      "id": 88,
      "type": "message",
      "date": "2024-03-31T19:40:06.000Z",
      "date_unixtime": "1711914006",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Bot API 7.2\n\nTelegram Business\n• Bots can now manage private chats of Telegram Business subscribers who connect them to their account – check out BusinessConnection.\n• Connected bots will receive updates about new messages, message edits and deletions in business chats they manage.\n• Added the parameter business_connection_id to most send methods – to send messages on behalf of business users.\n• Bots can now see business account details, such as their intro, opening hours and location.\n\nRequest Names, Usernames and Photos\n• Bots can now request names, usernames and photos via new fields in the KeyboardButtonRequestUsers class.\n• Likewise, bots can now use KeyboardButtonRequestChat to request chats' titles, usernames and photos.\n\nStickers\n• Introduced support for mixed-format sticker packs.\n• Regular sticker sets now support up to 120 stickers.\n• Bots can now upload WEBM stickers using sendSticker.\n• Simplified sticker replacement via the new replaceStickerInSet method.\n\nGeneral\n• Mini Apps now support biometric authentication.\n• The Chat class may now contain the user's birthday and personal channel.\n\n• And more, see the full changelog for details:\n\nhttps://core.telegram.org/bots/api-changelog#march-31-2024\n\nNote: We have updated our Terms of Service for Telegram Bot Developers, kindly check out the latest version here.",
      "forwarded_from": "BotNews",
      "forwarded_from_id": "channel1004276399",
      "forwarded_date": "2024-03-31T18:01:57.000Z"
    },
    {
      "id": 89,
      "type": "message",
      "date": "2024-04-01T15:53:33.000Z",
      "date_unixtime": "1711986813",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "ton-http-api typescript v2.0.3\n\nGlad to present you the ton-http-api library with type support, we have implemented all the functions you use when working with toncenter!\n\nWhat is included in the library?\n- toncenter API V2 \n- toncenter API V3\n- client for toncenter API V2\n- client for toncenter API V3\n- block subscriber for toncenter API V2\n- block subscriber for toncenter API V3\n\nYou can read the documentation here.\n\nYou can find examples of use here.\n\nFor any updates, please write to issue."
    },
    {
      "id": 90,
      "type": "message",
      "date": "2024-04-02T10:52:58.000Z",
      "date_unixtime": "1712055178",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Toncenter API v3 updates\n\n- Method /api/v3/transactions now supports querying transactions for multiple account using parameter \"include_account\".\n- Method /api/v3/nft/items can find NFT in collection by it's index.",
      "forwarded_from": "Toncenter API",
      "forwarded_from_id": "channel2143019393",
      "forwarded_date": "2024-04-02T10:52:45.000Z"
    },
    {
      "id": 91,
      "type": "message",
      "date": "2024-04-03T13:04:21.000Z",
      "date_unixtime": "1712149461",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Smart Contract Cracking Competition - Multisig 2.0\n\nPrize fund: Up to 20 000 TON (more than $100,000 at the moment) \nDeadline: 12:00 on April 10 (UTC)\nWho can participate: Everyone\n\nThe Task is to identify potential vulnerabilities and issues in the new version of Multisig smart contract.\n\nEvaluation Criteria and Prize Fund Distribution:\n\nYou will be rewarded the most if you can find critical vulnerabilities, such as unplanned loss or theft of assets or gaining admin rights or bypass restrictions.\n\nMinor flaws that do not affect security may be rewarded with a small bonus or no reward at all.\n\nNon-code issues (e.g. social engineering) are not considered.\n\nDetails: \n\nBranch \"main\", commit 107ee13aa4cbabdc9ff0684b738dcd272c4211bc\n\nSubmissions:\n\nSubmit an issue on GitHub.\n\nPlease do not copy-paste reports from ChatGPT and like.",
      "forwarded_from": "TON Contests",
      "forwarded_from_id": "channel1662609289",
      "forwarded_date": "2024-04-03T13:03:10.000Z"
    },
    {
      "id": 92,
      "type": "message",
      "date": "2024-04-08T17:08:05.000Z",
      "date_unixtime": "1712596085",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "ATTENTION FOR VALIDATORS — ACTION REQUIRED\n\nWe anticipate a significant increase in network activity starting in mid-April.\n\nIn order to keep the network running smoothly, please make sure your validator matches the configuration below.\n\nIf it does not match, please upgrade your hardware within the next week.\n\nThis is critical and necessary.\n\nMinimal validators hardware:\n* 16 x Cores CPU\n* 128GB Memory\n* 1TB NVME SSD OR Provisioned 64+k IOPS storage\n* 1 Gbit/s network connectivity\n\nWe draw special attention of validators to IOPS disk requirements, it is crucially important for smooth network operation.\n\nIf you have several validators - upgrade one by one.",
      "forwarded_from": "TON Status",
      "forwarded_from_id": "channel1744725639",
      "forwarded_date": "2024-04-08T17:07:43.000Z"
    },
    {
      "id": 93,
      "type": "message",
      "date": "2024-04-10T11:09:22.000Z",
      "date_unixtime": "1712747362",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Highload v3 wallet released\n\nThis wallet is designed for fast and safe TON and jetton withdrawals suitable for CEXes and other services. To upgrade, use the example codes:\n\n- TON withdrawals \n- Jetton withdrawals\n- Contract details"
    },
    {
      "id": 94,
      "type": "message",
      "date": "2024-04-11T07:18:54.000Z",
      "date_unixtime": "1712819934",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Scheduled network update on April 16\n\nWe are asking validators to schedule a time on April 16 at 11:00 UTC for validator software update.\n\nThis update is mandatory and, among other things, contains DB and network usage optimization, LS improvement, transaction executor, tonlib and emulator updates.",
      "forwarded_from": "TON Status",
      "forwarded_from_id": "channel1744725639",
      "forwarded_date": "2024-04-10T12:18:33.000Z"
    },
    {
      "id": 95,
      "type": "message",
      "date": "2024-04-12T16:15:49.000Z",
      "date_unixtime": "1712938549",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🚀 tonutils-go v1.9.3 released!\n\n* HighloadV3 wallet support\n* Better offline transaction building and signing support\n* Cleaner behaviour of RLDP OnDisconnect hook\n* Wallet package improvements\n* Updated related examples"
    },
    {
      "id": 96,
      "type": "message",
      "date": "2024-04-13T05:41:01.000Z",
      "date_unixtime": "1712986861",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🌏TON 开发者文档现已推出中文版本！\n\nAs TON expands around the world, we're excited to announce Mandarin localization. \n\nYou can now access the following dev resources in Mandarin: \n▪️TON Documentation\n▪️Blockchain Basics Course\n\n享受你的编程之旅！"
    },
    {
      "id": 97,
      "type": "message",
      "date": "2024-04-16T07:28:07.000Z",
      "date_unixtime": "1713252487",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Smart contract libraries\n\nTON smart contract developers, you can use smart contract libraries to optimize the network fees of your smart contract, in particular the storage and forward fees.\n\nLibraries are applicable if you have multiple instances of a smart contract that have common data.\n\nThe common data (e.g. smart contract code) can be stored in the library, and the smart contract will only reference it.\n\nYou can find an example of how to use this functionality in the new Jetton-with-governance and Multisig 2.0 smart contracts.\n\nDocumentation »"
    },
    {
      "id": 98,
      "type": "message",
      "date": "2024-04-16T07:28:07.000Z",
      "date_unixtime": "1713252487",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Efficiency of TON blockchain state storage\n\nWe would like to draw attention to the beauty of the TON architecture.\n\nEven without libraries, serialized data in the blockchain is automatically compressed, which means that the same data cells are deduplicated.\n\nThis fits well with the guidelines of writing distributed smart contracts on TON - not to make a single huge smart contract that is a bottleneck, but to make many small actors. Identical cells of instances of the same smart contracts will be stored once, so the final blockchain state is not bloated."
    },
    {
      "id": 99,
      "type": "message",
      "date": "2024-04-16T07:28:07.000Z",
      "date_unixtime": "1713252487",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Introduction of precompiled smart contracts\n\nNew functionality will be introduced in the next node update.\n\nThe code of the most popular smart contracts can be written in C++ and embedded in node.\n\nSince such precompiled smart contracts do not need to run TVM to execute, they consume less resources and therefore their network fees can be reduced.\n\nIt is planned to offer validators to apply this optimization to the new Jetton-with-governance smart contract.\n\nNext step is introduction of refreshed Jetton smart contract code (fully compatible with the old Jetton of course) and propose to make it precompile as well.\n\nIn order for the precompile optimization to apply, validators need to vote for each smart contract type. Note, that precompiles can be activated step-wise: first by activating new cost rules and then by activating embedded code execution. \n\nDocumentation »"
    },
    {
      "id": 101,
      "type": "message",
      "date": "2024-04-16T07:29:44.000Z",
      "date_unixtime": "1713252584",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Introducing new TVM opcodes for easy calculation of fees\n\nNew TVM opcodes was intoduced in 2024.04 update that allow you not to hardcode fees in Toncoins, but to dynamically calculate it in code. \n\nYou can find an example of how to use this functionality in the new Jetton-with-governance and Multisig 2.0 smart contracts.\n\nDocumentation »"
    },
    {
      "id": 102,
      "type": "message",
      "date": "2024-04-16T07:34:06.000Z",
      "date_unixtime": "1713252846",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Reducing transaction costs — a guideline for developers — MUST READ\n\nAs you know the TON provides for the possibility of reducing the price of gas and message forwarding by a network-wide vote.\n\nWhat developers need to know with this lowering transaction costs:\n\n1) Current smart contracts where fees are hardcoded will not break, as there will be a decrease of gas/forward price, not an increase.\n\n2) Please use new TVM opcodes in your smart contracts to dynamically calculate fees and do not hardcode fees in Toncoins in the smart contract code.\n\n3) No one knows Toncoin future market dynamic. This means that after a decrease, after some time there may be a increase of transaction costs measured in TON.\n\nNever hardcode fees in Toncoin at a reduced price in the smart contract code, otherwise your smart contract will break at a possible increase of gas price.\n\nWe can guarantee that the gas price will not be higher than the current price (as of April 16, 2024)."
    },
    {
      "id": 103,
      "type": "message",
      "date": "2024-04-23T04:03:02.000Z",
      "date_unixtime": "1713844982",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔨 TON Connect SDK Update\n\nWe are excited to announce the release of the TON Connect SDK.\n\n👥 @tonconnect/{sdk,ui,ui-react}\n  • Eliminated all race conditions. \n  • Enhanced handling of unstable internet connections.\n  • Improved transitions between browsers and wallets.\n  • Added a loading indicator for transaction.\n  • Removed connection restoration wait.\n  • Mobile modals adapted for tablets.\n  • Fixed hooks errors in ui-react.\n  • Added an experimental method for connecting to specific wallet.\n\n📁 New package versions\n  • @tonconnect/sdk 3.0.2\n  • @tonconnect/ui 2.0.2\n  • @tonconnect/ui-react 2.0.2\n\n⬇️ To update, run npm install @tonconnect/ui-react or npm install @tonconnect/ui.\n\n💡To learn more, visit the GitHub page at https://github.com/ton-connect/sdk.\n\n💬 Encountered issues? Please report them on GitHub at https://github.com/ton-connect/sdk/issues.\n\n🎁 Your feedback and usage examples are crucial. Share your experiences to help us evolve the SDK!",
      "forwarded_from": "TonTech",
      "forwarded_from_id": "channel1764902466",
      "forwarded_date": "2024-04-22T23:56:52.000Z"
    },
    {
      "id": 104,
      "type": "message",
      "date": "2024-04-23T13:35:07.000Z",
      "date_unixtime": "1713879307",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Attention TON Developers 🤑\n\nThe TON Dev Community calls on your expertise to contribute to advancing the TON ecosystem. Your insights and experiences in development are invaluable in making TON more robust and user-friendly.\n\nWe encourage every community member to share their experiences with TON development by participating in our survey.\n\nThe survey encompasses four key topics and will take approximately 5-8 minutes of your time.\n\n👉 https://nletwfvh.paperform.co"
    },
    {
      "id": 105,
      "type": "message",
      "date": "2024-04-30T18:46:36.000Z",
      "date_unixtime": "1714502796",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "The re:doubt team played a pivotal role in crafting a sophisticated analytics platform for the Open League. Now, the talented team will join the TON Foundation, bringing their expertise to construct an analytics platform aimed at accelerating innovations for the TON ecosystem's growth. Pavel Shuvalov, the CTO of re:doubt, will transition to the role of Analytics Lead at TON Foundation, spearheading platform development with his extensive experience and vision."
    },
    {
      "id": 106,
      "type": "message",
      "date": "2024-04-30T18:46:36.000Z",
      "date_unixtime": "1714502796",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "We are announce that re:doubt, will join the TON Foundation team. \n\nThe talented team behind re:doubt will help to build an analytics platform for the TON Foundation needs.\n\nWe want to inform our valued community members that while we are excited to share our solutions and open-source a number of re:doubt's products in the near future, this decision necessitates the disabling of some of our current solutions, including GraphQL, REST API, Tonalytica, bots, and others.\n\nOur priority is to ensure a smooth transition for our partners and minimize any disruptions to their businesses. We are committed to working closely with our partners to mitigate any potential impacts and ensure that they can continue to operate effectively during this period of change.\n\nWe apologize for any inconvenience this may cause and appreciate your patience and understanding as we make these necessary adjustments. We will keep you updated on our progress and encourage you to reach out to us with any questions or concerns you may have.\n\nThank you for your continued support as we strive to enhance the TON ecosystem through greater transparency and collaboration.",
      "forwarded_from": "re:doubt",
      "forwarded_from_id": "channel1574061646",
      "forwarded_date": "2024-04-30T16:33:10.000Z"
    },
    {
      "id": 107,
      "type": "message",
      "date": "2024-05-01T17:00:37.000Z",
      "date_unixtime": "1714582837",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🏆 Tonkeeper Contest iOS & Android\n\nPrize fund: $ 100 000\nDeadline: May 29, 2024\nResults: June 10, 2024\nSubscribe for updates: @tonkeeper_news\n\nTonkeeper is a leading non-custodial TON wallet with innovations such as TON Connect for secure connection to thousands of dapps, next-generation wallet standard W5 and Tonkeeper Battery for gasless transactions. Our team builds the largest developer platform on TON — TonAPI, used every day by over 80% of projects in TON. Tonkeeper is the biggest non-custodial wallet in TON with over 2,300,000 active monthly users on 8 platforms.\n\nToday we are excited to launch a contest for iOS and Android developers, with a prize fund of over 20 000 TON (≈ $100 000).\n\nFully-native Tonkeeper X will be faster and better in all dimensions. The goal of this contest is to add three missing features.\n\nRules\n\n1. Top 10 developers receive prizes for each feature they implement. Features rated independently. \n2. Top 3 developers receive extra-large prizes 🤑.\n3. ✨A special bonus✨ for developers who provide all three features in one submission.\n4. The finalists of this contest will be invited to join Tonkeeper team ❤️.\n5. Submission deadline is May 29.\n6. Results will be announced by June 10.\n\nFeatures\n\n1. Stake: stake TONs and earn rewards through staking pools.\n\n2. Swap: native interface for seamless asset swaps.\n\n3. Buy & Sell: trade TON, USDT and fiat through partner platforms.\n\n👉 Figma designs for all features\n\nRequirements\n\n1. Swift and Kotlin on respective platforms (iOS and Android). \n2. Use TonAPI.io for access to the blockchain data.\n3. We expect meticulous attention to detail, smooth animations, lack of glitches or bugs.\n4. Submit your pull request: iOS, Android (include build instructions if needed)\n\nQuestions?\n\n💬 Join Tonkeeper Contest group to chat with our developers (English only pls). Reference code: react-native app, tonkeeper web. \n\nWe can’t wait to see how your talents unfold in this challenge. Good luck! 🚀",
      "forwarded_from": "Tonkeeper News",
      "forwarded_from_id": "channel1537427825",
      "forwarded_date": "2024-05-01T15:21:38.000Z",
      "media_type": "photo",
      "file": "photos/photo_107.jpg",
      "width": 1280,
      "height": 1280
    },
    {
      "id": 108,
      "type": "message",
      "date": "2024-05-14T04:31:29.000Z",
      "date_unixtime": "1715661089",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🚀 tonutils-go v1.9.6 released!\n\n* RLDP Tunning\n* Fixed transaction Dump method panic (when no outs)\n* Added FindLastTransactionByInMsgHash + FindLastTransactionByOutMsgHash to ton package\n* Builtin Offline LiteClient impl for cold wallets\n* Proof generation of key absence in dictionary\n* Added methods ToRawUnsafe/FromRawUnsafe for manual low level cell construction\n* Added Preload methods to cell slice (can be used instead of copy + load now, more efficient)\n* Fixed WithRetry LS wrapper when using with timeout"
    },
    {
      "id": 109,
      "type": "message",
      "date": "2024-05-16T12:23:17.000Z",
      "date_unixtime": "1715862197",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "TON中文开发课程上线啦! 🧑‍🎓\n\nAre you a Mandarin speaker who wants to improve your TON development skills? \n\nWe now have Mandarin TON Blockchain courses on Bilibili:\n🟢TON Blockchain Course\n🟢Blockchain Basics with TON",
      "media_type": "photo",
      "file": "photos/photo_109.jpg",
      "width": 1280,
      "height": 758
    },
    {
      "id": 110,
      "type": "message",
      "date": "2024-05-16T13:48:13.000Z",
      "date_unixtime": "1715867293",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "13 IRL Bootcamps. 13 Cities. $2,000,000 Hackathon 🌍\n\nTon Society is hosting 13 offline Open League Summer Bootcamps all around the globe 🔥\n\nCome to meet, learn, and build your Open League Hackathon project 🫡\n\n📍The Open League Summer Bootcamps will be hosted in 13 locations! \n\nMay 24-26th: Prague, Moscow, Hong Kong\nMay 31th-June 2nd: Berlin, Belgrade, St Petersburg, Taipei\nJune 4-6th: Seoul\nJune 5-7th: Tbilisi\nJune 7-9th: Warsaw, Kyiv, Gurugram, Minsk\n\n💸 Win up to $500,000 from the $2,000,000 Hackathon prize pool + $5,000 prize pool for each bootcamp. \n\n👉 Choose your city and register: https://society.ton.org/activities/open-league",
      "forwarded_from": "TON Society",
      "forwarded_from_id": "channel1742281953",
      "forwarded_date": "2024-05-14T11:03:19.000Z",
      "media_type": "photo",
      "file": "photos/photo_110.jpg",
      "width": 1280,
      "height": 1280
    },
    {
      "id": 111,
      "type": "message",
      "date": "2024-05-22T21:12:24.000Z",
      "date_unixtime": "1716412344",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "‼️Please update the list of wallets in TonConnect if you want to allow authorization in your dApp via Ton Space.‼️"
    },
    {
      "id": 112,
      "type": "message",
      "date": "2024-05-30T10:14:04.000Z",
      "date_unixtime": "1717064044",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "⚡️ Gasless USDT and Notcoin transfers in Tonkeeper\n\nA month ago, Tonkeeper introduced a breakthrough 🔋Tonkeeper Battery feature that pays transactions fees when an account’s TON balance is zero. The Battery covers payments, staking, swaps and more with any tokens and NFTs. In just one month, Battery relayed almost 1,000,000 transactions covering over $100,000 in fees.\n\nToday we are making a big step forward: ⚡️fast gasless payments in USDT⚡️. Users do not have to charge the Battery: transaction fees are paid directly from the USDT balance.\n\nGasless USDT transfers in Tonkeeper work 2x faster and 1.5x cheaper than in any other wallet. This is possible thanks to a new wallet architecture called 🔥W5 — an open wallet standard developed by Tonkeeper team to replace the existing standard version 4. 🔥W5 is available as beta release today in Tonkeeper on iOS and Android.\n\nTo try Gasless Transactions:\n\n1. Update Tonkeeper to version 4.6.1\n\n2. Tap “USDT” and select “Try W5 Wallet”\n\n3. Add the “W5” wallet alongside a current wallet and send some USDT to it\n\n4. Pay with USDT and Notcoin without TON!\n\nTo learn more about these new product features check out our next post: 👉 Tonkeeper Battery, Gasless and W5.\n\nDownload Tonkeeper: tonkeeper.com\nFollow: en · ru · فارسی · twitter",
      "forwarded_from": "Tonkeeper News",
      "forwarded_from_id": "channel1537427825",
      "forwarded_date": "2024-05-30T09:59:50.000Z",
      "media_type": "photo",
      "file": "photos/photo_112.jpg",
      "width": 1280,
      "height": 1280
    },
    {
      "id": 113,
      "type": "message",
      "date": "2024-05-30T10:14:04.000Z",
      "date_unixtime": "1717064044",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔋Tonkeeper Battery, ⚡️Gasless and 🔥W5\n\nMain announcement 👉 t.me/tonkeeper_news/116\n\nLearn how Battery, gasless transactions and wallet standard 🔥W5 help people onboard to the world of TON 👇\n\n1️⃣ Have gas fees been removed from Tonkeeper?\n\nNo. The TON network charges a fee for every transaction, paid in Toncoins. Battery and Gasless are optional features that simplify paying the same fees without using Toncoins.\n\n2️⃣ How do gasless transactions work?\n\nWhen transferring USDT, Tonkeeper attaches a fee payment from the account’s USDT balance to the same transaction. Tonkeeper takes care of paying the TON fees behind the scenes.\n\n3️⃣ Why do I need a new 🔥W5 wallet account?\n\n🔥W5 enables efficient payment of fees that are 2x faster and cost less in fees compared to all other wallet apps that use the current standard version 4.\n\n4️⃣ I already have charges in my Battery, can I use it?\n\nYes, the Battery balance in an existing wallet can be used to pay fees on the 🔥W5 wallet that uses the same recovery phrase.\n\n5️⃣ Should I move all my funds to 🔥W5?\n\nDo not move all funds. 🔥W5 is currently in beta and under development. The final version is coming in summer and may have a different address: users who tried 🔥W5 Beta may need to move funds again to the final version.\n\n6️⃣ Why do I need the Battery if USDT can work without it?\n\nThe Battery is designed to cover all transactions with many different kinds of assets, including NFTs. Gasless only works with USDT and Notcoin because it’s not possible to pay fees with a fraction of an NFT and less popular tokens are more volatile or illiquid. \n\n7️⃣ Supported features\n\nGasless: Transfers of USDT, jUSDT and Notcoin. Only available in 🔥W5 wallets.\nBattery: Transfers of all tokens, NFTs, swaps, both v4 and 🔥W5 wallets.\nSoon: Gasless swaps on 🔥W5, advanced NFT operations with Battery.\n\nDownload Tonkeeper: tonkeeper.com\nFollow: en · ru · فارسی · twitter",
      "forwarded_from": "Tonkeeper News",
      "forwarded_from_id": "channel1537427825",
      "forwarded_date": "2024-05-30T10:00:32.000Z"
    },
    {
      "id": 114,
      "type": "message",
      "date": "2024-06-01T12:58:36.000Z",
      "date_unixtime": "1717246716",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Preparing for the new v5 version of wallet smart contract\n\nAs you know the Tonkeeper team is actively contributing to the development of the TON network. Its previous big contribution was the TON Connect protocol, which eventually became the unified protocol for applications and wallets in the TON network.\n\nIn this year, the Tonkeeper team has proposed a new v5-beta version of the wallet smart contract. In beta mode, Tonkeeper Wallet has launched support for this new version.\n \nIn addition to retaining the previous functionality (v4), the new contract allows you to send up to 255 messages at a time, as well as to make full-fledged gasless transactions (e.g. payment of network fees when transferring USDt in USDt itself) and other features.\n\nHaving studied the contract, we believe it will enhance the usability and capabilities for TON users.\n\nThe TON Core team is starting to audit and test this v5-beta smart contract. The smart contract code will change in the course of this work, but we will try to keep its interface intact. The TON Core team plan to complete this work by June 20.\n\nWe ask all wallets in the TON ecosystem to support the final smart contract after the audit.\n\nUI:\n\n— Already now wallet teams can start UI preparations. You can use the v5-beta smart contract as a test smart contract, but keep in mind that it will change.\n\n— UI suggestion: wallets that have multi-accounts could support the new v5 smart contract as a separate account in the UI. Provide a “Transfer funds between your accounts” functionality.\n\nBeta:\n\n— If you build v5 functionality into public versions of your products - please mark it as “beta” and do not use v5 contract by default, but only when explicitly enabled in the settings. Please observe this rule to prevent too wide distribution of the non final beta version of the v5 smart contract.\n\nRelease:\n\n— The final smart contract will be ready around June 20, after which wallets can enable v5 by default using the final smart contract."
    },
    {
      "id": 115,
      "type": "message",
      "date": "2024-06-01T12:58:36.000Z",
      "date_unixtime": "1717246716",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Preparing for gasless transactions\n\nThe v5 wallet smart contract allows the processing of internal messages signed by the owner.\n\nThis also allows you to make gasless transactions, e.g. payment of network fees when transferring USDt in USDt itself.\n\nFlow:\n\n1. When sending an USDt the user signs one message containing two outgoing USDt transfers:\n\n1.1. USDt transfer to the recipient's address.\n\n1.2. Transfer of a small amount of USDt in favor of the Service.\n\n2. This signed message is sent offchain by HTTPS to the Service backend. The Service backend sends it to the TON blockchain paying Toncions for network fees.\n\nThe Tonkeeper team announced the launch of the beta version of such public backend on June 14. Backend will support the USDt and the NOT.\n\nAlthough each wallet could launch its own backend, we believe that a single backend would be more convenient if there are network-wide subsidy campaigns. However, the final choice is up to you.\n\nWe invite TON wallets to support gasless transactions for USDt (and NOT) by June 20, by the time the v5 wallet smart contract is finalized."
    },
    {
      "id": 116,
      "type": "message",
      "date": "2024-06-08T09:14:44.000Z",
      "date_unixtime": "1717838084",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🚀 Tact v1.3 release notes\n\nThe new Tact v1.3 release provides a massive improvement on the smart contract programming for TON blockchain.\n\n🗺 Maps\n\nTraversing a map has never been easier! The foreach loop for the Map type:\n\nlet mapLength: Int = 0;\nforeach (k, v in map) {\n  mapLength += 1;\n}\n\n\nYou don't have to use map.set(key, null) to remove a key from your maps, use the more intuitive del method instead: map.del(key).\n\nWant to check if the map is empty? Use map.isEmpty()!\n\n🔤 Strings \n\nStrings finally support escape sequences, like \\\\, \\\", \\n, \\u0000 through \\uFFFF, etc.\n\nThere is a new non-modifying StringBuilder's concat method for chained string concatenations: b = b.concat(\"Hello,\").concat(foo).concat(\"Tact!\").\n\nWe added the toString method for the Address type that you asked for numerous times in the dev chats: address(\"EQBKgXCNLPexWhs2L79kiARR1phGH1LwXxRbNsCFF9doc2lN\").toString().\n\n👌 Handling exceptions\n\nWant to process various TVM and user-defined exit codes before your contract fails at runtime? The try and try-catch statements: https://docs.tact-lang.org/book/statements#try-catch:\n\n\ntry {\n    let foo: Int = 42 / 0;\n} catch(e) {\n    // your division by zero handler\n}\n\n\n☀️ New quality-of-life improving syntax\n\nTact started supporting struct fields punning, i.e. {foo, bar} is syntactic sugar for { foo: foo, bar: bar }.\n\nThere is support for trailing commas in all comma-separated lists in Tact, here is how you can use it with structs:\n  \n  foo(Struct {\n    field1: 42,\n    field2: \"42\",\n  })\n  \n\nYou can now chain method calls with the unboxing operator !!, e.g. map.asCell()!!.hash().\n\nFor those missing some bit-level hackery, there is the bitwise XOR operator ^ available now.\n\n⚙️ Stdlib enhancements \n\nThe Tact team has added log2 and log, pow2 and pow functions.\n\nUse reserve mode constants from @stdlib/reserve instead of their numeric values to make your code even easier to read: https://docs.tact-lang.org/ref/core-advanced#nativereserve-base-modes.\n\n🧠 Debugging\n\nDebugging has become easier now as the dump() and dumpStack() functions now print the file path, line number, and column number in addition to the data specified by the programmer.\n\nAddresses can be arguments of the dump function.\n\n💻 Tact CLI\n\nTact's command line interface just became a lot more user-friendly: run npx tact --help from terminal and see what's available.\n\nJust a highlight: CLI now allows compiling a single Tact file directly, without specifying a config file: npx tact your-awesome-contract.tact. It's very useful for quick experiments or bug reports.\n\n🛠 Third-party tools support \n\nFor third-party tools implementors there is new improved APIs: AST traversals, access to the AST store of top-level items like functions, constants, traits, etc.\n\nHappy hacking! ❤️\n\nCheck out Tact's CHANGELOG for the comprehensive list of features, changes and bugfixes.\n\nCheck out the Tact docs and read about the new Tact features.\n\nTo upgrade your Blueprint-based Tact projects to use Tact v1.3.1, run npm upgrade inside the project folder.\n\nThis release was brought to you by 0kenx, byakuren-hijiri, Max Korsunov, Novus Nota, Vitor Py, Daniil Sedov, and Anton Trunov."
    },
    {
      "id": 117,
      "type": "message",
      "date": "2024-06-08T09:27:35.000Z",
      "date_unixtime": "1717838855",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🧑‍🍳 The Tact team invites you to peek behind the scenes and into the steaming pot of hot updates to the Tact compiler, tooling, documentation and ecosystem as a whole, join our Telegram channel: @tact_kitchen.\n\n⚡️ You know what's cooking — Tact!"
    },
    {
      "id": 119,
      "type": "message",
      "date": "2024-06-16T15:53:45.000Z",
      "date_unixtime": "1718553225",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Beta version of the gasless backend API is available on https://tonapi.io/api-v2\nIf you are developing any wallet app and have feedback about these methods please share it ton @tonapitech chat.",
      "reply_to_message_id": 115,
      "media_type": "photo",
      "file": "photos/photo_119.jpg",
      "width": 1152,
      "height": 232
    },
    {
      "id": 120,
      "type": "message",
      "date": "2024-06-23T20:40:18.000Z",
      "date_unixtime": "1719175218",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "The new Sublime Text 4 package for Tact is now available.\n\n🚀 The Tact team is thrilled to announce the launch of a new official ST4 package for the Tact language! Check it out to enhance your coding experience: tact-sublime.\n✨ Features:\n• Syntax highlighting\n• Auto-completions and code snippets\n• Syntax checks through simple Tact compiler integration\n• Symbol lists, indentation, folding and comments\n• ...for all the details, see its README\n⚙️ Installation:\n 1 Open the command palette with Ctrl + Shift + P (or Cmd + Shift + P on macOS)\n 2 Select Package Control: Install Package (install Package Control, if it's missing)\n 3 Type and select Tact\n👨‍💻 Made with 🤍 by Novus Nota\n⚡️ Happy coding with Tact!\n👨‍🍳 And also come visit what's cooking there 🤌"
    },
    {
      "id": 121,
      "type": "message",
      "date": "2024-07-01T17:53:37.000Z",
      "date_unixtime": "1719856417",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Star Reward Withdrawals, Subsidized Ads and Bot API 7.6\n\nDevelopers of bots accepting Telegram Stars ⭐️ can now withdraw rewards via the TON blockchain, or use stars to place subsidized Ads on Telegram.\n\nTelegram takes nearly 0% commission and adds a 30% discount for ads to compensate for third-party payment system fees – you can read more here.\n\nBot API 7.6, released today, adds even more improvements for all bots and mini apps, like:\n\n• Native multitasking – allowing mini apps to be minimized and expanded without loading delays.\n• Default full-screen mode for mini apps opened by direct link.\n• Support for sending paid media content on behalf of content creators.\n• Updated transaction history, with support for Telegram Ads and bot-specified payloads.\n\n• And more, see the full changelog for details.",
      "forwarded_from": "BotNews",
      "forwarded_from_id": "channel1004276399",
      "forwarded_date": "2024-07-01T17:12:58.000Z"
    },
    {
      "id": 122,
      "type": "message",
      "date": "2024-07-03T19:00:25.000Z",
      "date_unixtime": "1720033225",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Bot Privacy Policies\n\nBots and mini apps must comply with all applicable privacy laws and regulations – including those from Apple and Google stores.\n\nTo remain in compliance with Apple guideline 5.1.1 (i), bots and mini apps must provide a Privacy Policy detailing what data they store, how they collect it, and for what purpose.\n\nOperating without a separate Privacy Policy will lead to suspension or termination of your bot on Telegram.\n\nMini apps can make their Privacy Policy easily accessible by including a link to it on a 'Settings' page, while bots must make it available via the /privacy command.\n\nFor more information about these requirements, please see this section of the Bot Developer Terms of Service.",
      "forwarded_from": "BotNews",
      "forwarded_from_id": "channel1004276399",
      "forwarded_date": "2024-07-03T18:58:17.000Z"
    },
    {
      "id": 123,
      "type": "message",
      "date": "2024-07-07T11:33:23.000Z",
      "date_unixtime": "1720352003",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Bot API 7.7\n\n• Mini Apps can now disable vertical swipes – preventing users from exiting by accident.\n• Bots can now detect service messages about refunded payments.\n\n• And more, see the full changelog for details:\n\nhttps://core.telegram.org/bots/api-changelog#july-7-2024",
      "forwarded_from": "BotNews",
      "forwarded_from_id": "channel1004276399",
      "forwarded_date": "2024-07-07T11:32:52.000Z"
    },
    {
      "id": 124,
      "type": "message",
      "date": "2024-07-09T10:57:10.000Z",
      "date_unixtime": "1720522630",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Smart Contract Cracking Competition - W5 - Wallet 5.0 \n\nPrize fund: Up to $100,000 in Toncoins\nDeadline: 18:00 on July 10 (UTC)\nWho can participate: Everyone\n\nThe Task is to identify potential vulnerabilities and issues in the new version of Wallet smart contract.\n\nEvaluation Criteria and Prize Fund Distribution:\n\nYou will be rewarded the most if you can find critical vulnerabilities, such as unplanned loss or theft of assets or gaining admin rights or bypass restrictions.\n\nMinor flaws that do not affect security may be rewarded with a small bonus or no reward at all.\n\nNon-code issues (e.g. social engineering) are not considered.\n\nYou will be banned for copy-pasting ChatGPT reports and offtopic.\n\nDetails: \n\nBranch \"main\", commit 4fab977f4fae3a37c1aac216ed2b7e611a9bc2af\n\nSubmissions:\n\nSubmit an issue on GitHub.",
      "forwarded_from": "TON Contests",
      "forwarded_from_id": "channel1662609289",
      "forwarded_date": "2024-07-04T12:02:22.000Z"
    },
    {
      "id": 125,
      "type": "message",
      "date": "2024-07-09T16:19:40.000Z",
      "date_unixtime": "1720541980",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Recent news reports about TON building a Layer-2 chain are inaccurate. TON Foundation has no plans for such a development, and TON’s programming languages will continue to be FunC and Tact. The initial article has been amended to address any concerns."
    },
    {
      "id": 126,
      "type": "message",
      "date": "2024-07-11T10:34:33.000Z",
      "date_unixtime": "1720694073",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🚀 Introducing Brand New Custom Requests to the TON Blockchain!\n\nToday, we are excited to release a new update to the dTON Graphql API, featuring two major enhancements:\n\nAdvanced Filters for All Tables\n\nNow, all tables (transactions, accounts, groups) support advanced filters, including:\n\n • exact: Exact match (default, e.g., seqno: 1)\n • contains: Case-sensitive containment test\n • in: In a given list\n • gt / gte: Greater than / Greater than or equal to\n • lt / lte: Less than / Less than or equal to\n • range: In a given range [val_from, val_to]\n • isnull: Corresponds to SQL IS NULL and IS NOT NULL\n • and / or / not\n\nDocs: Advanced Filters\n\nAggregations for Transactions and Accounts Tables\n\nPerform aggregations on any custom fields with operators such as:\n\n • count: Counts the number of items\n • sum: Sums the values of a field\n • min / max: Finds the minimum value / max: Finds the maximum value\n • avg: Calculates the average value\n • argMax / argMin: Finds the value of another field corresponding to the max / min valu\n • least: Finds the least value among specified fields\n • quantile: Calculates the quantile value of a field\n\nDocs: Aggregations\n\nEmpower Your Applications with Unlimited Request Types\n\nUse Cases:\n\n • Number of users by smart contract usage\n • Sum of jettons or tons for custom filters\n • Count of usage by OP code\n • And many more…\n\nWhile the dTON Graphql API is still in experimental mode and does not support paid tariffs, we are offering 30 RPS free for all users until our next update, which will introduce profiles with paid features for all our products.\n\nTry the new update now: dTON Graphql\n\nStay with @dtontech, we believe in and love our users!\n\nP.S. Image is auto generated by ChatGPT4 🤤",
      "forwarded_from": "dTON Tech",
      "forwarded_from_id": "channel2084817136",
      "forwarded_date": "2024-07-11T10:33:37.000Z",
      "media_type": "photo",
      "file": "photos/photo_126.jpg",
      "width": 1280,
      "height": 1279
    },
    {
      "id": 127,
      "type": "message",
      "date": "2024-07-14T10:41:12.000Z",
      "date_unixtime": "1720953672",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔨 TON Connect SDK Update\n\nWe're excited to announce a new release of the TON Connect SDK, optimized for high-traffic Telegram Mini Apps with improved performance and new features.\n\n👥 @tonconnect/{sdk,ui,ui-react}\n  • Improved UX for Telegram Mini Apps\n  • Boosted performance for high-traffic TMA\n  • Fixed issues with wallet connection processes\n  • Added new user event tracking feature\n  • Refined error handling and messaging\n  • Enhanced CDN version compatibility\n\n📁 New package versions\n  • @tonconnect/sdk 3.0.3\n  • @tonconnect/ui 2.0.6\n  • @tonconnect/ui-react 2.0.6\n\n⬇️ To update, run npm install @tonconnect/ui-react or npm install @tonconnect/ui.\n\n💡To learn more, visit the GitHub page at https://github.com/ton-connect/sdk.\n\n💬 Encountered issues? Please report them on GitHub at https://github.com/ton-connect/sdk/issues.\n\n🎁 Your feedback and usage examples are crucial. Share your experiences to help us evolve the SDK!",
      "forwarded_from": "TonTech",
      "forwarded_from_id": "channel1764902466",
      "forwarded_date": "2024-07-14T10:22:02.000Z"
    },
    {
      "id": 128,
      "type": "message",
      "date": "2024-07-15T13:16:48.000Z",
      "date_unixtime": "1721049408",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Release 2.3.0\n\nAdded:\n- Support for the latest Tact 1.4.0\n- Inspections for out of range integer values in FunC and Tact\n- Inspections for integer division by zero in FunC and Tact\n- Inspections for integer overflow in FunC\n- Constant expression evaluation in FunC and Tact (with inline hints!)\n\nFull changelog: https://github.com/ton-blockchain/intellij-ton/releases/tag/v2.3.0",
      "forwarded_from": "IntelliJ TON Development",
      "forwarded_from_id": "channel1539450720",
      "forwarded_date": "2024-07-15T12:37:22.000Z",
      "media_type": "photo",
      "file": "photos/photo_128.jpg",
      "width": 1280,
      "height": 223
    },
    {
      "id": 129,
      "type": "message",
      "date": "2024-07-15T14:02:21.000Z",
      "date_unixtime": "1721052141",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Higload-v2 deprecation.\n\nSince most of services already migrated to highload v3 wallet, old (unsafe) highload-wallet-v2 is finally deprecated. It is planned to conduct one-time unlock for wallets that are stuck due to too many requests per second through a time-limited gas limit increase.\n\nIf your highload-wallet-v2 need to be unstuck, please fill the form to be included into unlock list."
    },
    {
      "id": 130,
      "type": "message",
      "date": "2024-07-26T10:33:01.000Z",
      "date_unixtime": "1721989981",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🚀 tonutils-go v1.9.9 released!\n\n* Support for the finalized W5 (V5R1) wallet (by Totemancer)\n* Added Equals method for Address type\n* Added example of accepting USDT and jettons payments\n* Small changes in output of String method of tlb.Transaction\n* Cells micro-optimization (by AugustineAurelius)\n* Fixed ShardDescription field tag of tl.ShardInfo\n* Fixed findLastTransactionByHash when searching out messages (thanks to troo)\n* Update NFT Collection deploy example to verified contracts (by Totemancer)",
      "forwarded_from": "Tonutils News",
      "forwarded_from_id": "channel2238780151",
      "forwarded_date": "2024-07-25T20:07:56.000Z"
    },
    {
      "id": 131,
      "type": "message",
      "date": "2024-07-26T15:42:19.000Z",
      "date_unixtime": "1722008539",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🎉 Tact 1.4.1 has just landed on NPM!\n\n🐞 We fixed a gazillion bugs reported by the TON builders and TOL hackaton participants\n\n❤️‍🔥 Thanks so much for your helpful feedback! It means so much to have such a vibrant community of Tacticians\n\n🍳 Now that bug squashing is out of the way, we are on to adding more exciting features (and inevitably introducing some more bugs along the way). Tact 1.5.0 ingredients are out of the fridge and into the pan. \n\n— The Tact team\n\n🍲 don’t let it bit rot\n♨️ @tact_kitchen",
      "forwarded_from": "Tact Kitchen",
      "forwarded_from_id": "channel2180657744",
      "forwarded_date": "2024-07-26T15:40:55.000Z"
    },
    {
      "id": 132,
      "type": "message",
      "date": "2024-07-31T16:29:59.000Z",
      "date_unixtime": "1722443399",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Today's update introduces a new Mini App Store – to highlight successful Mini Apps that utilize Stars ⭐️, making them easily accessible to the more than 500 million users who interact with mini apps each month (out of Telegram's 950 million monthly users).\n\nIf your bot is a mini app, you can add a prominent Launch app button as well as demo videos and screenshots to the bot’s profile. To do this, go to @BotFather and set the mini app as your bot's Main App.",
      "forwarded_from": "BotNews",
      "forwarded_from_id": "channel1004276399",
      "forwarded_date": "2024-07-31T16:29:49.000Z"
    },
    {
      "id": 134,
      "type": "message",
      "date": "2024-08-01T09:33:05.000Z",
      "date_unixtime": "1722504785",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Attention Developers!\n\nWe need your valuable insights to make the TON & Telegram Apps platform even better! 🚀\n\nAs a token of our appreciation, every developer who completes our questionnaire will receive an exclusive SBT from TON Society! 🎁\n\nYour feedback is crucial in shaping the future of our ecosystem. Take a few minutes to share your thoughts and experiences with us.\n\n👉 Start the Questionnaire Now\n\nThank you for being a vital part of our community and helping us build a stronger, more vibrant platform!",
      "media_type": "photo",
      "file": "photos/photo_134.jpg",
      "width": 1280,
      "height": 720
    },
    {
      "id": 135,
      "type": "message",
      "date": "2024-08-01T15:24:56.000Z",
      "date_unixtime": "1722525896",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "New Localization Workflow for TON Documentation made by Townsquare Labs\n\nTownsquare Labs is excited to announce that the new localization workflow for the official TON documentation is now live! \n\n🎉 Check out the detailed guidelines to get started: https://docs.ton.org/contribute/localization-program/overview \n\n📢This update is a significant step because by providing documentation in multiple languages, we are breaking down language barriers and making it easier for people worldwide to understand and contribute to the TON ecosystem.\n\nNot only solving the language barrier, we have also included the following features in this new localization:\n\n1. Automated processes: Streamlines development, integration, and deployment, enhancing efficiency and consistency.\n\n2. Role separation: Decouples developer, translator, and verifier roles for high-quality translations and smooth collaboration.\n\n3. Community incentives: Rewards members who contribute to the localization process, encouraging active participation.\n\n4. Advanced AI integration: Enhances translation accuracy and efficiency with intelligent suggestions and automation.\n\n✨ Coming Soon: \nWe’re working closely with various local communities, including JP, KR, RU, PL, UA, and more, to make the TON blockchain more accessible to everyone. The support for TACT docs and Telegram Mini Apps are on the way. \n\nJoin us in our mission to make the TON blockchain accessible to all! 🌐"
    },
    {
      "id": 136,
      "type": "message",
      "date": "2024-08-06T13:19:54.000Z",
      "date_unixtime": "1722950394",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🐞 Misti – TON Static Program Analyzer\n\nThe first release of Misti – a static program analyzer for the TON blockchain has landed!\n\n🐛 Detect Vulnerabilities: Identify and fix potential security flaws early in the development cycle.\n\n🛠 Create Custom Detectors: Solve specific problems in your code or provide a thorough security review if you are an auditor.\n\n📄 Improve Code Quality: Maintain high standards by catching bugs and enforcing best practices automatically.\n\n🚀 Streamline Development: Integrate Misti into your CI/CD pipeline to ensure continuous code quality checks.\n\n💎 Language Support: Tact ⚡ is supported; FunC support is planned.\n\n\n- GitHub: https://github.com/nowarp/misti, contributions are very welcome!\n- Documentation: https://nowarp.github.io/tools/misti/docs\n- Telegram Group: @misti_dev"
    },
    {
      "id": 137,
      "type": "message",
      "date": "2024-08-06T15:19:00.000Z",
      "date_unixtime": "1722957540",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🚀 Huge Update for the dTON Ecosystem! 🚀 \n\nWe are glad to bring you some incredible updates for the dTON ecosystem that will make managing and optimizing your TON experience easier than ever:\n\n1. 📱 Telegram Mini App: Manage your rates and keys effortlessly.\n2. ⚡ Boost Feature for Liteservers: Supercharge your liteservers performance.\n3. 📊 Analytics Feature for Liteservers and GraphQL: Coming soon!\n4. 🔑 GraphQL API Keys: Your reliable source of data about TON. [📄 Docs link]\n5. 🔔 WebhookAPI: Filter the events you need, select fields from transactions, accounts, or blocks, and get data sent directly to your endpoint. [📄 Docs link]\n6. ⏰ Notification on Expiration: Never miss a renewal with timely notifications.\n\n⭐️ Top Up Your Balance with Telegram Stars, USDT, or TON.\n\n🎉 Get a free $5 right now with the promo code HYPERCUBE (first 100 unique users will get the reward).\n\nDon’t miss out on these fantastic new features. \nEnhance your dTON experience today! 💥\n\n👉 Open APP 👈\n           ⬆️",
      "forwarded_from": "dTON Tech",
      "forwarded_from_id": "channel2084817136",
      "forwarded_date": "2024-08-06T15:16:06.000Z"
    },
    {
      "id": 138,
      "type": "message",
      "date": "2024-08-07T05:16:24.000Z",
      "date_unixtime": "1723007784",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Introducing Retracer 🤖\n\nEver wondering why transaction on your contract failed? What action caused fail of action phase? Replay it in browser, see the stack for each VM step, check the transaction emulator logs, c5 content and all other staff!\n\nretracer.ton.org\n\nInsert transaction hash and press \"Emulate\".\n\nAnother way to get result of transaction replay is dton.io: for any tx, go to Computation phase tab and press \"Server run\"."
    },
    {
      "id": 139,
      "type": "message",
      "date": "2024-08-12T09:00:01.000Z",
      "date_unixtime": "1723453201",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "MyTonCtrl 2.0\n\nMyTonCtrl — the most popular tool for TON validators and liteservers has received a major update.\n\nFull code refactoring, bug fixes, built-in support for single-nominator and liquid staking and many other new features and improvements.\n\nTo update, type in the MyTonCtrl console:\n\n\nupdate master\nupgrade\n\nFull Changelog »"
    },
    {
      "id": 140,
      "type": "message",
      "date": "2024-08-12T09:00:01.000Z",
      "date_unixtime": "1723453201",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "The documentation of MyTonCtrl and node run has been updated \n\nThe documentation has been actualised and significantly supplemented with new information.\n\nhttps://docs.ton.org/participate/run-nodes/mytonctrl"
    },
    {
      "id": 141,
      "type": "message",
      "date": "2024-08-12T09:00:09.000Z",
      "date_unixtime": "1723453209",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "TON 2024.08\n\nMain features:\n\nSecurity: Introduction of dispatch queues that will better protect network against certain attack vectors;\n\nPerformance: Fast State Serializer and improved broadcasts;\n\nUsability: emulator, tonlib, send modes and other improvements;\n\nFull Changelog »\n\nValidator and liteservers owners please update as described in the @tonstatus channel"
    },
    {
      "id": 142,
      "type": "message",
      "date": "2024-08-13T16:25:08.000Z",
      "date_unixtime": "1723566308",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🎉 Tact 1.4.2 has just landed on NPM!\n\n🐞 We fixed a few type-checking and code generation bugs. One of the most important fixes is that getters again return flattened types for structs as it used to be. We broke it while trying to allow structs with more than 15 fields. Please give it a try and let us know if the issue is gone now — all your bug reports are really appreciated.\n\n🛠 A bunch of the other changes include improved support for the misti static smart-contract analyzer — give it a try, it’s in early stage of development but already found some issues in soon-to-be released projects.\n\n— The Tact team\n\n♨️ @tact_kitchen",
      "forwarded_from": "Tact Kitchen",
      "forwarded_from_id": "channel2180657744",
      "forwarded_date": "2024-08-13T15:04:40.000Z"
    },
    {
      "id": 143,
      "type": "message",
      "date": "2024-08-14T12:18:34.000Z",
      "date_unixtime": "1723637914",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Bot API 7.9\n\n• Introduced Star Subscriptions ⭐️ – allowing bots to manage subscription-based invite links.\n• Bots can now send Paid Media to any chat, including on behalf of Business Accounts.\n• Added support for Super Channels – where admins may post as their own profiles or channels.\n\n• And more, see the full changelog for details:\n\nhttps://core.telegram.org/bots/api-changelog#august-14-2024",
      "forwarded_from": "BotNews",
      "forwarded_from_id": "channel1004276399",
      "forwarded_date": "2024-08-14T12:12:14.000Z"
    },
    {
      "id": 144,
      "type": "message",
      "date": "2024-08-14T17:01:19.000Z",
      "date_unixtime": "1723654879",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔨 TON Connect SDK Update\n\nWe're excited to announce a new release of the TON Connect SDK with improvements in design and functionality. \n\nWe kindly request all dapp developers to update to the latest version to ensure optimal performance and user experience.\n\n👥 @tonconnect/{sdk,ui,ui-react}\n  • Added support for Telegram Browser\n  • Improved dapp-wallet transitions\n  • Adaptive letter spacing for wallet names\n  • Enhanced reconnection for laggy bridges\n  • Adjusted font weights in UI elements\n  • Various performance optimizations\n\n📁 New package versions\n  • @tonconnect/sdk 3.0.5\n  • @tonconnect/ui 2.0.9\n  • @tonconnect/ui-react 2.0.9\n\n⬇️ To update, run npm install @tonconnect/ui-react@latest or npm install @tonconnect/ui@latest\n\n💡To learn more, visit the GitHub page at https://github.com/ton-connect/sdk.\n\n💬 Encountered issues? Please report them on GitHub at https://github.com/ton-connect/sdk/issues.\n\n🎁 Your feedback and usage examples are crucial. Share your experiences to help us evolve the SDK!",
      "forwarded_from": "TonTech",
      "forwarded_from_id": "channel1764902466",
      "forwarded_date": "2024-08-14T15:59:28.000Z"
    },
    {
      "id": 145,
      "type": "message",
      "date": "2024-08-18T01:37:42.000Z",
      "date_unixtime": "1723945062",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🎉 Tact 1.4.4 has just landed on NPM!\n\nFixed a few bugs and added AST equality comparison API mostly for third-party tools, like the misti static smart-contract analyzer. The API also be used to compare contracts without taking into account whitespace, comments or even order of definitions and declarations.\n\nMore details as always can be found in the changelog.\n\n— The Tact team\n\n♨️ @tact_kitchen",
      "forwarded_from": "Tact Kitchen",
      "forwarded_from_id": "channel2180657744",
      "forwarded_date": "2024-08-18T01:36:11.000Z"
    },
    {
      "id": 146,
      "type": "message",
      "date": "2024-08-19T12:50:21.000Z",
      "date_unixtime": "1724071821",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "TVM Debugger\n\nI have just released an early version of TVM Debugger, which will allow developers to debug their TON contracts as they would debug any regular program - line by line, with breakpoints and variable inspection.\n\nYou are welcome to try it out - just look at this example repo.\n\nIf you have any feedback, suggestions, bug reports, or anything else of that sort, do not hesitate to post it in the discussion of this post, or simply DM me.\n\nThe implementation of the debugger is definitely a little dirty in some places at the moment, so please don't judge the quality of code too harshly yet.\n\nIf you would like to learn about the inner workings of the debugger, or about the features that may be implemented in the future, please read this post.",
      "forwarded_from": "krigga is typing...",
      "forwarded_from_id": "channel2167223276",
      "forwarded_date": "2024-08-14T15:35:30.000Z"
    },
    {
      "id": 147,
      "type": "message",
      "date": "2024-08-22T10:21:39.000Z",
      "date_unixtime": "1724322099",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🎉 Misti 0.2 has just landed on NPM!\n\n🔍 Five New Tact Detectors: Сonstant Address, Branch Duplicate, `dump` Is Used, Field Initialized Twice, Prefer Augmented Assignment.\n\n🛠 Blueprint Support: Introducing the new Blueprint Plugin.\n\n🔧 Fixes & Enhancements: More configuration options and various fixes. Check out the full changelog.\n\n♨️ @tact_kitchen",
      "forwarded_from": "Tact Kitchen",
      "forwarded_from_id": "channel2180657744",
      "forwarded_date": "2024-08-22T10:00:04.000Z"
    },
    {
      "id": 149,
      "type": "message",
      "date": "2024-08-28T19:04:15.000Z",
      "date_unixtime": "1724871855",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "URGENT - Mainnet validators\n\nPlease update your nodes and then restart.\n\nIn mytonctrl run:\nupgrade stable_testnet\n\nIf you don't use mytonctrl manually switch node to stable_testnet branch.\n\nIf you have multiple validators you can update them all at once. Please stay tuned for a few hours, in case of subsequent instructions.",
      "forwarded_from": "TON Status",
      "forwarded_from_id": "channel1744725639",
      "forwarded_date": "2024-08-28T17:39:05.000Z"
    },
    {
      "id": 150,
      "type": "message",
      "date": "2024-09-06T15:26:09.000Z",
      "date_unixtime": "1725636369",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Bot API 7.10\n\n• Introduced support for Telegram Star Giveaways ⭐️.\n• Bots now receive updates when users purchase paid media.\n• Mini Apps can now display and control a secondary button at the bottom of their interface.\n• The bottom bar color of Mini Apps can now be customized.\n\n• And more, see the full changelog for details:\n\nhttps://core.telegram.org/bots/api-changelog#september-6-2024",
      "forwarded_from": "BotNews",
      "forwarded_from_id": "channel1004276399",
      "forwarded_date": "2024-09-06T13:30:49.000Z"
    },
    {
      "id": 151,
      "type": "message",
      "date": "2024-09-15T14:46:35.000Z",
      "date_unixtime": "1726411595",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🎉 Tact v1.5.0 has just been released\n\nThe new Tact release v1.5.0 just landed on NPM! Here are the highlights of the most important features.\n\n🛠 New Tact features\n\nasm functions allow you to access the deep dark corners of TVM for more features or better performance: \n\n\nasm fun keccak256(s: Slice): Int {\n    1 INT HASHEXT_KECCAK256\n}\n\n\nasm functions have some limitations at this point and the Tact team will make them even more powerful in the next releases.\n\n- A wider range of serialization options for integers can now be used, not just 8, 16, 32, 64, 128 and 256-bit integers, but anything in between: uint1 through uint256 and int1 through int257. For instance, a 48-bit timestamp can be defined now if you'd like to build contracts that can work after the year 2038:\n\n\ncontract Contract {\n    timestamp: Int as uint48\n}\n\n\n- Constant definitions now support calls to user-defined functions and references to other constants:\n\n\nconst CONSTANT: Int =\n    myFunction(OTHER_CONSTANT)\n\n\n👩‍💻 New builtin and stdlib functions and methods\n\n- The exists method for the Map type: m.exists(key) which is equivalent to m.get(key) != null.\n\n- The deepEquals method for the Map type: m1.deepEquals(m2) -- you can now easily compare two maps with the same key-value pairs and get true as the result, even if their internal representations are different, so the hash-based == comparison would return false.\n\n- The toSlice method for structs and messages: struct.toSlice().\n\n- The new slice, rawSlice, ascii and crc32 built-in compile-time functions to help you define constant integers and slices more conveniently.\n\n- The new stdlib functions to help with fee calculations: gasConsumed, getComputeFee, getStorageFee, getForwardFee, getSimpleComputeFee, getSimpleForwardFee, getOriginalFwdFee, myStorageDue. This brings you access to the TVM instructions from 2023.07 and 2024.04 upgrades.\n\n- The parseStdAddress and parseVarAddress stdlib functions allow you to parse slices into structured addresses.\n\n🐞 The new release also includes a bunch of bugfixes. Thanks to all the Tacticians for all the issues you open!\n\n📜 Full changelog for Tact v1.5.0: https://github.com/tact-lang/tact/blob/main/CHANGELOG.md#150---2024-09-15"
    },
    {
      "id": 152,
      "type": "message",
      "date": "2024-09-16T11:36:54.000Z",
      "date_unixtime": "1726486614",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "TON Mintless Jettons\n\nIntroducing the new TON Mintless Jetton technology. It is a jetton that can be instantly distributed to hundreds of millions of users on the TON blockchain, with network fees costing less than a dollar. The user's ownership of their coins is guaranteed by cryptography and a smart contract.\n\nAs an example, we created a test jetton called Mintless Points (for testing purposes only, no other value) and distributed it to 18 million wallets in the TON mainnet.\n\nThis jetton is compatible with regular jetton in TON. The only difference is that the smart contact is not created in advance, but during the user's first action. \n\nPopular TON ecosystem products such as Tonkeeper, MyTonWallet, Tonviewer, Tonscan.org, TON API, DTON, Toncenter have announced that they will soon support Mintless Jetton technology.\n\nWe encourage all products and services in the ecosystem to consider integration as well.\n\nOn September 26, the famous game project Hamster Kombat will apply this technology during its coin giveaway. Considering Hamster Kombat's gigantic audience, this event has all chances to become the largest airdrop in the history of cryptocurrencies.\n\nDescription »\n\nStandard »\n\nSmart Contract »"
    },
    {
      "id": 153,
      "type": "message",
      "date": "2024-09-19T18:22:21.000Z",
      "date_unixtime": "1726770141",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Mintless jettons support\n\nTONAPI supports mintless jettons as a part of bigger standard for jettons with custom payload and init data.\n\nWhen you are requesting jetton balances for an account and want to get mintless jettons transparently, you should use the custom_payload parameter in the supported_extension field in the request. For example, this link or direct jetton info this link:\n\n    {\n      \"balance\": \"1000000000\",\n      \"wallet_address\": {\n        \"address\": \"0:405171f583a9e39e22ae9d8394769bc6e37299c59332012a51693b4d606780f3\"\n      },\n      \"jetton\": {\n        \"address\": \"0:fa67d0c7739331fbc3c8f08e018c65f47763616a969100ad760a0b2dc1e36832\",\n        \"name\": \"Mintless Points\",\n        \"symbol\": \"Points\",\n        \"decimals\": 9,\n        \"image\": \"https://cache.tonapi.io/imgproxy/DmmPn6dWmsmBgSMVbvjbhIDCChLWI3RmqDJ71whxYBA/rs:fill:200:200:1/g:no/aHR0cHM6Ly9pLmliYi5jby9TS010TlRHL21pbnRsZXNzLnBuZw.webp\",\n        \"custom_payload_api_uri\": \"https://claim-api.tonapi.io/jettons/EQD6Z9DHc5Mx-8PI8I4BjGX0d2NhapaRAK12CgstweNoMint\"\n      },\n      \"extensions\": [\n        \"custom_payload\"\n      ]\n    }\n\n\nHow to Support Mintless Jettons in Your Dapp\n\n1. Request balances with ?supported_extensions=custom_payload.\n2. Check if data[\"extensions\"] contains \"custom_payload\" for the jetton.\n3. If it contains and you want to autoclaim on transaction, when your dapp asks the user to send an outgoing jetton transfer via TonConnect, request custom payload and state init via the API: https://tonapi.io/v2/jettons/0:fa67d0c7739331fbc3c8f08e018c65f47763616a969100ad760a0b2dc1e36832/transfer/UQBDaa8UGaMVKiT8TKXiaJqlyWLmx-MoHYvT_wzHEpdUnIss/payload.\n4. Add the received data to the message in your TonConnect request.\n5. That's it. Now you support mintless jettons!",
      "forwarded_from": "Ton Console",
      "forwarded_from_id": "channel1610779830",
      "forwarded_date": "2024-09-19T13:41:49.000Z"
    },
    {
      "id": 154,
      "type": "message",
      "date": "2024-09-20T05:48:12.000Z",
      "date_unixtime": "1726811292",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Mintless jettons support\n\nToncenter supports mintless jettons, check on preview.toncenter.com!\n\nNow for jettons that allow mintless claim v3/jetton/wallets API returns additional field:\n\n\"mintless_info\": {\n    \"amount\": \"<amount-as-string>\",\n    \"start_from\": <unix-timestamp>,\n    \"expire_at\": <unix-timestamp>\n}\n\n\nHow to support mintless jettons in your dapp?\n— To show balance with mintless, use data[\"balance\"] + data[\"mintless_info\"][\"amount\"]\n— To autoclaim on transaction, when your dapp asks user to send outgoing jetton transfer via TonConnect, check if data[\"mintless_info\"] is present and retrieve from mintless jetton claim api custom_payload and init_data to fill them in to transfer. \n— That's it. Now you support mintless jettons!\n\n\nP.S. Note that now code_hash and data_hash fields can be null for not yet deployed jettons wallets.",
      "forwarded_from": "Toncenter API",
      "forwarded_from_id": "channel2143019393",
      "forwarded_date": "2024-09-19T20:05:11.000Z"
    },
    {
      "id": 155,
      "type": "message",
      "date": "2024-09-24T11:02:28.000Z",
      "date_unixtime": "1727175748",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "TON Center API v2 & Index API v3: Now Supported by Chainstack\n\nExciting news for developers! You can now seamlessly integrate with the TON network using powerful tools from Chainstack: \n\n1. TON Center API v2: Real-time access to accounts, transactions, smart contracts, and more for up-to-date blockchain interaction.\n2. TON Center Index API v3: Ideal for advanced analytics, NFTs, and Jettons, with indexed data stored for complex queries and historical analysis.\n3. Chainstack Global Elastic Nodes: Scalable, flexible, and efficient TON infrastructure. \n\nWhether you need real-time access or powerful data-driven analytics, these APIs have you covered. Chainstack’s infrastructure now supports these tools, enabling developers to build and scale projects faster on TON.\n\n👉Get started now: https://chainstack.com/chainstack-introduces-ton-support/"
    },
    {
      "id": 157,
      "type": "message",
      "date": "2024-09-25T10:28:52.000Z",
      "date_unixtime": "1727260132",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "✋ Hackers, devs, founders.... TON is hosting a $2M hackathon for you! \n\nHackers League is a large online hackathon with \n◾️ $2M in prizes \n◾️ 19 offline bootcamps around the world \n◾️online workshops, mentors, and post-hackathon support\n\n🏃‍♂️ Join the voice chat on September 30th at 12.00 UTC with Helena, the Hackers League Organizer at TON Society and Anton, the Tact Compiler Lead at TON Foundation to learn how to win the hackathon and build your project on TON.\n\nSet the bell 👉 Click \n\nThe competition runs from September 13 until December 20—so there’s still time to get in the game!\n\n Register for the hackathon 👉 Click\n Find your city and join an offline bootcamp 👉 Click",
      "media_type": "photo",
      "file": "photos/photo_157.jpg",
      "width": 1280,
      "height": 1280
    },
    {
      "id": 158,
      "type": "message",
      "date": "2024-09-25T17:06:26.000Z",
      "date_unixtime": "1727283986",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "More info on Mintless Jettons for developers\n\nWe are happy to announce that many ecosystem products such as Tonkeeper, MyTonWallet, Tonhub, Tonviewer, Tonscan, DeDust, Stonfi, Toncenter API, TON API and others have already supported Mintless.\n\nTomorrow there are planning the first use of the mintless jetton during the minting of the Hamster Kombat game project.\n\nA few details for developers to be aware of:\n\n1) When initially sending and simultaneously claiming a jetton, you must attach at least 0.1 TON to the transfer.\n\n2) Airdrop for each user has two dates: date when it start to be claimable and deadline untill it should be claimed. Both can set individually for each user, but also can be the same for all users. For example for \"Mintless Points\" test jettons the deadline will expire tomorrow. HamsterCoins will start tomorrow and claiming deadline will expire in three years."
    },
    {
      "id": 159,
      "type": "message",
      "date": "2024-09-27T13:44:41.000Z",
      "date_unixtime": "1727444681",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🚀 Introducing Our Blog Platform: Real-World API Use Cases! 🛠️\n\nWe’re excited to launch our blog platform, where you’ll find in-depth, production-ready examples of how other companies are leveraging our API. 📖\n\nOur first article is now live: “Jettons Lock – A Production Case Study”. This post dives into practical examples that can help developers interact with our API more efficiently. If you’re looking to build robust solutions and want to learn from real-world use cases, this is the place to start! 🧑‍💻✨\n\n🔗 blog.dton.io / @dtontech",
      "forwarded_from": "dTON Tech",
      "forwarded_from_id": "channel2084817136",
      "forwarded_date": "2024-09-27T13:34:19.000Z"
    },
    {
      "id": 160,
      "type": "message",
      "date": "2024-11-07T13:36:09.000Z",
      "date_unixtime": "1730986569",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "TOLK about the Future: How Aleksandr Kirsanov Makes TON Blockchain More Accessible for Developers \n\nAleksandr Kirsanov is a developer with an impressive background and the successor to the development of the KPHP compiler. Now, he joins the TON Core Team, where he is working on TOLK — a next-generation language for writing smart contracts on the TON blockchain. TOLK is designed as an evolution of FunC, introducing familiar syntax similar to TypeScript, but leaving all low-level optimizations untouched.\n\nFull intreview: https://ton.app/journal/interview/3",
      "forwarded_from": "TON App Channel",
      "forwarded_from_id": "channel1666466018",
      "forwarded_date": "2024-11-07T11:39:28.000Z",
      "media_type": "photo",
      "file": "photos/photo_160.jpg",
      "width": 1280,
      "height": 787
    },
    {
      "id": 161,
      "type": "message",
      "date": "2024-11-17T13:00:42.000Z",
      "date_unixtime": "1731848442",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Bot API 8.0\n\nAnnouncing the largest update in the history of Mini Apps 🎉\n\nFull-Screen Mode\n• Mini Apps can now use the entire screen – allowing them to host immersive games 🚀 with expanded interfaces.\n\nGeolocation and Motion Tracking\n• Mini Apps can now prompt users for Geolocation Access, allowing them to build virtually any location-based 🗺 service.\n• Likewise, Mini Apps can request acceleration, orientation and rotation data from devices in real time.\n\nPaid Subscriptions\n• Subscriptions Plans powered by ⭐️ Telegram Stars are now available to all Bots and Mini Apps. \n• Apps can accept recurring payments – or cancel them at any time.\n\nGifts for Stars\n• Bots and Mini Apps can now use star proceeds to send Paid Gifts  🎁 to users with a custom caption.\n\nHome Screen Shortcuts\n• Mini apps can now be accessed via direct shortcuts added to the home screen of 📱 mobile devices.\n\nEmoji Statuses\n• Mini Apps can now let users pick a new emoji status 🚕 with a native dialog – or request access to later sync it with in-game badges, third-party APIs and more.\n\nSharing and Downloading Media\n• Mini Apps can now let users share media directly to any chat – with granular selection parameters.\n• Introduced a native popup to ⬇️download files from an App.\n\nCustomizable Loading Screen\n• The loading screen of mini apps can now be customized 🖥 in @Botfather – adding your own logo and brand colors.\n\nHardware-specific Optimizations\n• Mini Apps on Android now receive basic hardware info – enabling smoother usage and gaming 🏎 experiences for users.\n\n• And so much more, see our blog for high-quality demos and the full changelog for details:\n\nhttps://core.telegram.org/bots/api-changelog#november-17-2024\n\n⚠️ Warning: Starting December 1, 2024 messages with video posted in big communities can be delayed by the server until the respective video is reencoded. Read more here.",
      "forwarded_from": "BotNews",
      "forwarded_from_id": "channel1004276399",
      "forwarded_date": "2024-11-17T12:36:06.000Z"
    },
    {
      "id": 162,
      "type": "message",
      "date": "2024-11-21T11:02:24.000Z",
      "date_unixtime": "1732186944",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Good news, everyone!\n\nWe are excited to announce the launch of our webhook service. \n(Actually, there might still be some issues like delivery delays, but the API is stabilized.) \n\nWhat is it and why do you need it? \nTON is renowned for its scalability, meaning more transactions and blocks are added to the blockchain every second. In last year's stress tests, a record of 100,000 transactions per second was set. This means the blockchain generated over 100 megabytes of blocks per second or about a gigabit of incoming traffic if you want to view the entire blockchain. Of course, not every service needs to view all transactions in all blocks to find valuable insights. \nTo solve this problem, we are launching a webhook service that allows you to subscribe only to the data you need. Our service will attempt to deliver messages at increasing intervals until your server returns a 200 response.\n\nCurrent subscription options:\n\n1. Subscription to specific accounts - You can subscribe to a million accounts, and if a transaction occurs on any of them, we will notify you. Charges are based on the number of monitored account-days and each event.\n\n2. Subscription to specific opcodes of incoming messages - If any account receives an incoming message with such an opcode, we will notify you. Up to 100 opcodes per account. Charges are based on the number of events.\n\n3. Subscription to new accounts in the network - Don't require description. Charges only for the number of messages.\n\n4. Subscription to the mempool - We send all externals we see before they are included in the blockchain. Charges for each sent message, and no retries. If your server was unavailable, we will not attempt to resend.\n\nTry it!  Or read the docs first!\n\nWe welcome any feedback in comments to this post.",
      "forwarded_from": "Ton Console",
      "forwarded_from_id": "channel1610779830",
      "forwarded_date": "2024-11-21T11:00:59.000Z",
      "media_type": "photo",
      "file": "photos/photo_162.jpg",
      "width": 2560,
      "height": 2560
    },
    {
      "id": 163,
      "type": "message",
      "date": "2024-11-21T11:12:25.000Z",
      "date_unixtime": "1732187545",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Introducing Our New CDN for Mini Apps!\n\nWe’re excited to announce that TON Studio has launched a free CDN! Here’s why you’ll love it:\n\n▪️Accelerated Performance: Average global response time ~1.5 seconds.\n▪️Advanced Caching: On-edge caching ensures efficient data distribution in active regions.\n▪️Technology Independence: Deploy data from any storage (private repos, IPFS, etc.) using the mate CLI tool.\n▪️Version Control: Seamless project management with versioning support.\n▪️Robust Security: Protection against DDoS (L3, L4, L7), WAF, and bots.\n▪️Multi-Support Compatibility: Web, Gzip, and WebSocket support.\n▪️Generous Limits: Up to 50MB per project for all your mini-app needs.\n\nEnhance your Mini App experience with our cutting-edge CDN! \n\nAvailable now — try it out and see the difference.",
      "forwarded_from": "TON Community",
      "forwarded_from_id": "channel1233043722",
      "forwarded_date": "2024-11-21T11:09:49.000Z",
      "media_type": "photo",
      "file": "photos/photo_163.jpg",
      "width": 1000,
      "height": 641
    },
    {
      "id": 164,
      "type": "message",
      "date": "2024-11-30T05:12:49.000Z",
      "date_unixtime": "1732943569",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Attention TON Developers \n\nThe TON Dev Community calls on your expertise to contribute to advancing the TON ecosystem. Your insights and experiences in development are invaluable in making TON more robust and user-friendly.\n\nWe encourage every community member to share their experiences with TON development by participating in our survey.\n\nThe survey encompasses four key topics and will take approximately 5-10 minutes of your time.\n\n👉https://eoolk3ab.paperform.co/"
    },
    {
      "id": 165,
      "type": "message",
      "date": "2024-12-04T09:58:22.000Z",
      "date_unixtime": "1733306302",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Affiliate Programs and Bot API 8.1\n\nStarting today, Bot and Mini App developers can launch their own Affiliate Programs, and specify how much of their future ⭐️ Star revenue from referred users they are willing to share with those who invited them.\n\nIt only takes a few taps to set up an Affiliate Program — you can find out more in our dedicated guide.\n\nWith Bot API 8.1, all bots can also detect commissions and affiliate transactions out of the box, see the full changelog for details.\n\n⚠️ Warning: As of December 1 2024, messages with video posted in big communities can be delayed by the server until the respective video is reencoded. Read more here.",
      "forwarded_from": "BotNews",
      "forwarded_from_id": "channel1004276399",
      "forwarded_date": "2024-12-04T09:56:59.000Z"
    },
    {
      "id": 166,
      "type": "message",
      "date": "2024-12-04T09:59:06.000Z",
      "date_unixtime": "1733306346",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "⚡️ GitHub supports Tact!\n\nNow that you've clicked, let me clarify — thanks to our efforts, your support and all of you writing lots of smart contracts, Tact now has syntax highlighting all across GitHub!\n\n— Files with a .tact extension? Boom, colored.\n— Blocks of code in markdown that specify tact as their language? Got you covered.\n\n❤️ Thanks everyone for your support and love! Without you, there would be nothing. Literally.\n\n✈️ We're continuing to ship awesome stuff for you — expect many shiny things this December.\n\n🍲 growth is inevitable\n♨️ @tact_kitchen",
      "forwarded_from": "Tact Kitchen",
      "forwarded_from_id": "channel2180657744",
      "forwarded_date": "2024-12-04T09:37:12.000Z",
      "media_type": "photo",
      "file": "photos/photo_166.jpg",
      "width": 1280,
      "height": 720
    },
    {
      "id": 167,
      "type": "message",
      "date": "2024-12-05T12:34:47.000Z",
      "date_unixtime": "1733402087",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "📣 Hey, folks! The Tact dev team kindly asks you to share some feedback regarding your experience with smart-contract programming in Tact.\n\nOur mission is to develop a high quality programming language that can be used for every single project on TON and make code easy to write, understand and audit.\n\nThe survey covers 4 topics and will only take about 5-8 minutes of your time. \n\nThank you for your contribution!\n\n👉https://paperform.co/edit/h02jnxtq"
    },
    {
      "id": 168,
      "type": "message",
      "date": "2024-12-09T14:13:04.000Z",
      "date_unixtime": "1733753584",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🧑‍🎓  TON Studio is conducting a survey among developers to better understand the challenges TMA developers face today.\n\n🫡 We kindly ask you to share your experience and feedback by filling out the survey form, it takes only 2-3 minutes!\n\n👉https://forms.gle/G7KDQkoXrFnqov519"
    },
    {
      "id": 169,
      "type": "message",
      "date": "2024-12-12T14:08:53.000Z",
      "date_unixtime": "1734012533",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "📖 Secure Smart Contract Programming in Tact: Avoiding Pitfalls in the TON Ecosystem\n\nAs The Open Network evolves, its innovative features and the Tact programming language unlock new possibilities for developers. However, common mistakes can lead to vulnerabilities.\n\nCertiK’s latest blog post highlights critical issues like data serialization, concurrency, and gas management, offering actionable insights to optimize security in Tact smart contracts. Whether you’re new to TON or a seasoned developer, these best practices are essential for building robust and secure applications.\n\n🔗 https://www.certik.com/resources/blog/secure-smart-contract-programming-in-tact-popular-mistakes-in-the-ton"
    },
    {
      "id": 170,
      "type": "message",
      "date": "2024-12-18T14:08:19.000Z",
      "date_unixtime": "1734530899",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "FunC 0.4.6\n\nIn this release of FunC two compiler bugs were fixed. Both manifest in unusual conditions and scanning onchain history for last months didn't revealed any manifestation in the wild. So apparently existing contracts are safe thanks to culture of thorough integrational testing in developer community!\nGreat job 👍\n\nStill, if you are deploying a new contracts we recommend you to switch to new compiler version.\n\n1) First bug is related to try/catch construction, where inside try branch a function that modifies c1/с3 is called. That may happen in case of non-trivial branching in this child function or using set_c3. How to check.\n\n2) Second bug is related to storing function into variable. In this case, in FunC <=0.4.5 impure modifier of this functions was dropped."
    },
    {
      "id": 171,
      "type": "message",
      "date": "2024-12-22T10:15:42.000Z",
      "date_unixtime": "1734862542",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "MaraTON Challenge 1: A Major Programming Competition will start tomorrow\n\nMaraTON Challenge 1, a competition for TON programmers co-hosted by Codeforces and TON Core, will start tomorrow. MaraTON I focuses on practical challenges inspired by the TON blockchain. Don’t worry — no prior knowledge of TON is needed! The contest is designed to help you learn as you go.\n\n📅 Starts: Monday, December 23\n📅 Ends: Monday, January 13\n\nTotal Prize Pool: Over 50,000 USDT \nRewards for top performers during the contest and for final rankings!\n\nRegistration is open to everyone — sign up now!",
      "forwarded_from": "TON Community",
      "forwarded_from_id": "channel1233043722",
      "forwarded_date": "2024-12-22T10:12:36.000Z",
      "media_type": "photo",
      "file": "photos/photo_171.jpg",
      "width": 1280,
      "height": 1024
    },
    {
      "id": 172,
      "type": "message",
      "date": "2024-12-23T09:05:38.000Z",
      "date_unixtime": "1734944738",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "TonTech team is developing infrastructure projects like Liteserver and is eager to improve them.\nTo better understand the current needs, they launched a survey.\nPlease share the needs you feel are and will be helpful for your product with the Infrastructure Developer Survey. \n\n👉https://forms.gle/D9ZWAo1qMnNrio3dA"
    },
    {
      "id": 173,
      "type": "message",
      "date": "2024-12-26T18:05:22.000Z",
      "date_unixtime": "1735236322",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Introducing Unit-Testing in Tolk with Jest\n\nTolk developers rejoice! Unit-testing for smart contracts just got easier. While sandbox offers E2E testing, it’s far from ideal for unit-testing.\n\nNow, with the Jest-Tolk runner, unit-testing in Tolk is a reality. Seamlessly integrate with Jest and streamline your testing workflow today.\n\nExplore the tool!\n\nGitHub: tonkite/jest-tolk\nNPM: @tonkite/jest-tolk\n\nUpgrade your smart contract testing game now!",
      "forwarded_from": "DeDust.io - Developer News",
      "forwarded_from_id": "channel2184665851",
      "forwarded_date": "2024-12-26T17:12:56.000Z",
      "media_type": "photo",
      "file": "photos/photo_173.jpg",
      "width": 1280,
      "height": 1121
    },
    {
      "id": 174,
      "type": "message",
      "date": "2025-01-13T10:01:11.000Z",
      "date_unixtime": "1736762471",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "⛏️ TON Space adds support for the TON test network\n\nWe’re excited to announce that developers can now test and build applications more quickly, all within Telegram. This was made possible by integrating the TON Testnet into TON Space 💎\n\n⛏ The test network (or testnet) is a separate blockchain where developers can safely implement updates without affecting the main network. This prevents potential instability on the main blockchain (also known as the mainnet or “core network”). Testnet allows updates to be thoroughly tested before deploying them to mainnet 🪙\n\nEach application can have its own testnet, utilizing test tokens for transactions. You can get test TON here: @testgiver_ton_bot \n\nPlease note: Test tokens cost nothing and cannot be exchanged for real crypto. Testnet is only intended to be used by developers and beta testers 🫴\n\nDevelopers and testers can switch between testnet and mainnet in their TON Space settings. Additionally, we've prepared a special link for developers to include in their applications, making it easier for QA teams and beta testers to switch between networks 🗺",
      "forwarded_from": "TON Space News",
      "forwarded_from_id": "channel2446648561",
      "forwarded_date": "2024-12-18T16:37:51.000Z"
    },
    {
      "id": 175,
      "type": "message",
      "date": "2025-01-14T12:44:39.000Z",
      "date_unixtime": "1736858679",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "💎 Blockchain Contest, Round 1\n\nTelegram and TON Core announce a new coding contest!\n\nPrize Fund: $100,000 to $200,000 \nDeadline: 23:59, February 4th (Dubai time) \nTasks: Blockchain Validation (C++ code optimization) and/or Trustless Bridge (participants can choose one or both).\n\nPrize Fund Distribution\nThe total prize fund, up to $200,000, will be allocated based on each participant’s overall contribution. Winners will also have the opportunity to compete in Stage 2, which will feature a separate, similar prize fund.\n\nAdditional Opportunities \nWinners have the chance to join the Telegram or TON Core teams, or receive support to launch a real TVM sidechain for TON. The best optimization solutions may also be implemented to enhance the TON main network.",
      "forwarded_from": "Telegram Contests",
      "forwarded_from_id": "channel1038976893",
      "forwarded_date": "2025-01-14T11:40:02.000Z"
    },
    {
      "id": 176,
      "type": "message",
      "date": "2025-01-14T13:53:22.000Z",
      "date_unixtime": "1736862802",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔨 TON Connect SDK Update\n\nWe're excited to announce a new release of the TON Connect SDK with improvements in mobile experience and UI refinements.\n\nWe kindly request all dapp developers to update to the latest version to ensure optimal performance and user experience.\n\n👥 @tonconnect/{sdk,ui,ui-react}\n  • Enhanced mobile layout and wallet list\n  • Improved wallet placement for mobile users\n  • Refined QR code screens interface\n  • Updated wallet naming convention\n  • Various style optimizations\n\n📁 New package versions\n  • @tonconnect/sdk 3.0.6\n  • @tonconnect/ui 2.0.11\n  • @tonconnect/ui-react 2.0.11\n\n⬇️ To update, run npm install @tonconnect/ui-react@latest or npm install @tonconnect/ui@latest\n\n💡 To learn more, visit the GitHub page at https://github.com/ton-connect/sdk.\n\n💬 Encountered issues? Please report them on GitHub at https://github.com/ton-connect/sdk/issues.\n\n🎁 Your feedback and usage examples are crucial. Share your experiences to help us evolve the SDK!",
      "forwarded_from": "TonTech",
      "forwarded_from_id": "channel1764902466",
      "forwarded_date": "2025-01-14T13:44:56.000Z"
    },
    {
      "id": 177,
      "type": "message",
      "date": "2025-01-21T09:40:41.000Z",
      "date_unixtime": "1737452441",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Two months of absence: what was going on?\n\nTwo months have passed since the announcement of Tolk. You might be wondered, what was going on and why there we no releases yet.\n\nThroughout all November, I've been working on the vision of the future. My goal was to \"visualize\" what Tolk v1.0 should look like. What's the language we're all targeting to, so that it solves lots of practical problems, avoids manual cells/slices manipulation, provides sufficient mechanisms for ABI generation, but still being zero overhead. I have created a giant roadmap (40 PDF pages!) describing the vision, and how, step by step, we're going to reach it.\n\nThroughout all December, I've been constantly working on the compiler's kernel. As you know, Tolk is a fork of FunC. FunC compiler internals are very challenging to be extended and modified. The way FunC looks like is just a mirror of its internal implementation. Heading towards the future, I had to partially \"untangle\" this \"legacy FunC core\", so that in the future, it will be able to \"interbreed\" with features it was not originally designed for.\n\nCurrently I am done with this preparation. Tolk v0.7 has just been released. It contains a fully rewritten semantic analysis kernel (though almost invisible to the end user, huh).\n\n✅ Notable changes in Tolk v0.7:\n1. Under the hood: refactor and revamp compiler internals. AST-level semantic analysis kernel\n2. Under the hood: rewrite the type system from Hindley-Milner to static typing\n3. Clear and readable error messages on type mismatch\n4. Generic functions fun f<T>(...) and instantiations like f<int>(...)\n5. The bool type\n6. Type casting via value as T\n\nPR on GitHub with detailed info. IDE plugins are updated accordingly.\n\nBTW, a new version of blueprint was also released. You can now update compilers (Tolk / FunC / Tact) independently, they became peer dependencies.\n\nP.S. I'll uncover the details about planned Tolk v1.0 quite soon.",
      "forwarded_from": "TOLK lang",
      "forwarded_from_id": "channel2203874215",
      "forwarded_date": "2025-01-21T09:12:01.000Z"
    },
    {
      "id": 178,
      "type": "message",
      "date": "2025-01-21T10:47:31.000Z",
      "date_unixtime": "1737456451",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔨Dev tools updates\n\nRecently new versions of blueprint, sandbox, test-utils, and create-ton have been released. The most important (and breaking) change is the fact that since blueprint v0.28.0 compilers (func-js, tolk, tact) have become peer dependencies. This means that you can pick and choose any compiler version that you need, as long as its API is compatible with what blueprint expects, but this also means that you need to have them listed in your package.json. If you're creating a new project using create-ton, it will add compiler dependencies automatically. If not and if you're upgrading blueprint in an old project, you will have to install compilers yourself, you can use the template's package.json for reference.\n\nChanges to sandbox and test-utils include better support for extra currencies, which might be of use due to the recent developments in TON.",
      "forwarded_from": "TonTech",
      "forwarded_from_id": "channel1764902466",
      "forwarded_date": "2025-01-21T09:26:44.000Z"
    },
    {
      "id": 180,
      "type": "message",
      "date": "2025-01-22T11:02:21.000Z",
      "date_unixtime": "1737543741",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Telegram and TON Make it Exclusive!\n\nAll mini-app developers in Telegram will now exclusively use TON as their blockchain infrastructure. All mini-apps that do not currently use TON should migrate within the next 30 days. TON Connect - TON's Wallet authentication protocol in Telegram - will be the sole wallet connect protocol for every Telegram Mini App, excluding bridging scenarios.\n\nTelegram and TON have updated their documentation, and TON Foundation is giving TG Ads grants to projects who will migrate within the next 30 days to help them get a good start in TON Ecosystem. Check out the grant program and developer guidelines here!\n\nTo learn more about this step forward head over to our latest blog article.  ",
      "forwarded_from": "TON Community",
      "forwarded_from_id": "channel1233043722",
      "forwarded_date": "2025-01-21T14:53:40.000Z",
      "media_type": "photo",
      "file": "photos/photo_180.jpg",
      "width": 1280,
      "height": 1280
    },
    {
      "id": 181,
      "type": "message",
      "date": "2025-02-05T17:46:43.000Z",
      "date_unixtime": "1738777603",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🚀 Tact v1.5 Audited by Trail of Bits\n\nThe security audit for Tact v1.5 has been completed by Trail of Bits, a leading Web3 security firm.\n\n✅ No high-severity vulnerabilities were found.\n\n🔧 Some bugs and points of improvement were discovered and addressed in a new Tact v1.5.4 bugfix release.\n\nThanks to Trail of Bits for their thorough review!\n\nThe report can be accessed at the Trail of Bits GitHub repo: https://github.com/trailofbits/publications/blob/master/reviews/2025-01-ton-studio-tact-compiler-securityreview.pdf\n\n⚡️ In the meantime we continue to improve Tact with new language features, gas optimizations (a lot of those lately!), and enhancements to the compiler’s reliability. This ensures a secure and efficient development experience on TON Blockchain.\n\n👉 Upgrade to Tact 1.5.4, if not already: https://docs.tact-lang.org/book/compile/#upgrades\n\n🍲 cooking with great care for performance and users\n♨️ @tact_kitchen",
      "forwarded_from": "Tact Kitchen",
      "forwarded_from_id": "channel2180657744",
      "forwarded_date": "2025-02-05T17:46:31.000Z"
    },
    {
      "id": 183,
      "type": "message",
      "date": "2025-02-06T08:15:55.000Z",
      "date_unixtime": "1738829755",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Try 🔗 act.ghwnd.cc – a flexible no-code message constructor with TonConnect support  👀\n\nWith act, you can create and save a board with different messages for various contracts and sign them however you like – it can even be an admin panel for a contract (use it in testnet – it's meant for experiments, and we take no responsibility).\n\nKey features:\n- act has a \"bucket\": create actions, add them to the bucket, and send them in batches of up to 4/255 actions at a time, depending on the wallet version;\n- duplicate actions;\n- duplicate cells, copy them in base64, and paste ready-made base64 cells into storeRef;\n- hide cells – makes navigation slightly more convenient;\n- when sending a token, you can quickly get the jetton wallet address of the connected wallet;\n- act includes templates to help you explore popular actions with links to documentation.\n\nCheck out this example of a swap on dedust to see how it all works. There's a video guide at the bottom.\n\n🔗 act.ghwnd.cc",
      "forwarded_from": "ghwnd",
      "forwarded_from_id": "channel1690267406",
      "forwarded_date": "2025-02-06T08:14:58.000Z",
      "media_type": "photo",
      "file": "photos/photo_183.jpg",
      "width": 576,
      "height": 579
    },
    {
      "id": 184,
      "type": "message",
      "date": "2025-02-06T08:54:37.000Z",
      "date_unixtime": "1738832077",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "TON Core: Report for December-January\n\n48 updates, from small to huge. Moving along the roadmap: first part of the Accelerator, new tools for validators, TVM sidechains, new versions of TOLK and API, support for extra currencies and BTC Teleport, and other.\n\nhttps://telegra.ph/TON-Core-Dec-Jan-2025-Updates-02-02",
      "forwarded_from": "TON Core",
      "forwarded_from_id": "channel2336510893",
      "forwarded_date": "2025-02-03T12:27:56.000Z"
    },
    {
      "id": 185,
      "type": "message",
      "date": "2025-02-11T09:18:39.000Z",
      "date_unixtime": "1739265519",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Tolk v0.8: preparation for structures\n\nA new version of Tolk was released several days ago. We're starting a way to eventually implement structures with auto packing to/from cells. This will take several steps (each publicly released), it's the first one.\n\n✅ Notable changes in Tolk v0.8:\n1. Syntax tensorVar.0 and tupleVar.0, both for reading and writing\n2. Allow cell, slice, etc. to be valid identifiers\n\nPR on GitHub with detailed info.\n\nUsing syntax `tensorVar.{i}` and `tupleVar.{i}`, you can access tensors/tuples by indices without unpacking them.\n\nIt works for tensors:\n\nvar t = (5, someSlice, someBuilder);   // 3 stack slots\nt.0                     // 5\nt.0 = 10;               // t is now (10, ...)\nt.0 += 1;               // t is now (11, ...)\nincrement(mutate t.0);  // t is now (12, ...)\nt.0.increment();        // t is now (13, ...)\n\nt.1         // slice\nt.100500    // compilation error\n\n\nIt works for tuples (does asm INDEX/SETINDEX under the hood):\n\nvar t = [5, someSlice, someBuilder];   // 1 tuple on a stack with 3 items\nt.0                     // \"0 INDEX\", reads 5\nt.0 = 10;               // \"0 SETINDEX\", t is now [10, ...]\nt.0 += 1;               // \"0 INDEX\" to read 10, \"0 SETINDEX\" to write 11\nincrement(mutate t.0);  // also, the same way\nt.0.increment();        // also, the same way\n\nt.1         // \"1 INDEX\", it's slice\nt.100500    // compilation error\n\n\nIt works for nesting var.{i}.{j}. It works for nested tensors, nested tuples, tuples nested into tensors. It works for mutate. It works for globals.\n\nWhy is this essential?\n\nIn the future, we'll have structures, declared like this:\n\nstruct User {\n    id: int;\n    name: slice;\n}\n\n\nStructures will be stored like tensors on a stack:\n\nvar u: User = { id: 5, name: \"\" };\n// u is actually 2 slots on a stack, the same as\nvar u: (int, slice) = (5, \"\");\n\nfun getUser(): User { ... }\n// on a stack, the same as\nfun getUser(): (int, slice) { ... }\n\n\nIt means, that `obj.{field}` is exactly the same as `tensorVar.{i}`:\n\nvar u: User = ...;   // u: (int, slice) = ...\nu.id;                // u.0\nu.id = 10;           // u.0 = 10\n\n\nSame goes for nested objects:\n\nstruct Storage {\n    lastUpdated: int;\n    owner: User;\n}\n\ns.lastUpdated        // s.0\ns.owner.id           // s.1.0\n\n\nSo, implementing indexed access for tensors/tuples covering all scenarios is a direct step towards structures.",
      "forwarded_from": "TOLK lang",
      "forwarded_from_id": "channel2203874215",
      "forwarded_date": "2025-02-11T09:12:01.000Z"
    },
    {
      "id": 186,
      "type": "message",
      "date": "2025-02-12T13:37:44.000Z",
      "date_unixtime": "1739367464",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Bot API 8.3\n\nVideo Improvements\n• Introduced support for custom covers and start timestamps for videos.\n• Out of the box, bots can specify a cover and start timestamp when sending, editing and forwarding videos — including in albums and paid media.\n\nGifts and Reactions\n• Bots can now send gifts 🎁 to channels, in addition to regular users.\n• Added support for transactions with chats.\n• Bots can now add reactions to most service messages.\n\nSimilar Bots\n• A list of similar bots will now appear in bot profiles, helping users discover other bots they may find interesting.\n\n• And more, see the full changelog for details:\n\nhttps://core.telegram.org/bots/api-changelog#february-12-2025",
      "forwarded_from": "BotNews",
      "forwarded_from_id": "channel1004276399",
      "forwarded_date": "2025-02-12T13:34:41.000Z"
    },
    {
      "id": 187,
      "type": "message",
      "date": "2025-02-19T12:07:59.000Z",
      "date_unixtime": "1739966879",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🚀 Bring TON to ElizaOS – Join the Bounty Program!\n\nTON Blockchain is launching a bounty program to develop the TON Plugin within ElizaOS! This is your chance to contribute to a cutting-edge AI framework and integrate TON into autonomous AI agents.\n\n$20,000 in prizes is up for grabs! Contribute by implementing key features and earn rewards for successfully merged pull requests.\n\n💡 How to participate: take on one of the open issues:\n👉 List of open TON Plugin bounties\n\n⚡ Act fast! Don’t miss out on this opportunity to bring TON and AI together!"
    },
    {
      "id": 188,
      "type": "message",
      "date": "2025-02-21T09:59:54.000Z",
      "date_unixtime": "1740131994",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "📝 TON devs — we need your feedback!\n\nBuilding on TON? Tell us what works (and what doesn’t) in a quick survey on:\n\n• Developing on TON, tooling, programming languages (FunC, Tact, Tolk), TMAs, guides\n\nFill it out, drop your wallet & claim an exclusive reputation SBT!\n\nMake your voice count. ",
      "forwarded_from": "Society Builders",
      "forwarded_from_id": "channel2369094999",
      "forwarded_date": "2025-02-19T13:44:37.000Z",
      "media_type": "photo",
      "file": "photos/photo_188.jpg",
      "width": 1280,
      "height": 1280
    },
    {
      "id": 189,
      "type": "message",
      "date": "2025-02-26T15:26:52.000Z",
      "date_unixtime": "1740583612",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Support for extra-currencies in local ton-http-api\n\nIn ton-http-api v2.0.53, which you can install by yourself on your server, support for extra-currencies and a number of other improvements have been made.\n\nRecall that earlier support for extra-currencies was made in the public Toncenter V2 and Toncenter V3 APIs.\n\nhttps://github.com/toncenter/ton-http-api/releases/tag/v2.0.53",
      "forwarded_from": "Toncenter API",
      "forwarded_from_id": "channel2143019393",
      "forwarded_date": "2025-02-26T09:35:16.000Z"
    },
    {
      "id": 190,
      "type": "message",
      "date": "2025-02-26T15:27:02.000Z",
      "date_unixtime": "1740583622",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Improved Metadata API\n\nLast month we started providing metadata for Jettons and NFTs in the V3 API.\n\nWe are pleased to report a number of improvements:\n\n— The metadata now enters the API in advance as soon as the token appears on the network. In the previous implementation, the metadata was indexed the first time the token was requested.\n\n— Images and JSON are now proxied via toncenter.com. 3 image sizes are available, as well as original non-proxied urls for JSON and images. IPFS is supported.\nUsing a proxy increases security (you don't make requests to third-party hosting) and speed of downloading resources.",
      "forwarded_from": "Toncenter API",
      "forwarded_from_id": "channel2143019393",
      "forwarded_date": "2025-02-26T09:35:16.000Z"
    },
    {
      "id": 191,
      "type": "message",
      "date": "2025-03-01T05:04:58.000Z",
      "date_unixtime": "1740805498",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🎉 Tact v1.6.0 is released!\n\n🏆 This is the biggest update of Tact since its creation, bigger than all previous milestones combined. There were so many improvements that we've even won over FunC in terms of gas usage on many standard contracts, such as Jettons.\n🤔 Don't believe me?\n🥳 Let's unpack Tact v1.6.0 together and see these improvements for ourselves!\n\nWe'll start with the number one achievement of this release:\n\n⛽️ Gas optimization victory over FunC\n\nGas has long been a major pain point for Tact. Prior to v1.6.0, Tact's gas usage on many common contracts, such as Jettons, was far from ideal, requiring about 2.5 times gas of the FunC reference implementation.\n\nBut with Tact 1.6.0, those old gas-expensive days are long gone.\n\n🤯 For example, a Tact rewrite of the reference FunC Jetton code consumes less gas for transfer, burn and discovery messages!\n😎 So, expect to receive easy-to-use idiomatic Tact implementations of common contracts in the near future\n\nSome of the things we did to achieve this:\n▪️ Removed \"system\" cell — parent contract code is no longer stored in the system cell with all the child contract codes\n▪️ Removed redundant address checks\n▪️ Deprecated Deployable trait in favor of receive(){}\n▪️ Introduced contract parameters as an alternative to init() function\n\nAnd optimized compiler internals, many old and new functions in the stdlib:\n\n🧰 Some of the standard library additions and changes\n\n• Added specialized deploy and message functions for efficient on-chain deployments and non-deployment messages respectively\n• Many math functions, such as divc, mulShiftRightCeil, and others\n• More advanced functions, such as setGasLimit, setSeed, myCode, and others\n• Handy throwIf and throwUnless functions, which deprecated their \"native\" prefixed counterparts\n• Optimized emptyCell and emptySlice functions\n• Int.toString function now consumes up to 64% less gas\n• Int.toFloatString function now consumes up to 62% less gas\n\nAdded many functions for Cell, Slice and Builder types:\n•  Variable integer serialization types and the corresponding .load and .store functions of Slice and Builder types\n• Functions Slice.hashData and String.hashData for efficient hashes of data only\n• Functions for working with addresses: Slice.asAddress, Slice.asAddressUnsafe, contractHash, and a new BasechainAddress type its helper functions\n• ...and more!\n\n🧳 More auxiliary things\n\n• Basic let-destructuring of structs and Messages\n• Compile-time method ID expressions for getters and Message opcodes\n• The codeOf expression to get the code of child contracts\n• More map improvements and new methods, like replace and replaceGet\n• New augmented assignment operators &&=, ||=, >>= and <<=\n• Better error reporting for many cases\n• Generation of constants in TypeScript wrappers\n• The -w, --watch CLI flags for watching for changes and automatic recompilations\n• CLI for the Tact's TVM disassembler — unboc\n• Fixes of the compilation report\n• Fixes of the compiler's third-party API\n• Fixes of the internal infrastructure and code generation\n• Lots of other miscellaneous bug fixes and smaller enhancements\n• ...and documentation for all of that and beyond!\n\nBesides, check out the updated Awesome Tact list and add your awesome projects, especially those using Tact in production!\n\n⚠️ Breaking changes\n\nThere are only two, and they're both pretty minor:\n\n• Tact 1.6.0 replaces Context.bounced field with Context.bounceable, which tells whether the received message can bounce back or not. Previously, the bounced was useless since any bounced messages would be handled in a separate bounced() receiver.\n\n• The enabledMasterchain option was removed from tact.config.json. Going forward, support of masterchain addresses is always enabled in Tact contracts.\n\n♥️ Special thanks goes to all the contributors and community members — without you there would be nothing. Let's keep building the future of smart contracts with ⚡️ Tact!\n📜 See full release notes for Tact v1.6.0\n📥 And upgrade Tact in your projects\n\n🍲 we're beating the gas allegations with this one 🗣🗣🗣\n♨️ @tact_kitchen",
      "media_type": "photo",
      "file": "photos/photo_191.jpg",
      "width": 751,
      "height": 501
    },
    {
      "id": 193,
      "type": "message",
      "date": "2025-03-05T08:17:06.000Z",
      "date_unixtime": "1741162626",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🎉 Tact v1.6.1 is released!\n\n👀 \"Long\" time no see — many tools have been updated to support the latest Tact versions, and we've prepared some quality-of-life additions and minor fixes.\n\nA big release cannot exist without a follow-up patch. This patch mainly focused on polishing things in the internal infrastructure, standard library, and public APIs.\n\n🛠 Bug fixes\n\n▪️ The multiple wildcard function parameters are now supported.\n\nThat is, the following works in v1.6.1:\n\n\ntrait WildThing {\n    // Using wildcards for parameter names\n    virtual fun assure(_: Int, _: Int): Bool {\n        return true;\n    }\n}\n\ncontract YouMakeMyHeartSing with WildThing {\n    // And then overriding them with concrete names\n    override fun assure(a: Int, b: Int): Bool {\n        return a + b == b + a;\n    }\n}\n\n▪️ Made calls to the .toCell() function on struct as a contract field handled correctly.\n\n\nstruct MyStruct { x: Int; y: Int; z: Int }\n\ncontract MyContract(myField: MyStruct) {\n    receive() {\n        // This works fine now:\n        self.reply(self.myField.toCell());\n    }\n}\n\n🧰 Standard library additions and changes\n\n• Added the StateInit.hasSameBasechainAddress() function, which is a gas-efficient way to check whether the given initial package corresponds to a specified address.\n\n• Added the cashback() function to efficiently forward excess funds from an incoming message to the target address.\n\n• All entities in Core libraries received documentation comments. Next time, we'll add missing doc comments for the standard libraries, i.e., everything imported using the import \"@stdlib/...\" syntax.\n\n🧳 Some other changes:\n\n• We've inlined the contract load functions, so the gas consumption of the benchmarked Jetton implementation in Tact is even smaller than that of its reference implementation in FunC.\n\n• The TypeScript wrappers now produce bi-directional mappings of exit codes from their numbers to string descriptions and vice versa. Plus, the message opcodes are exported too.\n\n• The .code infix is no longer added to the file names of the generated FunC, Fift, and disassembled Fift outputs. It was annoying to see it everywhere, so now it's only present on the compiled .boc files.\n\n📜 See the full release notes for Tact v1.6.1\n📥 And upgrade Tact in your projects\n\nBesides, the tact.vim plugin for Vim 8+ and tact-sublime package for Sublime Text 3+ have been updated to support Tact v1.6.0 (and v1.6.1 too).\n\nThe Misti static analyzer has been updated to v0.7.0 and now supports Tact v1.6.0 and v1.6.1. See its full release notes.\n\nSpeaking of plugins and tools, we have another announcement to make — we're starting an alpha test of the tact-language-server: an official language server for Tact that can be used standalone or within a dedicated extension for VSCode and VSCode-based editors, such as VSCodium, Cursor, Windsurf, and others.\n\nJoin the alpha squad and gain early access to great tooling: tact-language-server. If things are good, please give it a star and write a positive review. If they're not — open an issue, and we'll take a look!\n\n🍲 cue the Tact type beat (sped up)\n♨️ @tact_kitchen from the @ton_studio",
      "media_type": "photo",
      "file": "photos/photo_193.jpg",
      "width": 640,
      "height": 100
    },
    {
      "id": 194,
      "type": "message",
      "date": "2025-03-07T10:01:59.000Z",
      "date_unixtime": "1741341719",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "𒀟 Tolk v0.9: nullable types, null safefy, control flow, smart casts\n\nTolk v0.9 introduces nullable types: int?, cell?, and T?, bringing null safety to your code. The compiler prevents using nullable values without checks, but thanks to smart casts, this feels smooth and natural.\n\n✅ Notable changes in Tolk v0.9:\n\n1. Nullable types int?, cell?, etc.; null safety\n2. Standard library updated to reflect nullability\n3. Smart casts, like in TypeScript in Kotlin\n4. Operator ! (non-null assertion)\n5. Code after throw is treated unreachable\n6. The never type\n\nPR on GitHub with detailed info.\n\n✔ Nullable types and null safety\n\nIn FunC, null was implicitly assignable to any primitive type — too permissive. A variable declared as int could still hold null at runtime, leading to TVM exceptions if used incorrectly.\n\nTolk now forces you to explicitly mark nullable values. This aligns with TypeScript T | null and Kotlin, preventing unintended null usage.\n\n\nvalue = x > 0 ? 1 : null;  // int?\n\nvalue + 5;               // error\ns.storeInt(value);       // error\n\nif (value != null) {\n    value + 5;           // ok\n    s.storeInt(value);   // ok\n}\n\n\n* any type can be nullable: cell?, [int, slice]?, (int, cell)?\n* no more unexpected TVM exceptions due to null\n* at runtime, int? and cell? occupy just one stack slot — zero overhead\n\n✔ Smart casts (via control flow graph)\n\nOnce a nullable value is checked, the compiler automatically refines its type:\n\nif (lastCell != null) {\n    // here lastCell is `cell`, not `cell?`\n}\n\n\nor:\n\nif (lastCell == null || prevCell == null) {\n    return;\n}\n// both lastCell and prevCell are `cell`\n\n\nor:\n\nvar x: int? = ...;\nif (x == null) {\n    x = random();\n}\n// here x is `int`\n\n\nSmart casts ensure code is safe while remaining gas-efficient (compile-time only).\n\n✔ Operator `!` (non-null assertion)\n\nIf you know a value can't be null, use the ! operator to bypass nullability checks:\n\n// this key 100% exists, make it `cell`, not `cell?`\nvalidators = getBlockchainConfigParam(16)!;\n\n\nIt's useful for low-level TVM functions (dicts, particularly), when you have guarantees outside the code. Use with care!\n\n✔ The `never` type\n\nNow, you can declare \"always-throwing functions\":\n\nfun alwaysThrows(): never {\n    throw 123;\n}\n\nfun f() {\n    ...\n    alwaysThrows();  // no return needed after this\n}\n\n\nnever also occurs implicitly when a condition is impossible:\n\nvar v = 0;\n// compiler warning: `int` can never be `null`\nif (v == null) {\n    // v is `never`\n}\n\n\n... this is just the beginning! Nullable tensors, tricky smart casts, and low-level null safety details — all explained in the PR.\n\n🌳 Null safety is smooth, intuitive, and enforced at compile time — no runtime cost, no extra gas, just safer code.",
      "forwarded_from": "TOLK lang",
      "forwarded_from_id": "channel2203874215",
      "forwarded_date": "2025-03-07T09:12:01.000Z"
    },
    {
      "id": 195,
      "type": "message",
      "date": "2025-03-10T11:50:33.000Z",
      "date_unixtime": "1741607433",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Get high TONAPI limits in your dApps for free\n\nYou already know our @ton-api/client library — a client for building advanced TON dApps. Now, we're happy to announce a new feature that grants high TONAPI limits for free.\n\nThis upgrade enables cost-free TON API usage within dApps running in the Tonkeeper built-in browser (mobile) and standard browsers with the Tonkeeper extension installed.\n\nTo check if this feature is available, verify that the window.tonapi object exists in your browser.\n\nHow it works →",
      "forwarded_from": "Ton Console",
      "forwarded_from_id": "channel1610779830",
      "forwarded_date": "2025-03-10T11:50:17.000Z",
      "media_type": "photo",
      "file": "photos/photo_195.jpg",
      "width": 1280,
      "height": 1280
    },
    {
      "id": 196,
      "type": "message",
      "date": "2025-03-13T13:19:41.000Z",
      "date_unixtime": "1741871981",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "During the last year all dTON services were running on kubernetes cluster without HA build. Sometimes when we lost servers, we faced complex problems.\n\nTo improve the stability and availability of the service we developed high availability dTON cluster that will continue to work even if some of the servers are unavailable. Additionally, we've got setup complex monitoring and alerting system on services and data consistency. \n\nToday we managed to switch all our services to HA cluster. \n\nIn our article we want to share our experience of HA cluster on top of bare-metal servers in three parts:\n\n- dTON Kubernetes High Availability Transition\n- dTON LiteServers High Availability Transition\n- dTON GraphQL High Availability Transition\n\nSecond and third part will be posted exclusively on @dtontech with promo codes on dTON API usage.\n\nhttps://blog.dton.io/dton-kubernetes-high-availability-transition-part-1/",
      "forwarded_from": "dTON Tech",
      "forwarded_from_id": "channel2084817136",
      "forwarded_date": "2025-03-13T13:14:39.000Z"
    },
    {
      "id": 197,
      "type": "message",
      "date": "2025-03-14T15:47:44.000Z",
      "date_unixtime": "1741967264",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "✈️ The First AI Developer Community in TON is Here! 🚀\n\nA new developer community TON AI Narrative has been launched in TON! This is a place where we explore the synergy of AI + Web3 + Telegram and build the future of AI agents in TON.\n\n💡What’s in TON AI Narrative?\n\n📌 AI tutorials for TON\n📌 Technologies and tools for AI agents\n📌 Events and challenges for developers\n\n🔥 TON AI Plugin – The First Step Toward TON AI SDK\n\nOur community has built the first AI tool for TON – TON AI Plugin in the ElizaOS framework. \n\nThe goal is simple: any developer should be able to create an AI agent on TON in just 15 minutes.\n\n💡 AI agents can’t get bank accounts, but they can get crypto wallets. \n\nNow, AI can hold and manage crypto, make transactions, and interact with smart contracts – unlocking.\n\nExample:\n\n💬 “I have $5000 and want to invest in DeFi”\n\n👉 Agent builds the transaction for you, distributing funds across Dedust, Storm, Eva, and other DeFi protocols on TON. All you need to do is review and sign the transaction.\n\nBut this is just the beginning! TON AI Plugin is the first step toward a full TON AI SDK, which will provide tools for AI agent development, Web3 integration, and Telegram interaction.\n\n🐞 Join the Bug Bounty – Test the TON AI Plugin!\n\nWe are looking for enthusiasts who want to explore AI’s potential in Web3 and help improve this tool.\n\n💵 The top 3 bug reporters will receive a cash reward!\n\n🔗 Full details and participation rules:\n👉 BUG-BOUNTY.md\n\n📣 Join TON AI Narrative and help build the future of AI on TON!\n\n🗣 Chat: TON AI Narrative Chat\n📢 Channel: TON AI Narrative"
    },
    {
      "id": 198,
      "type": "message",
      "date": "2025-03-15T13:20:13.000Z",
      "date_unixtime": "1742044813",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🖥 Help Improve the Developer Experience in TON!\n\nWe're conducting a focused study on TON API providers to identify key challenges and unlock new opportunities for innovation. Our mission is to make the TON ecosystem more powerful, seamless, and developer-friendly.  \n\n💡 Your insights matter! Help us enhance the tools you use by sharing your experience in this short survey:  \n👉 Survey link\n\nYour feedback drives real improvements—let’s build the best developer experience together! 💙"
    },
    {
      "id": 199,
      "type": "message",
      "date": "2025-03-20T09:20:35.000Z",
      "date_unixtime": "1742462435",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🫧 Tolk v0.10: preparing for serialization — intN, bytesN, coins\n\nThis update lays the foundation of future auto-packing to/from cells by solving one critical question: \nHow should fields be serialized?\n\n✅ Notable changes in Tolk v0.10:\n\n1. Fixed-size integer types: int32, uint64, etc.\n2. Type coins and function ton(\"0.05\")\n3. Types bytesN and bitsN (backed by slices at TVM)\n4. Replace \"...\"c postfixes with stringCrc32(\"...\") functions\n5. Trailing comma support\n\nPR on GitHub with detailed info.\n\n❓ Fixed-size integers? In TVM? What?\n\nImagine Tolk already has structures, and we define an incoming message:\n\nstruct CounterIncrement {\n    counter_id: int;\n    inc_by: int;\n}\n\n\nA client sends this message following the TL/B schema:\n\ncounterIncrement \n    counter_id:int32 \n    inc_by:int64\n    = CounterIncrement;\n\n\nBut how do we tell the compiler that counter_id is int32 and inc_by is int64? This information is missing in the struct definition.\n\n✖ Rejected approaches: why they fail\n\nSeveral syntax ideas were considered:\n\n\n// type casting?\ncounter_id: int as int32; \ninc_by: int as int64;\n\n// inline annotations?\ncounter_id: int @int32;\ninc_by: int @int64;\n\n// annotations above fields?\n@serialize(int32)\ncounter_id: int;\n@serialize(int64)\ninc_by: int;\n\n\nEach of these quickly breaks down when handling more complex cases. \n\nFor example, how would we handle TL-B Maybe int32? Would we write:\n\n// this?\ninc_by: (int as int32)?;\n// or this?\ninc_by: int? as int32?;\n// or this?\ninc_by: Maybe<int> as Maybe<int32>;\n\n\nAnd what about TL/B Both (Maybe int32) int64?\n\n// this?\nmy_data: Both<Maybe<int as int32>, int as int64>;\n// or this?\nmy_data: Both<Maybe<int>, int> as Both<Maybe<int32>, int64>;\n// or how??\n\n\nWith every new case, the syntax becomes more complex, ambiguous, and error-prone.\n\n✔ The solution: `int32` as a first-class type\n\n\nstruct CounterIncrement {\n    counter_id: int32;\n    inc_by: int64;\n}\n\n\nNo annotations. No confusing as syntax. No ambiguity.\n\nThis scales perfectly:\n\nstruct MyMsg {\n    inc_by: int32?;\n    my_data: (int32?, int64);\n}\n\n\nThese are distinct types. A variable can be int32 and similar:\n\nvar op: int32 = ...;\nvar query_id: uint64 = ...;\n\n\nThis makes serialization predictable, structured, and error-free.\n\n✔ What about overflow?\n\nA reasonable question: what happens if a value exceeds the limit?\n\nvar v: uint8 = 255;\nv += 1;    // ???\n\n\nAnswer: no runtime overflow or clamping! It's just int at TVM.\n\n* arithmetic works normally – v becomes 256\n* no extra gas cost – no runtime bounds checks\n* overflow will only happen at serialization\n\n\nstruct Resp {\n    outValue: uint8;\n}\n\nresp.outValue = v;   // 256\nresp.toCell();       // a runtime \"overflow\" error\n\n\n✔ Why is this the best approach?\n\nThink of smart contracts as a black box:\n- inputs are encoded (int32, uint64, etc.)\n- inside the contract, arithmetic uses full 257-bit precision\n- outputs are serialized again — overflow happens only at this stage\n\nThis is similar to how mulDivFloor(x,y,z) uses 513-bit precision internally. Your contract keeps precision internally and only enforces constraints at the border with an outside world.\n\n🌳 Tolk will follow a type-based philosophy\n\nThis post covered the foundation of automatic serialization. The right way is to have a rich type system. Having nested types, having generics, having aliases — will allow to describe every practical TL/B case, but at a language level.\n\nIn v0.10, we introduce intN (fixed integers), bytesN (definite slices), coins (variadic integers), and some more additions. Read the details in the PR.\n\nHow will Either L R and even more complex TL/B structures be expressed? \nStay tuned for the next update...",
      "forwarded_from": "TOLK lang",
      "forwarded_from_id": "channel2203874215",
      "forwarded_date": "2025-03-20T09:12:01.000Z"
    },
    {
      "id": 200,
      "type": "message",
      "date": "2025-03-21T11:38:43.000Z",
      "date_unixtime": "1742557123",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Build a Dashboard for DeDust \n——————> Win up to $3000\n\nWelcome to our first data contest where we reward for making TON data more transparent. \n\nBuild a Dune dashboard for DeDust and win:\n🥇 1st place: $3000\n🥈 2nd place: $2000\n🥉 3rd place: $1000\n\n📅 Deadline: Mar, 24\n\nRead more:\n👉 [ Rules & Guidelines ] 👈\n(bonus task for onchain detectives inside)\n\nGot questions? Ask in our chat: @tondatachat",
      "forwarded_from": "📀 TON Data Hub",
      "forwarded_from_id": "channel2332281877",
      "forwarded_date": "2025-03-11T11:51:40.000Z"
    },
    {
      "id": 201,
      "type": "message",
      "date": "2025-03-25T11:35:51.000Z",
      "date_unixtime": "1742902551",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔨 TON Connect SDK Update\n\nWe're excited to announce a new release of the TON Connect SDK with significant enhancements for dApp developers.\n\nWe kindly request all dapp developers to update to the latest version to ensure optimal performance and user experience.\n\n👥 @tonconnect/{sdk,ui,ui-react}\n  • New wallet feature requirements API\n  • Extra currencies in transactions\n  • React 19 compatibility\n\n📁 New package versions\n  • @tonconnect/protocol 2.2.7\n  • @tonconnect/sdk 3.1.0\n  • @tonconnect/ui 2.1.0\n  • @tonconnect/ui-react 2.1.0\n\n⬇️ To update, run npm install @tonconnect/ui-react@latest or npm install @tonconnect/ui@latest\n\n💡 To learn more, visit the GitHub page at https://github.com/ton-connect/sdk.\n\n💬 Encountered issues? Please report them on GitHub at https://github.com/ton-connect/sdk/issues.\n\n⭐️ Special thanks to the Tonkeeper team for their contribution to this release!\n\n🎁 Your feedback and usage examples are crucial. Share your experiences to help us evolve the SDK!",
      "forwarded_from": "TonTech",
      "forwarded_from_id": "channel1764902466",
      "forwarded_date": "2025-03-24T22:10:20.000Z"
    },
    {
      "id": 203,
      "type": "message",
      "date": "2025-03-29T14:16:21.000Z",
      "date_unixtime": "1743257781",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🎉 Tact v1.6.5 is released!\n\nBack with another round of refinements! While we're working on many exciting things in the background, we're committed to fixing every bug that the community might discover so that Tact can provide a flawless developer experience.\n\nFurthermore, we now actively employ AI and large language model (LLM) fuzzing techniques, such as documentation-driven approaches where LLMs are given only the Tact language documentation and access to the compiler. Then, LLM agents generate potentially problematic code snippets, compile them, and analyze results. They further iterate and provide new, interesting bug reports — resolving those makes both Tact compiler and Tact documentation better at the same time!\n\nCheck out this awesome article from one of the team members to learn more: Documentation-Driven Compiler Fuzzing with Large Language Models.\n\nAnd now, let's see what's new in Tact v1.6.5, starting with the most prominent part of this patch release:\n\n🛠 Bug fixes\n\n• Ternary operator ?: now correctly works with structs and null values\n• New parser now properly handles the code that wasn't completed at the end of the file\n• The error for assembly functions and the get attribute is now correctly shown\n• Now, when you call the dump() function with an argument of the unsupported StringBuilder type, the error will always be shown even if the debug mode is disabled\n• Improper whitespace between the operator and the equals sign is no longer allowed\n• The &&= and ||= augmented assignment operators are now properly short-circuited\n• Get methods now can return an optional contract state\n• The Struct.fromSlice(), Message.fromSlice(), and similar functions now work properly if the slice has been parsed entirely and the  last field of the struct had the serialization annotation as remaining\n• The wildcard symbol _ is prohibited for struct and message struct fields, function names, contract, and trait names\n• The contract's state is now properly saved on early return statements in the receiver functions\n\n🧳 Miscellaneous improvements\n\n• Whenever you access context().sender, it now calls the sender() function instead to optimize the gas usage\n• The internalExternalReceiversOutsideMethodsMap option and its respective receiver order optimization were reworked to ensure compatibility with explorers and user wallets\n• The SendPayGasSeparately constant was deprecated in favor of SendPayFwdFeesSeparately — they're functionally identical, but the latter better expresses the intent and action that this optional flag makes when sending messages\n• The Stoppable trait now throws the exit code 133 instead of the exit code generated by the require() function from the \"Contract stopped\" message\n\n📜 See the full release notes for Tact v1.6.5\n📥 And upgrade Tact in your projects\n\nLLMs are great, but we value our community no less. It's great being around a bunch of talented, passionate, and bright engineers who make a future of safe and scalable ⚡️ Tact smart contracts on TON possible for everyone. Thank you for everything you do and for the feedback you give!\n\nA special shoutout goes to the RSquad team @rsquadlife for their early adoption of Tact features, thoughtful suggestions, and bug reports. If punk were code, they'd be its maintainers 🤘\n\n🍲 ghibli deez bugs\n♨️ @tact_kitchen from the @ton_studio",
      "media_type": "photo",
      "file": "photos/photo_203.jpg",
      "width": 776,
      "height": 683
    },
    {
      "id": 204,
      "type": "message",
      "date": "2025-03-31T17:46:07.000Z",
      "date_unixtime": "1743443167",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Tracking Transactions on TON Just Got Easier! 🎉\n\nTracking external transactions (external-in) on the TON blockchain was challenging for all of us due to minor metadata differences.\n\nNow TonAPI solves this with the normalized hash. With this method, tracking transactions is simple and reliable.\n\nWe've prepared clear examples to get you started:\n- Tracking transactions from TonConnect for dApps\n- Tracking manually constructed external messages\n\nSee code examples →\n\nWe’re excited to share this improvement, and soon more ecosystem tools will support it too!",
      "forwarded_from": "Ton Console",
      "forwarded_from_id": "channel1610779830",
      "forwarded_date": "2025-03-31T17:43:55.000Z"
    },
    {
      "id": 205,
      "type": "message",
      "date": "2025-03-31T17:46:20.000Z",
      "date_unixtime": "1743443180",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Toncenter API supported hash of a normalized external message\n\nAPI V3 (Index):\n\n- hash_norm field added to the Message structure. If the field is not present, it means this message not an external message, or the normalized hash_norm is equal to the regular hash.\n\n- All methods with msg_hash parameter search also by normalized hash.\n\nAPI V2:\n\n- api/v2/sendBocReturnHash returns the normalized hash in addition to the normal hash.",
      "forwarded_from": "Toncenter API",
      "forwarded_from_id": "channel2143019393",
      "forwarded_date": "2025-03-31T17:36:58.000Z"
    },
    {
      "id": 206,
      "type": "message",
      "date": "2025-04-08T09:35:31.000Z",
      "date_unixtime": "1744104931",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🫧 Tolk v0.11: type aliases, union types, and pattern matching\n\nThis update might confuse you at first. You may wonder: \"Why do we need this? How will it be useful?\". But in the end, you'll see how everything comes together bringing seamless and generalized message handling.\n\n✅ Notable changes in Tolk v0.11:\n\n1. Type aliases type NewName = <existing type>\n2. Union types T1 | T2 | ...\n3. Pattern matching for types\n4. Operators is and !is\n5. Pattern matching for expressions\n6. Semicolon for the last statement in a block can be omitted\n\nPR on GitHub with detailed info.\n\n✔ Type aliases\n\nTolk now supports type aliases, similar to TypeScript and Rust.\n\n\ntype UserId = int32;\ntype MaybeOwnerHash = bytes32?;\n\n\nAn alias creates a new name for an existing type but remains interchangeable with it. No performance overhead — a compile-time feature.\n\n✔ Union types `T1 | T2 | ...`\n\nThey now allow a variable to hold multiple possible types. \n\n\nfun whatFor(a: bits8 | bits256): slice | UserId { ... }\n\nvar result = whatFor(...);  // slice | UserId\n\n\nNullable types T? are now formally T | null. \n\nAt the TVM level, union types work as tagged unions — similar to Rust enums but more flexible.\n\n✔ Pattern matching\n\nThe only way to work with union types is matching them:\n\n\nmatch (result) {\n    slice  => { /* result is slice here  */ }\n    UserId => { /* result is UserId here */ }\n}\n\n\nMatching is based on smart casts — inside each branch, the variable is automatically narrowed to the matched type.\n \nIt can also be used as an expression:\n\n\ntype Pair2 = (int, int);\ntype Pair3 = (int, int, int);\n\nfun getLast(tensor: Pair2 | Pair3) {\n    return match (tensor) {\n        Pair2 => tensor.1,\n        Pair3 => tensor.2,\n    }\n}\n\n\nSo, `match` + smart casts are our way for union types. You may notice that it's close to enums in Rust. But we don't have enum. Union types are more general and powerful.\n\n✔ `match` for expressions\n\n\nval nextValue = match (curValue) {\n    1 => 0,\n    0 => 1,\n    else => -1\n};\n\n\nAs you see, match also works for constant expressions, similar to switch in other languages.\n\n✔ Union types and TL/B `Either`\n\nT1 | T2 will be directly mapped to TL-B (Either T1 T2). \nLook how clean this is: (Either SmallPayload LargePayload) becomes\n\n\nstruct StoragePart {\n    data: SmallPayload | LargePayload;\n    // (de)serialized as '0' + ... or '1' + ...\n}\n\nmatch (s.data) {\n    SmallPayload => ...\n    LargePayload => ...\n}\n\n\nNo need to manually handle bits from the slice — it's naturally expressed in the type system!\n\n✔ Union types and TL/B constructors\n\nT1 | T2 | ... is a typed way to describe multiple constructors from TL/B. Generally, they can be used anywhere inside a storage or a message. \n\nMoreover — handling incoming messages is beautifully expressed with union types.\n\n✔ Union types and future structures\n\nThe ultimate goal? You'll describe each incoming message as a struct, create a union type for them, parse a slice, and just match over variants:\n\n\n// don't mind about opcodes yet\nstruct CounterIncBy { byValue: int32 }\nstruct CounterReset {}\nstruct ... other messages\n\ntype IncomingMessage = CounterIncBy | CounterReset | ...;\n\n// ... after parsing a message\nmatch (msg) {\n    CounterIncBy => {\n        newCounter = curCounter + msg.byValue\n    }\n    CounterReset => {\n        newCounter = 0\n    }\n    ...\n}\n\n\n🌳 So, union types (that perfectly work with tensors) will seamlessly work with structures. With union types, you will declare both Either and different kinds of messages. Combined with intN and other types, they will allow to express (almost) any practical TL/B construction. They are not limited to message routing — in other words, message routing does not differ from handling any field, any storage, or any cell in general.",
      "forwarded_from": "TOLK lang",
      "forwarded_from_id": "channel2203874215",
      "forwarded_date": "2025-04-08T09:12:01.000Z"
    },
    {
      "id": 207,
      "type": "message",
      "date": "2025-04-11T14:33:57.000Z",
      "date_unixtime": "1744382037",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "📝 Sign Arbitrary Data with TON Connect\n\nThe latest update to our TON Connect implementation introduces a powerful new feature: the ability to sign arbitrary data — from plain text and binary blobs to BOC (cell) format.\n\nThis unlocks new use cases in the TON ecosystem: secure off-chain flows, verifiable signatures, and advanced on-chain logic — all through the familiar TON Connect interface.\n\nNow supported in the latest versions of Tonkeeper on iOS and Android.\n\nExplore the guide and start building →",
      "forwarded_from": "Ton Console",
      "forwarded_from_id": "channel1610779830",
      "forwarded_date": "2025-04-11T14:31:10.000Z",
      "media_type": "photo",
      "file": "photos/photo_207.jpg",
      "width": 2560,
      "height": 2560
    },
    {
      "id": 208,
      "type": "message",
      "date": "2025-04-11T15:37:40.000Z",
      "date_unixtime": "1744385860",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Bot API 9.0\n\nAnnouncing the largest Bot API update of 2025 (so far 😈)\n\n🏪 Telegram Business 2.0\n • Bots can now fully customize the branding of Business Accounts – managing their name, username, bio and profile pictures.\n • Introduced support for managing Paid Gifts  🎁, including conversions, transfers and upgrades.\n • Bots can now check ⭐️ Telegram Star balances and transfer Stars from managed businesses.\n • Bots can now easily mark Business messages as read or delete them.\n • Added extensive support for managing stories on Business accounts – featuring photos, videos and interactive elements like links, locations, reactions, weather info and even Gifts.\n • All stories posted by bots can also be edited or deleted.\n • Introduced granular Business permissions, giving users even finer control over connected bots.\n\n🗃️ Mini App Storage\n • Mini Apps can now store data locally on the user's device.  \n • Sensitive tokens can be safely persisted in a specialized secure storage.\n\n🎁 Telegram Gifts\n • Introduced support for unique Gifts – with detailed model, symbol and backdrop info.\n • Bots can also check which Gift types are accepted by users and chats.\n\n⭐️ Paid Messages\n • Bots can now track how many Stars users paid to send a message.\n • This includes out-of-the-box support for paid messages in both groups and business accounts.\n\n⭐️ Telegram Premium\n • Bots can now gift a Telegram Premium subscription paid in Stars.\n\n• And more, see the full changelog for details:\n\nhttps://core.telegram.org/bots/api-changelog#april-11-2025",
      "forwarded_from": "BotNews",
      "forwarded_from_id": "channel1004276399",
      "forwarded_date": "2025-04-11T15:29:58.000Z"
    },
    {
      "id": 209,
      "type": "message",
      "date": "2025-04-12T12:49:03.000Z",
      "date_unixtime": "1744462143",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🎉 Welcome Challenge: A Tact Developers Competition!\n\nDivaTech is launching TON Contests — a platform for hosting competitions for TON smart contract developers.\n\nTo celebrate the launch, we’re kicking off our first contest — Welcome Challenge with a $1000 prize pool!\n\nYou’ll face 5 easy-to-medium-level tasks in Tact smart contract development, with 6 hours to solve them.\n\n📅 When: April 13, 3:00 PM – 9:00 PM (GMT+3)\n🌍 Where: Online at toncontests.com\n\n🏆 Prizes:\n 🥇 Top 5: $100 each\n 🥈 Next10: $35 each\n 🥉 Next 15: $10 each\n\nRegistration for the Welcome Challenge is now open",
      "media_type": "photo",
      "file": "photos/photo_209.jpg",
      "width": 1080,
      "height": 1080
    },
    {
      "id": 210,
      "type": "message",
      "date": "2025-04-15T09:01:26.000Z",
      "date_unixtime": "1744707686",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🧠 Tact Smart Battle 🤜\n\nJoin the ultimate smart contract challenge powered by Tact, organized by TON Studio & Codeforces\n\n🏅 Prize Pool — $20,000 in Toncoin!\n\n🎯 Challenge Tasks:\n1. Simple Voting — basic voting system.\n2. Serial Voting — multiple proposals via a master contract.\n3. Scalable Voting — support up to 4 billion voters.\n4. Voting with Refunds — refunds to voters.\n5. Gas-Managed Voting — fully optimized contracts.\n\n🏆 Rewards:\n- Top 128 participants share the prize pool and receive exclusive Soulbound Tokens (SBTs).\n- All participants with valid solutions also receive a Participant SBT.\n- SBTs include embedded on-chain developer reputation.\n\n⭐️ Additional Perks:\n- Top participants will be invited for job interviews at TON Studio.\n\n⏰ Duration: 7 days\n\n🗓️ Start Date: April 21, 12:00 (UTC+3)\n🛑 Deadline: April 28, 12:00 (UTC+3)\n\nRegistration:\n👉 Challenge Link (Codeforces) \n\nRegistration guide:\n👉 Notion link\n\nCommunity & Support:\n👉 Telegram Challenge Chat\n\nGood luck and may your contracts be efficient and bug-free! 🚀🔥",
      "forwarded_from": "TON Contests",
      "forwarded_from_id": "channel1662609289",
      "forwarded_date": "2025-04-15T09:00:49.000Z"
    },
    {
      "id": 211,
      "type": "message",
      "date": "2025-04-17T11:31:02.000Z",
      "date_unixtime": "1744889462",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🎉 Tact v1.6.6 is released!\n\nThe final patch release of this v1.6 series is upon us, and it brings a significant tooling improvement, amongst other things. Meet the official Tact formatter — a new tool that ensures consistent code style across your Tact projects. It ships with Tact v1.6.6, and you can run it in your projects via npx tact-fmt or by invoking a format command in your editor. You'd need to install the Tact's language server or the VSCode extension for that — see the tact-language-server repo for details.\n\nThe v1.6.* series of patches has been a journey of refinement and polish, setting the stage for what's coming next. As we close this chapter, we're already working hard on exciting new features for the future.\n\nFor now, let's explore the Tact v1.6.6 release:\n\n🧰 Standard library additions and changes\n\n• Added compute phase exit code constants reserved by the Tact compiler, such as TactExitCodeNullReferenceException (128) and many others.\n\n• Added the SignedBundle struct and the corresponding verifySignature method.\n\n• Added sendRawMessage and sendRawMessageReturnForwardFee functions as replacements for their deprecated counterparts.\n\n• Optimized the sha256() function to about ~270 less gas used per call and added the keccak256() function that works with arbitrarily long slices.\n\n🛠 Bug fixes\n\nThere were a lot of those. Remember that last time we started fuzzing the compiler with LLMs to root out bugs? Well, we found many bugs that way and fixed even more — many error messages got way more informative and useful. Some bug fixes allowed for seemingly unrelated UX improvements too.\n\nOne nice example of a second-order fix would be that the require() function now supports constants as its second parameter. You no longer need to provide identical string literals everywhere — define a string constant somewhere and reuse it!\n\nSee the full release notes for a long list of bugs squished and error messages improved.\n\n✍️ Documentation updates\n\n• Added a \"Learn Tact in Y minutes\" page, which gives a whirlwind code-first tour of the Tact language.\n\n• Any AI vibe coders out there? The docs now generate llms.txt, llms-full.txt and llms-small.txt files for you to use with your AIs. The small version is particularly interesting as it fits in the 200k context.\n\n• The \"gas best practices\" page got updated with new recommendations, such as specialized math functions or the BasechainAddress struct and related functions.\n\n• Lots of examples fixed, with more fixes to arrive as we speak.\n\n🧳 Formatter!\n\nYou can run it via npx tact-fmt in your projects — it supports checking the formatting via the --check flag, applying fixes via the --write flag, and can check both individual files and directories of files.\n\nFurthermore, it also ships with our official language server and VSCode extensions. See the tact-language-server's README.md for installation details.\n\n📜 See the full release notes for Tact v1.6.6\n📥 And upgrade Tact in your projects\n\nIn about 4 days from now, on April 21 at 12:00 (UTC+3), the Tact Smart Battle will begin! It is the ultimate smart contract challenge powered by Tact and organized by TON Studio & Codeforces. The prize pool is $20,000 in Toncoin, and the top 128 participants will receive exclusive Soulbound Tokens (SBTs). Moreover, the best battlers will be invited for job interviews at TON Studio.\n\nAnd all participants with valid solutions would also receive a Participant SBT.\n\n👉 Register, if not already: Codeforces\n• Here's the registration guide, just in case: Notion\n• Hop in the community chat to ask questions, receive support and have fun learning and using Tact: @tact_smart_battle\n\n🍲 flint and tact\n♨️ @tact_kitchen from the @ton_studio"
    },
    {
      "id": 212,
      "type": "message",
      "date": "2025-04-21T09:00:00.000Z",
      "date_unixtime": "1745226000",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🚀 Tact Smart Battle has officially started! 🤜\n\nAll tasks are now live.  \nThe GitHub repo with setup, templates, and participation guide is here:  \n\n🐱 tact-smart-battle\n\nDive in, build, and push your skills to the limit"
    },
    {
      "id": 214,
      "type": "message",
      "date": "2025-05-12T11:21:00.000Z",
      "date_unixtime": "1747048860",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🫧 Tolk v0.12: structures, generics, and methods\n\nFinally! Or maybe not yet?\n\nThis update brings Tolk one step closer to its final form by introducing:\n\n✅ Notable changes in Tolk v0.12:\n\n1. Structures\n2. Generics\n3. Methods\n4. Stdlib with short naming\n5. Fift output enhancements\n\nPR on GitHub with detailed info.\n\n✔ Structures\n\nLooks like TypeScript — but works in TVM!\n\n\nstruct Point {\n    x: int;\n    y: int;\n}\n\nfun calcMaxCoord(p: Point) {\n    return p.x > p.y ? p.x : p.y;\n}\n\n// declared like a JS object\nvar p: Point = { x: 10, y: 20 };\n\n// called like a JS object\ncalcMaxCoord({ x: 10, y: 20 });\n\n\nPoint a just named tensor — identical to (int, int) at the TVM level.\n\nKey features:\n- Compiler guesses what you mean — automatically:\n\nfun loadData(): StoredInfo {\n    return {\n        counterValue: ...,\n        ownerAddress: ...,\n    }\n}\n\n\n- Works with shorthand syntax { x, y }\n- Default values for fields are supported\n- Nested objects are supported\n- No overhead for single-field structs over a plain value\n- Nullability, smart casts, union types, all language features — everything works\n\n✔ Generics\n\nThey exist only at the type level (no runtime cost):\n\nstruct Nullable<T> {\n    item: T? = null;\n}\n\n\nThe type system becomes powerful enough to express complex scenarios:\n\nstruct Ok<TResult> { result: TResult }\nstruct Err<TError> { err: TError }\n\ntype Response<R, E> = Ok<R> | Err<E>;\n\nmatch (r) {\n    Ok => { r.result }\n    Err => { r.err }\n}\n\n\n✔ Methods — for any types\n\nFor structures:\n\nfun Point.getX(self) {\n    return self.x\n}\n\nfun Point.create(x: int, y: int): Point {\n    return { x, y }\n}\n\n\nOr extend built-in types:\n\nfun slice.load32(mutate self): int32 {\n    return self.loadInt(32);\n}\n\n\nOr — tensors, unions, generics, even \"any receiver\". A method is just an extension function with predictable resolution rules.\n\n✔ stdlib — with short methods naming\n\n\n// before\nsomeCell.cellHash();\nsomeTuple.tupleSize();\nsomeBuilder.getBuilderBitsCount();\n\n// now\nsomeCell.hash();\nsomeTuple.size();\nsomeBuilder.bitsCount();\n\n\nEven more — some global functions are now static methods:\n\n// before\ngetMyAddress();\nsetContractData(c);\ngetLogicalTime();\n\n// now\ncontract.getAddress();\ncontract.setData(c);\nblockchain.logicalTime();\n\n\nIt looks pretty, and since IDE suggest only available methods after dot, it's extremely useful. For a full list of renamings, consider documentation.\n\n✔ A long-awaited bonus for Fift ninja\n\nLook at the PR and enjoy how readable Fift assembler output is. Yes, it contains original .tolk lines as comments! And yes, it works perfectly.\n\n🌳 You now see how Tolk's features are aligning together towards automatic serialization, fully described by the type system. Cell references, constructor prefixes, message sending, and other use cases will be expressed with the features above.",
      "forwarded_from": "TOLK lang",
      "forwarded_from_id": "channel2203874215",
      "forwarded_date": "2025-05-12T09:12:01.000Z"
    },
    {
      "id": 216,
      "type": "message",
      "date": "2025-05-30T12:15:03.000Z",
      "date_unixtime": "1748607303",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🎉 Tact Language Server & VS Code Extension v0.8.0 are live!\n\nSmarter code insight, TL-B support, fresh UI touches and a faster, quieter indexer — all wrapped into v0.8.0 release!\n\n🚀 Headline features\n\nFlexible toolchain picker – point the extension at any local Tact toolchain and switch them on the fly.\nTL-B first-class citizen – syntax highlighting, completions, document symbols, go-to-references and inline highlighting inside Tact comments.\nNext level navigation – search for functions by type, easily navigate with code lenses with go-to places where messages were sent and received\nFresh inspections – CanBeInline (with quickfix), DeprecatedSymbolUsage, MissedMembersInContract (with quickfix), NamingConvention, OptimalMathFunctions.\n\n📜 And that's not all 😎, check out our changelog to find all the improvements and fixes in the new release!\nAlso check out X/Twitter thread with announcement.\n\n📥 Upgrade now\n\nVia VS Code marketplace\nor Open VSX \n\nHappy hacking! 🛠️✨\n\n🍲 intelli-tact, you're next\n♨️ @tact_kitchen from the @ton_studio",
      "media_type": "photo",
      "file": "photos/photo_216.jpg",
      "width": 477,
      "height": 567
    },
    {
      "id": 218,
      "type": "message",
      "date": "2025-06-16T13:48:42.000Z",
      "date_unixtime": "1750081722",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔨 Dev Tools Updates\n\nFresh updates are out for TON development tools! These releases bring enhanced reliability, a smoother developer experience, and stronger tooling performance. Make sure to upgrade and enjoy the latest improvements!\n\n📁 @ton/blueprint v0.36.0 – 2025-06-16\n📁 @ton/sandbox v0.33.0 – 2025-06-16\n📁 @ton/test-utils v0.8.0 – 2025-06-16\n\n👥 Noticeable changes\n• New Jest matcher: toThrowExitCode for validating exitCode in tests.\n• New Chai assertion: throwExitCode for similar exit code validation.\n• ExitCode enum: Introduced for standardizing exit codes\n• Added fetchConfig and setGlobalVersion utility functions\n• Added blockchain.randomSeed property to update random seed in transactions or get methods\n• Added support for updating blockchain config via loadConfig and updateConfig functions\n• Blockchain.now not updating in blockchain.sendMessageIter is resolved\n• Immutability fix: Blockchain.snapshot now returns copy, not reference\n• Switched to Dirent.parentPath from deprecated .path\n• Network Provider Enhancements. Added getConfig, getContractState and waitForLastTransaction methods\n• Added utility getNormalizedExtMessageHash functions\n\n⬇ To update, run npm install @ton/blueprint@latest @ton/sandbox@latest @ton/test-utils@latest.\n\n💡To learn more, visit GitHub pages: https://github.com/ton-org/blueprint, https://github.com/ton-org/sandbox and https://github.com/ton-org/test-utils.\n\n💬 Encountered issues? Please report them on GitHub at https://github.com/ton-org/blueprint/issues.\n\n🎁 Your feedback and usage examples are crucial. Share your experiences to help us evolve the SDK!",
      "forwarded_from": "TonTech",
      "forwarded_from_id": "channel1764902466",
      "forwarded_date": "2025-06-16T13:45:30.000Z"
    },
    {
      "id": 219,
      "type": "message",
      "date": "2025-06-16T18:46:08.000Z",
      "date_unixtime": "1750099568",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "💬 Infrastructure Time\n\nWhat Infrastructure do you need to ship faster on TON?\n\nWe’re gathering feedback from the community about what’s missing, what’s needed, and what could unlock more building in the TON ecosystem! Fill out the short form:\n\nhttps://forms.gle/9MMMXDxWha1R6qxN6\n\nPlease, take this survey seriously: your input will shape TON Foundation infrastructure strategy priorities for this year."
    },
    {
      "id": 221,
      "type": "message",
      "date": "2025-06-27T18:00:28.000Z",
      "date_unixtime": "1751047228",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "📣 TON Developers — we need your feedback!\n\nHelp us shape the future of TON development. We’ve prepared a detailed survey to understand your experience with:\n🧠 Smart contract languages (Tact, Func, Tolk)\n📚 Documentation and education\n🛠 SDKs, IDEs, and tools\n🤖 Telegram Mini Apps\n💬 Developer support and pain points\n\n💎 As a thank you, we’ll issue an SBT (Soulbound Token) to your wallet as proof of contribution to the ecosystem.\n\n👉 Take the survey here:\nhttps://docs.google.com/forms/d/e/1FAIpQLSfDm85Z7YxDw96nMeV9T-b2kmd2qAe8xt0_iag8ZqrgqKuCRw/viewform\n\n🕐 Takes 5 minutes. Every voice matters.\nLet’s build a better TON together.",
      "media_type": "photo",
      "file": "photos/photo_221.jpg",
      "width": 1179,
      "height": 1177
    },
    {
      "id": 223,
      "type": "message",
      "date": "2025-07-01T08:35:11.000Z",
      "date_unixtime": "1751358911",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "https://github.com/gobicycle/bicycle/releases/tag/v0.10.1\n\nImportant update! \nChanges will soon be applied to the Mainnet that will disrupt some services (including Bicycle). A new version v0.10.1 has been released to support these changes. To maintain the functionality of bicycle, it is recommended to update as soon as possible.",
      "forwarded_from": "gobicycle",
      "forwarded_from_id": "channel1332450080",
      "forwarded_date": "2025-07-01T08:34:26.000Z"
    },
    {
      "id": 225,
      "type": "message",
      "date": "2025-07-07T09:20:56.000Z",
      "date_unixtime": "1751880056",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🫧 Tolk v1.0: lazy loading, partial updating, AST inlining — and extremely low gas fees\n\nThis is happening today. \n\nI managed not only to finish up the compiler, but also to migrate standard contracts from FunC to Tolk. \n\nI covered every contract with gas metrics to check whether it's more efficient than FunC or not. I didn't believe my eyes. I double-checked, triple-checked, but nothing changed. The results are correct. And now I am ready to present them to you.\n\n🧪 Benchmarks!\n\nEvery contract has several metrics. For example, \"basic jetton — mint\". \nFunC: 19278. Tolk: 11611. \nGas savings: -39.77%\n\n|————————————————–-\n|   01 — Jetton (mint, transfer, burn, discover)\n|   -39.77%   |   -30.32%   |   -33.66%   |   -26.75%\n|————————————————–-\n|   02 — NFT (deploy, transfer, onchain get)\n|   -43.79%   |   -37.47%   |   -44.28%\n|————————————————–-\n|   03 — Notcoin\n|   -35.72%   |   -27.98%   |   ...\n|————————————————–-\n|   04 — tgBTC\n|   -23.94%   |   -26.99%   |   ...\n|————————————————–-\n|   05 — Wallet v5\n|   -21.66%   |   -22.92%   |   ...\n|————————————————–-\n|   06 — Vesting\n|   -45.30%   |   -29.61%   |   ...\n|————————————————–-\n|   07 — Telegram gifts\n|   -54.81%   |   -39.39%   |   ...\n|————————————————–-\n\nI have migrated 7 contracts — preserving the original behavior and passing the same tests.\n\nAll benchmarks are open. No cheating. Just a smart compiler — and a language designed to be optimized.\n\n— Even wallet?! But it's very low-level and tricky!\n\nEven wallet. You just express your thoughts without any tricks — and it works automatically. \n\n— But how? How is it possible to achieve such numbers?\n\nOf course, I've put a lot of smartness into the compiler. A strong type system. Automatic inlining. Built-in serialization. The magic lazy keyword.\n\nBut first of all, Tolk is built for readability. These contracts aren't \"just cleaner\" than their FunC equivalents — they're elegant. No magic. No low-level intrigues. Just clean, consistent logic — whether it's a Jetton or a Wallet.\n\nAnd gas savings? They are a consequence. I didn't micro-optimize. Each contract was rewritten in about a day — just focusing on clarity. The core principle is simple: once you make it elegant, it automatically becomes efficient.\n\n\n✅ Notable changes in Tolk v1.0:\n\n1. Lazy loading — only read what you actually use\n2. AST-based inlining — zero-cost getters and methods\n3. Peephole optimizations, TVM-11 — smaller code, lower gas\n\nPR on GitHub with detailed info.\n\nJust take a look: \n\nval st = lazy Storage.load();\n// the compiler skips everything and loads only what you access\nreturn st.publicKey;\n\n\nThat's it. Lazy loading and partial updates (calculating immutable slices for writing) — one magic lazy keyword to rule them all.\n\n⚙️ The Release. What's inside\n\n- JetBrains IDE plugin — with completion, resolving, etc... ✓ done\n- VS Code Extension — with suggestions, stdlib integration, etc... ✓ done\n- Language server — for any LSP-compatible editor... ✓ done\n- FunC-to-Tolk converter — migrate a project in 10 seconds... ✓ done\n- Documentation — for smooth transition from FunC... ✓ done\n\nAnd the TOLK language itself — exactly as I've visioned it... 7 months ago\n\n\n📅 The essence of Numbers\n\nAt this moment, abstract yourself from the text. Take a look at the calendar.\n\nToday is 07/07/25 (I mean 2+5, of course).\n\nAfter the TON Gateway, throughout all November, I was laying out the roadmap towards Tolk v1.0. On December 1, I started working. It means, that the journey till now took exactly 7 months 7 days. If you scroll this channel to the top, you'll see an announcement... Of Tolk v0.7\n\n🪐 What's next?\n\nI could have written about my plans — for the language, TVM, ABI, TypeScript wrappers... but I won't.\n\nBecause today, instead of rushing into the future, maybe we can allow ourselves to look back.\nTo pause the endless race — just for a moment.\nTo notice how many beautiful coincidences pass us by — unnoticed in our constant hurry.\n\nJust step outside.\nClose your eyes.\nCount to seven.\nFeel it.\n\nWhen you're ready —\nLet's Tolk",
      "forwarded_from": "TOLK lang",
      "forwarded_from_id": "channel2203874215",
      "forwarded_date": "2025-07-07T09:12:02.000Z"
    },
    {
      "id": 227,
      "type": "message",
      "date": "2025-07-15T08:37:11.000Z",
      "date_unixtime": "1752568631",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🛡Hack THE TON — the first wargame platform built on TON!\n\nEthereum has legendary wargames like Ethernaut and Damn Vulnerable DeFi — tools that have onboarded thousands of developers into smart contract security.\nTON had nothing like this. So the community built it.\n\n🎮 How does it work?\nHack THE TON is a series of challenge levels, each represented by a smart contract written in Tact or Tolk.\nYour goal is to hack the contract by triggering its hidden condition.\nUse your knowledge of the TVM, analyze the logic, exploit vulnerabilities, and win!\n\n🔧 Along the way, you'll learn to:\n\n*️⃣Deepen your understanding of the TVM and TON architecture\n*️⃣Read and understand Tact/Tolk contracts\n*️⃣Analyze smart contract vulnerabilities in TON\n*️⃣Write attack contracts and exploits\n\n🏆 Completing levels contributes to your profile and reputation in the ecosystem.\n\n👾 The first wave of levels is already live.\nJoin the core of TON’s hacker community — and prove what you're capable of.\n\n👉 Start now: https://www.hacktheton.com/\n💬 Join the chat: https://t.me/hacktheton\n\n🚧 New challenges are coming soon.",
      "media_type": "photo",
      "file": "photos/photo_227.jpg",
      "width": 724,
      "height": 204
    },
    {
      "id": 229,
      "type": "message",
      "date": "2025-07-24T11:57:06.000Z",
      "date_unixtime": "1753358226",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🚀 Tolk 1.0 – The New Standard for Smart Contracts on TON Blockchain!\n\nAre you wondering which language to use for building on TON? 🤔 Tolk is TON Foundation’s recommended choice, and it’s here to elevate your smart contract game!\n\n🔹 What’s New?\nTolk 1.0 combines modern syntax and a streamlined experience with the performance and control that TON developers demand. It builds on FunC’s foundations, making smart contract development cleaner, more expressive, and more efficient.\n\n🔹 Why Tolk?\n• Primary language for TON smart contracts\n• Modern syntax + cleaner structure\n• 40% less gas compared to FunC – cheaper deployments!\n• 🛠 Full tooling, IDE support, and migration from FunC\n\nTolk brings you better performance, easier coding, and lower costs while keeping the control you need. Whether you’re new to TON or scaling a complex app, Tolk is the go-to choice for TON development.\n\nStart coding with Tolk today and build the future of TON! 🧑‍💻"
    },
    {
      "id": 231,
      "type": "message",
      "date": "2025-07-28T08:49:13.000Z",
      "date_unixtime": "1753692553",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🏆 MyTonWallet Launches Public Developer Contests\n\nWe believe the best products are born from collaboration with the community, so we invite everyone to participate in testing MyTonWallet Air—our new native app for iOS and Android.\n\nThis is a significant milestone for our wallet—native app integrates deeply with your device's operating system, using its standard elements and capabilities. The result is an app that runs significantly faster, feels more responsive, and becomes an integral part of your smartphone experience.\n\nWe're happy to launch two exciting contests ⚡️\n\n1. MyTonWallet Air QA Contest\n\nExplore the app through real user eyes: find bugs, glitches, broken user flows, or unexpected behavior.\n\nPrize pool: up to $10,000.\n\n2. MyTonWallet Air Security Bounty Program\n\nFor ethical hackers and security researchers interested in uncovering critical vulnerabilities that could compromise user assets, data privacy, or overall security.\n\nPrize pool: up to $50,000.\n\nLearn more and join the contests in our Telegram channel @mycontests—the best submissions will receive worthy rewards 👨‍💻\n\n❤ Best of luck to all the participants!\n\nNews • 𝕏 • Mini App • Download",
      "forwarded_from": "MyTonWallet · News",
      "forwarded_from_id": "channel1729567684",
      "forwarded_date": "2025-07-18T11:51:01.000Z",
      "media_type": "photo",
      "file": "photos/photo_231.jpg",
      "width": 1280,
      "height": 1280
    },
    {
      "id": 233,
      "type": "message",
      "date": "2025-08-01T11:54:12.000Z",
      "date_unixtime": "1754049252",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Introducing the Jetton 2.0 Smart Contract\n\nTransfers and operations with Jetton 2.0 are up to 3 times faster under heavy network load compared to jettons of the previous version.\n\nThis improvement was achieved thanks to new shardchain optimizations—the jetton-wallet holding a user’s token balance is now always deployed in the same shardchain as the owner’s wallet. This became possible after the TON node introduced functionality to deploy smart contracts into a specific shardchain (StateInit.fixed_prefix_length).\n\nThe smart contract is a direct successor of Jetton 1.2—used for popular tokens like $NOT—written by the TON Core team and covered by unit tests.\n\nWe would like to thank Andrew G Kiba, a community developer who made a contribution to the contract’s design.\n\nA Tolk-language version of the smart contract will be released later.\n\nhttps://github.com/ton-blockchain/jetton-contract/tree/jetton-2.0",
      "forwarded_from": "TON Core",
      "forwarded_from_id": "channel2336510893",
      "forwarded_date": "2025-08-01T10:45:38.000Z"
    },
    {
      "id": 234,
      "type": "message",
      "date": "2025-08-01T12:14:23.000Z",
      "date_unixtime": "1754050463",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🔬 TON data on Dune Advanced Guide\n\nShared some advanced sql magic for fellow analysts.\n\n🔹 How to analyze authentic users (excluding contracts and custodial wallets)\n🔹 How to calculate TVL using balance tables\n🔹 How to calculate USD volumes flowing through addresses\n🔹 How to track Telegram Stars volumes on TON Blockchain\n🔹 How to analyze both on-chain and estimated off-chain NFT trading volumes\n\nRead the article:\n🔗 blog.ton.org/how-to-analyze-ton-users-and-token-flows-on-dune\n\nIf you are new to TON data or Dune, read the first part: blog.ton.org/ton-on-chain-data-analysis-dune",
      "forwarded_from": "📀 TON Data Hub",
      "forwarded_from_id": "channel2332281877",
      "forwarded_date": "2025-07-31T15:49:01.000Z"
    },
    {
      "id": 236,
      "type": "message",
      "date": "2025-08-16T06:39:16.000Z",
      "date_unixtime": "1755326356",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "Bot API 9.2\n\n📭 Direct Messages in Channels\n• Introduced Channel Direct Messages Chats, allowing bots to send and detect Direct Messages in channels they manage.\n• Bots can now identify direct messages chats and their parent channel.\n• Bots now additionally receive topic metadata for direct messages.\n\n⭐️ Suggested Posts\n• Introduced full support for Suggested Posts in channels, unlocking granular automations via bots with sufficient rights.\n• Bots can now detect, send, approve and decline suggested posts, with detailed price and date options.\n• All relevant service messages are supported – including approvals, errors, declines, successful payments and refunds.\n\n☑️ Checklists\n• Bots can now reply directly to individual checklist tasks.\n\n🎁 Gifts\n• Gifts can now expose their publisher chat for attribution.\n\n• And more, see the full changelog for details:\n\nhttps://core.telegram.org/bots/api-changelog#august-15-2025",
      "forwarded_from": "BotNews",
      "forwarded_from_id": "channel1004276399",
      "forwarded_date": "2025-08-15T21:13:41.000Z"
    },
    {
      "id": 238,
      "type": "message",
      "date": "2025-09-19T09:16:45.000Z",
      "date_unixtime": "1758273405",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "🫧 Tolk v1.1: built-in map<K,V>, enums, private and readonly fields, method overloads\n\nTwo months have passed — maybe you even started to worry about the silence. The reason is simple: I worked on features that are \"nice to have\" but complex and time-consuming to implement — and they've only just been finished.\n\n✅ Notable changes in Tolk v1.1:\n\n1. map<K, V> — a convenient zero-overhead wrapper over TVM dictionaries\n2. enum — group numeric constants into a distinct type\n3. private and readonly fields in structures\n4. Overload resolution and partial specialization\n\nPR on GitHub with detailed info.\n\n✔ Built-in maps\n\nForget about uDictSetBuilder, sDictGetFirstAsRef, and the endless boilerplate of low-level dict helpers. A universal map<K, V> now fully replaces them.\n\n\nvar m: map<int8, int32> = createEmptyMap();\nm.set(1, 10);\nm.addIfNotExists(9, -90);\nm.delete(9);   // now: [ 1 => 10 ]\nm.exists(1);   // true\nm.isEmpty();   // false\n\n\nJust m.get() — no need to care about cells and slices under the hood:\n\nval r = m.get(1);\nif (r.isFound) {   // true\n    val v = r.loadValue();  // 10\n}\n\n// or if the key 100% exists\nval v = m.mustGet(1);  // 10\n\n\nEasily iterate forward and backward:\n\nvar r = m.findFirst();\nwhile (r.isFound) {\n    // use r.getKey() and r.loadValue()\n    r = m.iterateNext(r);\n}\n\n\nAny serializable keys and values — it just works:\n\nmap<address, Point>\nmap<Point, Cell<Extra>>\nmap<int32, map<int64, bool>>\n...\n\n\nAll in all:\n- self-explanatory methods, nicely suggested by IDEs\n- DICTISETREF, DICTREPLACE, DICTUREPLACEGET, ... — 100+ asm instructions covered by the type system\n- all deserialization to/from cells perfectly hidden by high-level API\n- absolutely zero overhead compared to low-level TVM dictionaries\n\n✔ Enums\n\nA long-awaited syntax feature for grouping constants.\n\n\n// will be 0 1 2\nenum Color {\n    Red\n    Green\n    Blue\n}\n\n\nBeing integers at runtime, enums have their own place in the type system. They resemble TypeScript/C++ enums. (Unlike Rust, where each variant may have its own shape. In Tolk we have union types — a more powerful solution)\n\n\nstruct Gradient {\n    from: Color\n    to: Color? = null\n}\n\nvar g: Gradient = { from: Color.Blue };\ng.from == Color.Red;    // false\n\n\nCompatible with all language features: auto-serialization, exhaustive pattern matching, generics, etc.\n\n✔ Private and readonly fields\n\nFields can now have modifiers:\n* private — accessible only within methods\n* readonly — immutable after object creation\n\n\nstruct PosInTuple {\n    private readonly t: tuple\n    curIndex: int\n}\n\nfun PosInTuple.last(mutate self) {\n    // `t` is visible only in methods\n    // and cannot be modified\n    self.curIndex = self.t.size() - 1;\n}\n\n\n✔ Partial specialization\n\nNow it's possible to overload methods for \"more specific\" implementations:\n\n\n// general implementation\nfun Iterator<T>.next(self) { ... }\n\n// a more specific one\nfun Iterator<Cell<T>>.next(self) { ... }\n\n\nIn complex scenarios, this feature lets you adjust the behavior of specific types while keeping a common interface. It \"just works\", but internally the compiler was enhanced with shape of types, structural depth, type dominators, and several heuristics.\n\n🌳 After Tolk v1.0 release, many people and companies started migrating from FunC to Tolk. I have received a lot of feedback and requests (and almost zero bug reports, huh). Meanwhile, a bigger roadmap is already in motion. In the near future I'll also try to close long-standing questions around TypeScript wrappers, and deliver proper from-scratch documentation.",
      "forwarded_from": "TOLK lang",
      "forwarded_from_id": "channel2203874215",
      "forwarded_date": "2025-09-19T09:12:01.000Z"
    },
    {
      "id": 239,
      "type": "message",
      "date": "2025-09-19T09:26:09.000Z",
      "date_unixtime": "1758273969",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "✈ TON Connect UI 2.3.1 — PLEASE UPDATE\n\nThis continues our push to improve reliability and success rates across the TON ecosystem.\n\n📁 @tonconnect/sdk v3.3.1\n📁 @tonconnect/ui v2.3.1\n📁 @tonconnect/ui-react v2.3.1\n\n👥 What changed\n  • BREAKING: ton_proof limits: payload ≤ 128 bytes, domain ≤ 128 bytes, payload + domain ≤ 222 bytes. If you exceed these limits, the connection will fail.\n  • BREAKING: sendTransaction & signData: requests are now strictly validated against the spec. Non-conformant requests will fail.\n  • stateInit, payload, and cell now accept both Base64 and Base64URL, auto-converted to Base64 per spec.\n  • Migrated wallet list URL to https://config.ton.org/wallets-v2.json for improved reliability\n  • Updated fallback wallets list to match https://config.ton.org/wallets-v2.json\n  • Client ID added to all deeplinks to allow better UX on the wallet side.\n  • Improved overall package quality and stability, increased test coverage.\n\n🗒 What to test\n  • Connect (ton_proof only): ensure your payload and domain sizes are within limits. Typical failure causes: the payload or domain does not meet the limits.\n  • Send transactions: verify that the request shape, required fields, types, encodings exactly match the spec. Typical failure causes: invalid address format, amount not a string, bad payload/stateInit encoding, unknown fields.\n  • Sign data: verify the request type and fields are correct. Typical failure causes: wrong type and field combination, bad encoding.\n\n⬇ To update, run npm install @tonconnect/sdk@3.3.1 @tonconnect/ui@2.3.1 @tonconnect/ui-react@2.3.1\n\n🔗 Specification https://github.com/ton-blockchain/ton-connect/blob/main/requests-responses.md#methods\n\n💬 Encountered issues? Please report them on GitHub at https://github.com/ton-connect/sdk/issues.\n\n❤ Your feedback and usage examples are crucial. Share your experiences to help us evolve the SDK!",
      "forwarded_from": "TonTech",
      "forwarded_from_id": "channel1764902466",
      "forwarded_date": "2025-09-18T18:50:17.000Z"
    },
    {
      "id": 241,
      "type": "message",
      "date": "2025-10-02T08:43:21.000Z",
      "date_unixtime": "1759394601",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "✈ TON Connect Enhancement — Domain Verification\n\nWe're introducing enhanced verification features to provide users with better transparency and trust indicators. Rollout to wallets is starting — please review your manifests to ensure optimal user experience.\n\n👥 What changed\n  • Your app's hosting domain should match the domain specified in your manifest.json → url parameter\n  • No SDK changes required, existing integrations continue working\n  • Feature is being deployed to wallets progressively\n\n🗒 What to test\n  • Domain alignment: ensure your app domain matches the domain in manifest.json url parameter. Typical issue: url parameter contains different domain than app hosting domain.\n  • Manifest accessibility: verify your manifest.json is accessible. Typical issues: CORS issues, manifest not found.\n\n🔨 Examples\n👍 Correct:\nApp hosted on: https://myapp.ton.org  \nmanifest.json: { \"url\": \"https://myapp.ton.org\", ... }\n\n👎 Incorrect:\nApp hosted on: https://myapp.ton.org  \nmanifest.json: { \"url\": \"https://another.myapp.ton.org\", ... }\n\n🔗 Specification https://github.com/ton-blockchain/ton-connect/pull/91\n\n💬 Have suggestions on the standard? Please contribute at https://github.com/ton-blockchain/ton-connect/pull/91\n\n❤ Your feedback helps us improve the TON Connect ecosystem!",
      "forwarded_from": "TonTech",
      "forwarded_from_id": "channel1764902466",
      "forwarded_date": "2025-09-30T11:12:26.000Z"
    },
    {
      "id": 243,
      "type": "message",
      "date": "2025-10-09T11:54:14.000Z",
      "date_unixtime": "1760010854",
      "from": "Unknown",
      "from_id": "unknown",
      "text": "TON x Ignyte Hackathon: Building the Web3 SuperApp Economy\n\nTON Foundation and Ignyte invite innovators worldwide to create Web3 payment, gig economy, and creator tools on Telegram, making digital payments faster and more useful for everyday life.\n\n🗓 Key Dates\n\n▪️Launch: Oct 8, 2025\n▪️Deadline: Nov 17, 2025\n▪️Finalists: Nov 21, 2025\n▪️Pitch & Awards: Nov 29, 2025\n\nWho Can Apply? \n\nStudents, early-stage startups, and scale-ups (Seed to Pre-Series A)\n\n💰 Prizes (30,000 USD Total)\n🥇 15,000 | 🥈 10,000 | 🥉 5,000\n\nThe Challenge\n\nBuild solutions that bring Web3 payments and experiences to Telegram, from instant pay for gig workers to token-gated creator tools.\n\nWinners gain mentorship, access to TON’s Ecosystem, and a chance to pilot their projects globally.\n\nApply here",
      "forwarded_from": "Toncoin",
      "forwarded_from_id": "channel1233043722",
      "forwarded_date": "2025-10-08T13:03:00.000Z",
      "media_type": "photo",
      "file": "photos/photo_243.jpg",
      "width": 1024,
      "height": 1280
    }
  ]
}